[
    {
        "title": "Conceptualising Bhāvana: How do contemplative Hindu traditions inform understanding emotions and well-being?",
        "doi": "10.1177/1354067X221118919",
        "description": "There are more than 150 (grand and micro) theories of emotion. Even as European phenomenological perspectives do mention self and agency, the mainstream discourse on emotion in psychology is quite limited in presenting a coherent theory of affective process. A key aspect of Euro-American theories of emotion is that, these theories are topographically flat, thus, unable to provide mechanisms of transformation of emotion relevant for well-being. In this paper, a theory-based framework for emotional transformation through understanding Indian concepts in āyurveda, yoga sutras and the nātya is discussed. Second, the paper proposes that it is Śānta (the Indian conceptualisation of peace) alone, that permits a substantive possibility to a radical re-emotion or experiencing and articulating well-being. The concept for a radical re-emotion is called Bhāvanā, indicating the possibility of conscious and radical re-creation and re-imagination of affective relationships with objects, concepts, processes and people in the world, re-orienting from the isolated ‘re-appraisal’, ‘self-regulation and control’ of emotion as discussed in the mainstream paradigm. The paper contends that these culturally relevant models educate and inform global psychology theory and applied practice.",
        "journal": "Culture and Psychology",
        "authors": [
            "Pandit S.A."
        ],
        "citation_count": "0"
    },
    {
        "title": "A Wattsian Perspective on Life’s Ultimate Riddle: Paradoxes, Double-Binds, and Their Resolution",
        "doi": "10.1177/00221678211032847",
        "description": "Inquiring into the role that paradox and double-binds play within the work of Alan W. Watts, this essay addresses a quintessential theme in Watts’ philosophy: a twofold sense of ontological estrangement (i.e., from oneself and from the cosmos). Such paradoxical separation constitutes an ontological double-bind and is referred to herein as life’s ultimate riddle. Based on an exegesis of 73 of Watts’ books, articles, and secondary sources, this essay presents what is called Wattsian double-bind theory, which extends David Smith’s (2010) triadic thesis of Watts’ mature works featuring a three-fold conceptual structure: the field, the double-bind, and play. Following an overview of Wattsian ontology, this essay then aims to (a) identify Watts’ double-bind framework informed by paradox, koans, double-binds, and their resolution via acceptance; (b) clarify the similarities and vast differences between Wattsian and classical Batesonian double-bind theories; and (c) reveal the interconnected elegance of the former, as it occurs in the themes of language, time, perception, identity, science, and religion.",
        "journal": "Journal of Humanistic Psychology",
        "authors": [
            "Wheeler B.L."
        ],
        "citation_count": "1"
    },
    {
        "title": "Sensing health: Bodies, data, and digital health technologies",
        "doi": "10.3998/mpub.12744203",
        "description": "In the age of Apple Watches and Fitbits, the concept of \"health\" emerges through an embodied experience of a digital health device or platform, not simply through the biomedical data it provides. Sensing Health: Bodies, Data, and Digital Health Technologies analyzes popular digital health technologies as aesthetic experiences to understand how these devices and platforms have impacted the way individuals perceive their bodies, behaviors, health, and well-being. By tracing design alongside embodied experiences of digital health, Kressbach shows how these technologies aim to quantify, track and regulate the body, while at the same time producing moments that bring the body's affordances and relationship to the fore. This mediated experience of \"health\" may offer an alternative to biomedical definitions that define health against illness. To capture and analyze digital health experiences, Kressbach develops a method that combines descriptive practices from Film and Media Studies and Phenomenology. After examining the design and feedback structures of digital health platforms and devices, the author uses her own first-person accounts to analyze the impact of the technology on her body, behaviors, and perception of health. Across five chapters focused on different categories of digital health-menstrual trackers, sexual wellness technologies, fitness trackers, meditation and breathing technologies, and posture and running wearables-Sensing Health demonstrates a method of analysis that acknowledges and critiques the biomedical structures of digital health technology while remaining attentive to the lived experiences of users. Through a focus on the intersection of technological design and experience, this method can be used by researchers, scholars, designers, and developers alike.",
        "journal": "Sensing Health: Bodies, Data, and Digital Health Technologies",
        "authors": [
            "Kressbach M."
        ],
        "citation_count": "0"
    },
    {
        "title": "A Patchwork of Hindu Ritual Practices and Technique Performances? A Re-Examination of the Citrakarmaśāstra, a Vajrayānic Sanskrit Śilpa Text Discovered in Sri Lanka",
        "doi": "10.3390/rel15020146",
        "description": "The Mañjuśrībhāṣita-Citrakarmaśāstra, a Sanskrit śilpa work discovered in Sri Lanka, deals exclusively with Buddhist image making. It provides technical instructions for the fabrication of Buddhist images as well as guidance for initial and final consecrations. This article offers a comparative intertextual study of the main body of the manuscript, including chapters concerning tree selection, the ratnanyāsa ritual, the techniques of clay modeling in the making of images, and the eye-opening ceremony. This study suggests that the Mañjuśrībhāṣita-Citrakarmaśāstra bears a remarkable resemblance to South Indian Hindu śilpa texts and does not perfectly correspond with actual practices and performances. The main part of the Mañjuśrībhāṣita-Citrakarmaśāstra is probably dated no earlier than the 11th century but no later than the 16th century.",
        "journal": "Religions",
        "authors": [
            "Wu W."
        ],
        "citation_count": "0"
    },
    {
        "title": "Social and Spiritual Transformation An Imperative Complementarity",
        "doi": "No DOI available",
        "description": "A long and unbroken chain of social and political activists, including M K Gandhi, B R Ambedkar, Paulo Freire, Martin Luther King, Desmond Tutu, Thich Nhat Hanh and bell hooks, centred their attempts at social transformation around a spiritual understanding of the world. They brought to bear reconstructed spiritual resources to address what they saw as the key challenges of their own time and context. Their work shows that without the inner transformation proposed by the ancient science of spirituality, it would prove impossible to build a society based on liberty, equality and fraternity. I would go further and argue that the insights we can draw from this science are critically essential for the very survival of humanity, indeed of all life on earth, in this era of the Anthropocene.",
        "journal": "Economic and Political Weekly",
        "authors": [
            "Shah M."
        ],
        "citation_count": "0"
    },
    {
        "title": "RAISING THE BUDDHA’S HAND: ILLUSORY OWNERSHIP IN THE EXPERIENCE OF IDENTIFICATION WITH A SUPERNATURAL AGENT IN DEITY YOGA",
        "doi": "10.1558/jcsr.22811",
        "description": "Deity yoga is a practice found in Tibetan Buddhism involving visualizations that have the normative goal of “becoming one” with a supernatural being. During the practice, practitioners report experiencing that their own body transforms into the body of the deity. This paper offers a poten-tial cognitive explanation of how such an experience is possible. Applying findings from cognitive science on the phenomenon of illusory ownership, we argue that the practice of deity yoga has the necessary means to cause an experience analogous to the famous “rubber hand illusion” in which one misattributes their ownership to a fake hand. In this paper, we 1) introduce deity yoga practice and its key aspects; 2) discuss illusory ownership and its explanation embedded in a predictive processing framework; 3) argue that visualization in deity yoga may induce the experience of illusory own-ership; and 4) conclude with a short discussion of the hypothesis’ limitations and of ways to test our hypothesis. Overall, the paper suggests how the practice of visualization in deity yoga may lead to an experience of a transfer of identity onto an imagined supernatural agent.",
        "journal": "Journal for the Cognitive Science of Religion",
        "authors": [
            "Szymanek P.",
            "Ciołkosz M."
        ],
        "citation_count": "0"
    },
    {
        "title": "‘Provocation’ reflections on Sikh Dharma at Fifty",
        "doi": "10.1080/17448727.2024.2318903",
        "description": "Our panel on Sikh Dharma at Fifty, organized for the May 2023 Sikh studies conference at the University of California-Riverside, allowed me to update what I have previously written on 3HO/Sikh Dharma in light of recent developments affecting the organization. Here I reflect further upon (1) the internal evolution of Sikh Dharma and the self-identities of its followers, (2) the impact of Sikh Dharma–both the organization and its followers–on other Sikhs and Sikhi in North America, and (3) ways in which Sikh studies scholars have written about 3HO/Sikh Dharma positioning for the wider Sikh Panth.",
        "journal": "Sikh Formations: Religion, Culture, Theory",
        "authors": [
            "Dusenbery V.A."
        ],
        "citation_count": "0"
    },
    {
        "title": "The Healer’s Dharma: Interfacing Dharma and Healing from Śākta-Tantric Perspectives",
        "doi": "10.1007/s42240-024-00163-2",
        "description": "It can be insisted that, since time immemorial, one of the fundamental functions of religion across the globe has been to heal people in various senses of “healing.” Across cultures, the figure of the religious healer has been prominent, and such a religious healer acts as a catalyst between the devotees and their beliefs in the therapeutic power of religion. This paper explores the dharma (one of the most polyvalent terms in Hinduism) of a religious healer from the Śākta-Tantric perspective. What are the ethical and spiritual paradigms on the basis of which a religious healer acts in the Śākta-Tantric universe? How can the epistemology of Śākta-Tantric healing be dialogized with the theoretical assumptions of health humanities? Apart from dealing with these questions, this paper also explores how the dharmic principles of a religious healer may differ from and can modify or expand the epistemic horizons of “medical ethics.” For critically reflecting on the dharma of a Śākta-Tantric healer, it specifically refers to the healing methods and principles of two Śākta-Tantric healers from the nineteenth- and twentieth-century Bengal, Sri Vishuddhananda Paramahamsa and Sri V. Raghunathan.",
        "journal": "Journal of Dharma Studies",
        "authors": [
            "Chakraborty S.",
            "Mukhopadhyay A."
        ],
        "citation_count": "0"
    },
    {
        "title": "The Mātṛkā Dance: Conceptualizing the Dancing Body of the Goddess",
        "doi": "10.1007/s11841-023-00988-7",
        "description": "Conceptualizing the image of a dancing Supreme Goddess in the Hindu tradition presents a philosophical challenge because it demands a coherent rational reconciliation between her nature as continuously changing into multiple forms and the realm of pure, absolute, never-changing, formless being. Different strategies have been proposed in the history of philosophy in India. This paper analyzes the image of the dancing Goddess as it appears in the Devī Māhātmya and in the Tantric iconography of the Goddess Kālī. An argument is developed to show that Śākta philosophy resolves this tension through a radical non-dualist understanding of the role that a mental image (vikalpa) plays in accessing supreme reality.",
        "journal": "Sophia",
        "authors": [
            "Funes Maderey A.L."
        ],
        "citation_count": "0"
    },
    {
        "title": "Vedānta: A Survey of Recent Scholarship (II)",
        "doi": "10.1007/s10781-023-09556-2",
        "description": "This article surveys recent work on Vedānta, focusing on English-language secondary scholarship since the year 2000. The article consists of two parts. The first part (published previously) identified trends within recent scholarship, highlighting several promising areas of new research: the social history of Vedānta, Vedānta in the early modern period, vernacular Vedānta, Persian Vedānta, colonial and post-colonial Vedānta, and pedagogy and practice. It also covered edited volumes, special journal issues, and ongoing collaborative research projects. The second part (published here) provides an overview of scholarship on specific schools of Vedānta (Advaita, Viśiṣṭādvaita, Dvaita, etc.), as well as a survey of philosophical, theological, and comparative studies. The article concludes with suggestions for further research.",
        "journal": "Journal of Indian Philosophy",
        "authors": [
            "Allen M.S."
        ],
        "citation_count": "0"
    },
    {
        "title": "Transforming Caste Domination and the Challenges of Structural Transformations and Transformation of Consciousness: Ambedkar, Shankara and Beyond",
        "doi": "10.1177/09716858231215646",
        "description": "Caste is a multidimensional reality in history and society, and it has manifested itself through varieties of structures of domination which are simultaneously cultural, economic, political and ideological as caste has also been related in complex ways with structures of class and gender domination. These structures of domination have led to the annihilation of self and society. This led Ambedkar to challenge us for annihilating caste. For Ambedkar, annihilation of caste calls for the realization of each person as an individual and not just a caste person. It also calls for the destruction of caste privileges, discrimination and their scriptural legitimation. However, this call for annihilation mainly has been a structural project without enough attention to the project of transformation of consciousness—self and social. There is a hint of this in Ambedkar’s Annihilation of Caste when he urges us to realize each one of us as unique individuals beyond the holes of caste which is further deepened in his Buddha and His Dhamma. Transformation of consciousness is also suggested in Adi Shankara’s treatise on self, Atmastakam. The essay engages itself with Ambedkar, Shankara, Gandhi and Sri Aurobindo, among others, as they help us in the transformation of caste domination and present a new hermeneutics of self-realization and social liberation. It deals with the simultaneous challenges of structural transformation of caste as well as consciousness of caste at the levels of both self and society which can draw on multiple sources of critique, creativity and transformations in India and the world. Brahminism is the poison which has spoiled Hinduism. You will succeed in saving Hinduism if you will kill Brahminism. There should be no opposition to this reform from any quarter. It should be welcomed even by the Arya Samajists, because this is merely an application of their own doctrine of guna-karma. Whether you do that or you do not, you must give a new doctrinal basis to your religion—a basis that will be in consonance with liberty, equality and fraternity; in short, with democracy. I am no authority on the subject. But I am told that for such religious principles as will be in consonance with liberty, equality and fraternity, it may not be necessary for you to borrow from foreign sources, and that you could draw for such principles in the Upanishads. Whether you could do so without a complete remoulding, a considerable scraping and chipping off from the ore they contain, is more than I can say. (Ambedkar, 2002[1936], p. 303)",
        "journal": "Journal of Human Values",
        "authors": [
            "Giri A.K."
        ],
        "citation_count": "0"
    },
    {
        "title": "Global Meditation Practices: A Literature Review",
        "doi": "10.1097/HNP.0000000000000626",
        "description": "Research has shown that meditation is beneficial for chronic pain, stress, and many physical and mental conditions. The definition of meditation has many forms, is culturally influenced, and is practiced globally. This literature review seeks to report current literature on meditation related to therapeutic outcomes and create a globally informed definition of meditation for health-related purposes. From a western perspective, mindfulness-based stress relief (MBSR) is widely researched. Therefore, 15 studies from peer-reviewed research from 2015 and 2020 were used to examine various forms of meditation and describe a broader range of meditation practices other than MBSR. The different forms of meditation are: Acceptance and Commitment Therapy (Portugal), Active Engagement (Portugal), Adapted Mindfulness Program (Brazil), Adapted Mindfulness Program (Brazil), Cognitively-based Compassionate Training, Loving-kindness (United States, US), Mantra Meditation (US), Mindfulness-based stress reduction (US), Mindfulness-based cognitive therapy (South Korea), Osho (India), Psychoneuroendocrinoimmunology (Italy), Transcendental Meditation (Italy), Spiritual/Secular (US), Sufi (Pakistan), and Vipassana (Australia). The review was completed using a literature search method, and all meditation approaches report positive therapeutic outcomes for all participants (n = 768). This outcome enabled the creation of a broader therapeutic definition of meditation that can be applied in clinical practice.",
        "journal": "Holistic Nursing Practice",
        "authors": [
            "Valluri J.",
            "Gorton K.",
            "Schmer C."
        ],
        "citation_count": "0"
    },
    {
        "title": "IN THAT VERY BODY, WITHIN THAT VERY DREAM: SOTERIOLOGICAL DREAMING TECHNIQUE IN THE TRADITION OF BUDDHIST YOGIS",
        "doi": "10.35469/poligrafi.2023.403",
        "description": "The first part of the paper briefly outlines the role of dreams in early Buddhism and their importance in establishing the continuity of the whole tradition, before presenting in the second part entirely new aspects of dreams in the Buddhist eremitic tradition, influenced by the Tantric spiritual horizon, in particular by a transformed concept of the body. The central part of the paper follows an analysis of the soteriological technique of dreaming (Tib. rmi lam) in the tradition of Buddhist yogis and yoginīs, based on the fragments of mahāsiddha Tilopa (Ṣaḍdharmopadeśa), Gampopa’s commentaries, collected in the treatise Dags po'i bka' 'bum, and findings from studies on Buddhist eremitic tradition in Ladakh in the region of the Indian Himalayas. The four stages of dream yoga are also highlighted in relation to other psychophysical soteriological techniques (the six dharmas, Skrt. ṣaḍdharma, Tib. chos drug). The philosophical and soteriological foundations of dream yoga are presented on the basis of the doctrine of consciousness in the yogācāra school, highlighting in particular the three modifications of consciousness presented by Vasubandhu. The last part the paper outlines the significance of training in the dreaming technique in the very process of dying that leads to the unconditioned state beyond life and death, nirvāṇa.",
        "journal": "Poligrafi",
        "authors": [
            "Petek N."
        ],
        "citation_count": "0"
    },
    {
        "title": "Policy and practice informed by the ancient science of spirituality",
        "doi": "10.1108/978-1-83753-380-020231002",
        "description": "Today, as we hurtle towards imminent planetary destruction in the age of the Anthropocene, we believe it may be instructive to try and understand if the ancient science of spirituality can prove useful in humankind's ability to change course, even at this late hour. We argue that such a paradigm shift is critically essential for human survival and that without the inner transformation proposed by this science, it may prove impossible to build a society based on the principles of liberty, equality and fraternity. This chapter draws from foundational texts and authoritative sources across multiple religious traditions, based upon which it outlines a brief sketch of the ancient science of spirituality. We begin with an account of the differentia specifica of this science, where we delve into what kind of science this is. Since it is centrally concerned with inner transformation, we briefly outline the theory of change embedded in this science and the kind of rejuvenation it enables, which makes it possible for us to clearly perceive the key elements and the structure of reality. We then spell out the impact this has on the nature of human action, continually teasing out implications for policy and practice in our time. We provide a few concrete illustrations of the same. Inter alia, we also show how many of these insights can be found even within modern scientific and philosophical traditions, thereby indicating possibilities of convergence and synthesis between ancient and modern science, following thereby the guidance of genuine spirituality.",
        "journal": "Applied Spirituality and Sustainable Development Policy",
        "authors": [
            "Shah M."
        ],
        "citation_count": "1"
    },
    {
        "title": "Introduction",
        "doi": "No DOI available",
        "description": "No description available",
        "journal": "Situating religion and medicine in Asia: Methodological insights and innovations",
        "authors": [
            "Stanley-Baker M."
        ],
        "citation_count": "0"
    },
    {
        "title": "Sound medicine: Towards a nomadology of medical mantras in seventeenth to twentieth-century Bengal",
        "doi": "No DOI available",
        "description": "No description available",
        "journal": "Situating religion and medicine in Asia: Methodological insights and innovations",
        "authors": [
            "Mukharji P.B."
        ],
        "citation_count": "0"
    },
    {
        "title": "Sowa Rigpa, Tibetan medicine, Tibetan healing",
        "doi": "No DOI available",
        "description": "No description available",
        "journal": "Situating religion and medicine in Asia: Methodological insights and innovations",
        "authors": [
            "Samuel G."
        ],
        "citation_count": "0"
    },
    {
        "title": "Questioning the boundaries between medicine and religion in contemporary Myanmar",
        "doi": "No DOI available",
        "description": "No description available",
        "journal": "Situating religion and medicine in Asia: Methodological insights and innovations",
        "authors": [
            "Coderey C."
        ],
        "citation_count": "0"
    },
    {
        "title": "From the Yoga Mat to the Social Realm: Yoga and Gender in Brazil",
        "doi": "10.1007/s41603-023-00210-z",
        "description": "If in pre-modern times yoga was almost an exclusive masculine activity, in contemporary times, at least in the West, yoga is dominated by women. The purpose of this paper is to present the results of a qualitative research on yoga and gender in Brazil. Female participants were interviewed online, and their narratives were then transcribed and analyzed according to thematic content analysis. Four thematic groups emerged from the analysis: (a) meanings of yoga; (b) body/mental changes; (c) Social class, ethnicity, and gender; and (d) feminisms and yoga. Yoga teachers in most Brazilian regions are mainly white women, with a low participation of black women or even members of the LGBTQIA+ community. Although the interviewees are not aware of the different historically defined feminist waves, they see yoga as an opportunity to seek self-empowerment, not necessarily through feminist values, but through the tenets of yogic philosophy. In addition, through yoga, they pursue the cultivation of well-being and a profession, corroborating the fact that yoga can serve as an emancipation tool for women.",
        "journal": "International Journal of Latin American Religions",
        "authors": [
            "Siegel P."
        ],
        "citation_count": "0"
    },
    {
        "title": "The cult of Tara: Magic and ritual in Tibet",
        "doi": "No DOI available",
        "description": "\"The real history of man is the history of religion.\" The truth of the famous dictum of Max Muller, the father of the History of Religions, is nowhere so obvious as in Tibet. Western students have observed that religion and magic pervade not only the forms of Tibetan art, politics, and society, but also every detail of ordinary human existence. And what is the all-pervading religion of Tibet? The Buddhism of that country has been described to us, of course, but that does not mean the question has been answered. The unique importance of Stephan Beyerís work is that it presents the vital material ignored or slighted by others: the living ritual of Tibetan Buddhists. The reader is made a witness to cultic proceedings through which the author guides him carefully. He does not force one to accept easy explanations nor does he direct one's attention only to aspects that can be counted on to please. He leads one step by step, without omitting anything, through entire rituals, and interprets whenever necessary without being unduly obtrusive. Oftentimes, as in the case of the many hymns to the goddess Tara, the superb translations speak directly to the reader, and it is indeed as if the reader himself were present at the ritual.",
        "journal": "The Cult of Tara: Magic and Ritual in Tibet",
        "authors": [
            "Beyer S."
        ],
        "citation_count": "76"
    },
    {
        "title": "Sexuality and spirituality: Insights on sex and enlightenment",
        "doi": "10.1016/j.ajp.2023.103793",
        "description": "No description available",
        "journal": "Asian Journal of Psychiatry",
        "authors": [
            "Mikheeva A.",
            "Agoramoorthy G."
        ],
        "citation_count": "0"
    },
    {
        "title": "“Madhyamakanising” Tantric Yogācāra: The Reuse of Ratnākaraśānti’s Explanation of maṇḍala Visualisation in the Works of Śūnyasamādhivajra, Abhayākaragupta and Tsong Kha Pa",
        "doi": "10.1007/s10781-023-09548-2",
        "description": "The eleventh-century Indian Buddhist master Ratnākaraśānti presents a unique Yogācāra interpretation of tantric maṇḍala visualisation in the *Guhyasamājamaṇḍalavidhiṭīkā. In this text, he employs the neither-one-nor-many argument to assert that the qualities of the mind represented by the deities in the maṇḍala are neither the same nor different from the mind itself. He also provides five scenarios of meditation to explain the necessity of practising both the perfection method (pāramitānaya) and the mantra method (mantranaya) together in Mahāyāna. Ratnākaraśānti’s explanation exerts a significant influence on the works of later Buddhist masters in India and Tibet, with parts of it being reused in the *Śrīherukopadeśanāmasvādhiṣṭhānakrama by Śūnyasamādhivajra (c. the eleventh century), the eighteenth chapter of the Āmnāyamañjarī by Abhayākaragupta (from the late eleventh to the twelfth century) and the tantric compendium sNgags rim chen mo by the Tibetan master Tsong kha pa Blo bzang grags pa (1357–1419). This paper explores how Ratnākaraśānti’s explanation has been reused and modified in these subsequent works. While Śūnyasamādhivajra faithfully reproduced Ratnākaraśānti’s Yogācāra explanation, Abhayākaragupta modified it to align with his Madhyamaka view. Abhayākaragupta in turn influenced Tsong kha pa, who accepted Abhayākaragupta’s Madhyamaka modification in his works. This paper also engages with current scholarly discussions on textual reuse and the underlying reasons behind it. While Śūnyasamādhivajra and Abhayākaragupta assimilated Ratnākaraśānti’s explanation without acknowledgement, Tsong kha pa quoted the text by name and acknowledged Abhayākaragupta’s reuse of Ratnākaraśānti’s explanation. This paper concludes by discussing the factors that determine whether the reused text is acknowledged or not, and the possible reasons behind textual reuse.",
        "journal": "Journal of Indian Philosophy",
        "authors": [
            "Cheung D.S.Y."
        ],
        "citation_count": "0"
    },
    {
        "title": "American poly: A history",
        "doi": "10.1093/oso/9780197659144.001.0001",
        "description": "The first history of polyamory, this work examines the roots of sexual non-monogamy in political thought and countercultural spiritualism and traces its path to mainstream practice and cultural discussion today. Recent studies have found that as many as one in five Americans have experimented with some form of sexual non-monogamy, and approximately one in fifteen knows someone who was or is polyamorous. Although gathering statistics on polyamorous people is challenging, there has clearly been a growing interest in and normalization of relationship practices defined by emotional intimacy and romantic love among multiple people. Over the past decade, the mainstream media has increasingly covered polyamorous lifestyles and the committed relationships of throuples, and popular dating apps have added polyamory as a status option. This book is the first history to trace the evolution of polyamorous thought and practice within the broader context of American culture. Drawing on personal journals and letters, underground newsletters, and publications from the Kinsey Institute Archives, among other sources, it reconstructs polyamory's intellectual foundations, highlighting its unique blend of conservative political thought and countercultural spiritualism. Christopher M. Gleason locates its early foundations in the Roaring Twenties among bohemians. In the 1950s and 1960s it surprisingly emerged among libertarian science fiction writers. The next wave of polyamorists belonged to countercultural communities that rejected traditional Christianity; some were neo-Pagans and New Age tantric practitioners who saw polyamory as intrinsic to their spirituality. During the 1980s polyamory developed as a coherent concept, faced backlash from conservatives, and tried to organize into a social and political movement with a national network. Throughout the 1990s, polyamorists utilized the internet to spread their ideas, often undermining any remaining religious or spiritual significance their ideas held. Polyamory now encompasses a diverse set of people, from those with libertarian leanings seeking unlimited freedom from government interference in their consensual partnerings to those who pursue legal recognition of their relationships, especially issues revolving around children. Offering an original perspective on sexuality, marriage, and the family, American Poly reveals the history of polyamory in the United States from fringe practice to a new stage of the sexual revolution.",
        "journal": "American Poly: A History",
        "authors": [
            "Gleason C.M."
        ],
        "citation_count": "0"
    },
    {
        "title": "Gāyatrī in the Modern Era: Ritual Innovation and Universalization of a Mantra",
        "doi": "10.1558/rosa.23214",
        "description": "The Gāyatrī is a ubiquitous Vedic verbal ritual formula (mantra) in Brāhmaṇical traditions and the modern period of Hinduism. This essay traces the Gāyatrī’s changing theological backgrounds, ritual contexts and political uses in the modern period. It seeks to understand the history of the Gāyatrī’s transformations in modern India, and questions how the Gāyatrī transitioned from a private initiation ritual in Vedic Brāhmaṇical culture to a popular public mantra. Hindu reform movements at the turn of the twentieth century provide important clues for how the mantra may have become more public, particularly through reconversion rituals (śuddhis) to Hinduism regardless of gender, religion, or caste. Reconversion rituals contributed to removing the Gāyatrī from the jurisdiction of orthodox Brāhmaṇical authorities, and transformed it from a central symbol of twice-born Vedic identity into a broader symbol of Hindu identity. In some cases, the Gāyatrī is now universalized as a secular mantra in India, though one that maintains tacit Hindu or Indian nationalist identities.",
        "journal": "Religions of South Asia",
        "authors": [
            "Dalal N."
        ],
        "citation_count": "0"
    },
    {
        "title": "Exploring mysticism: A methodological essay",
        "doi": "No DOI available",
        "description": "Until less than a century ago, the two prevailing views of dreams as well as of souls were that they are inconsequential (the scientific view) or of divine origin (the religious view). In either case it was assumed that they cannot be objects of rational inquiry. Similar views still prevail regarding mystical experiences and mysticism in general. Modern Western opinion, whether friendly or hostile, holds that the mystical falls squarely within the domain of the irrational. Mr. Staal argues that mysticism can be studied rationally, and that without such study no theory of mind is complete. He exposes the grounds for the belief that mysticism cannot be studied, and shows them to be prejudices issuing from a particular historical development. While his contention has unflattering implications for the contemporary study of the humanities in general, it reveals in particular that existing academic approaches to the study of mysticism, even those that appear sound, are in fact inadequate. This conclusion applies to a variety of dogmatic inquiries and, as becomes clear in these pages, to philological, historical, phenomenological, sociological, physiological, and psychological ones as well. The illustrations in Exploring Mysticism are drawn mainly from Indian forms of mysticism such as Yoga, supplemented with Buddhist, Taoist, Muslim and Christian examples.",
        "journal": "Exploring Mysticism: A Methodological Essay",
        "authors": [
            "Staal F."
        ],
        "citation_count": "33"
    }
]