[
    {
        "title": "Plant Health Detection and Monitoring",
        "doi": "10.1007/978-1-4939-2836-1_11",
        "description": "One of the major applications for hyperspectral imaging is plant health detection and monitoring. In this chapter, various ground-based, airborne and spaceborne sensing systems are described. Different applications are discussed such as detection of plant water status, plant nutrient and disease, insect damage, weeds, fruit quality, number of mature and immature fruit, and fruit maturity status. Some of the major techniques used include equivalent water thickness (EWT) and normalized difference water index (NDWI) for monitoring plant water status; derivative chlorophyll index, natural chlorophyll fluorescence emission, and vegetation indices (VI) for plant nutrient status; and fluorescence, thermography, spectral library, mixture tuned match filtering (MTMF), spectral angle mapping (SAM), and spectral feature fitting (SFF) for plant disease detection. One of the key observations in these applications is that remote sensing could be better applied to assess damages by plant diseases than to detect early disease infections.",
        "journal": "Food Engineering Series",
        "authors": [
            "Lee W.S."
        ],
        "citation_count": "0",
        "full_text": "\"Your privacy, your choice We use essential cookies to make sure the site can function. We also use optional cookies for advertising, personalisation of content, usage analysis, and social media. By accepting optional cookies, you consent to the processing of your personal data - including transfers to third parties. Some third parties are outside of the European Economic Area, with varying standards of data protection. See our privacy policy for more information on the use of your personal data. Manage preferences for further information and to change your choices. Accept all cookies Skip to main content Advertisement Log in Find a journal Publish with us Track your research Search Cart Hyperspectral Imaging Technology in Food and Agriculture pp 275–288Cite as Home Hyperspectral Imaging Technology in Food and Agriculture Chapter Plant Health Detection and Monitoring Won Suk Lee  Chapter 2795 Accesses 2 Citations Part of the book series: Food Engineering Series ((FSES)) Abstract One of the major applications for hyperspectral imaging is plant health detection and monitoring. In this chapter, various ground-based, airborne and spaceborne sensing systems are described. Different applications are discussed such as detection of plant water status, plant nutrient and disease, insect damage, weeds, fruit quality, number of mature and immature fruit, and fruit maturity status. Some of the major techniques used include equivalent water thickness (EWT) and normalized difference water index (NDWI) for monitoring plant water status; derivative chlorophyll index, natural chlorophyll fluorescence emission, and vegetation indices (VI) for plant nutrient status; and fluorescence, thermography, spectral library, mixture tuned match filtering (MTMF), spectral angle mapping (SAM), and spectral feature fitting (SFF) for plant disease detection. One of the key observations in these applications is that remote sensing could be better applied to assess damages by plant diseases than to detect early disease infections. Keywords AVIRIS Citrus canker disease Citrus greening disease Fluorescence Fruit maturity Huanglongbing (HLB) Immature fruit Leaf pigments Mixture tuned match filtering (MTMF) Spectral angle mapping (SAM) Spectral feature fitting (SFF) Spectral signature Thermography Vegetation indices Access provided by University of Nebraska-Lincoln. Download chapter PDF 1 Introduction Plant health detection and monitoring is one of the main applications of hyperspectral imaging to agriculture, which include detection of water content, nutrient status, and pest damages including disease infections and insect damages. Different ground-based, airborne, and spaceborne sensing systems are used to detect and monitor plant health. Airborne and spaceborne imaging spectroscopy was established in the 1990s (Ustin et al. 2004). These systems basically can measure electromagnetic radiation from different crop plants to determine their status of water, nutrition, and degree of pest infestation using specific spectral signatures of different plant status. Ustin et al. (2004) provided an excellent overview by describing advances in airborne and spaceborne imaging spectrometers to observe and monitor different processes and properties in ecosystems along with various applications. They reported that detection of photosynthetic pigments (chlorophyll, xanthophylls, carotenes, and algal pigments) in the visible range shows great potential for various applications; in the NIR range, strong absorption exists by water (870 and 1,240 nm) and leaf compounds such as cellulose, lignin, and carbohydrates. In 1,100–2,500 nm, carbon compounds including cellulose, lignin, nitrogen, starches, and sugars exhibit strong absorption. These chemical differences can be used to create a vegetation map with different types of stresses. When plants lose chlorophyll, reflectance in the visible and NIR ranges increases, and the red edge is shifted up to 25 nm toward shorter wavelengths (named as the “blue shift”). Figure 11.1 shows an example of plant pigment extraction using the Airborne Visible/Infrared Imaging Spectrometer (AVIRIS). For plant water content detection, several water absorption bands (1,450, 1,940, and 2,500 nm) can be used as well as different band ratios such as the normalized difference water index (NDWI) and plant water index (PWI). Fig. 11.1 Example of plant pigments extraction from a hyperspectral image cube using the Airborne Visible/Infrared Imaging Spectrometer (AVIRIS) (adapted from Ustin et al. 2004) Full size image Sankaran et al. (2010) reviewed different techniques for detecting plant diseases. They reported that no commercial sensor exist for tree health conditions, and presented the need for a rapid and reliable sensor system. They reported two different approaches for detecting plant diseases: (1) direct methods including serological and molecular methods, and (2) indirect methods including imaging and spectroscopic techniques, biomarkers using volatile organic metabolites, and plant properties/stress based disease detection. They pointed out one of the challenges in hyperspectral image analysis is to choose proper disease-specific spectral bands and statistical method, and that imaging technique can be used with an autonomous agricultural vehicle for automatic real-time monitoring. Lee et al. (2010) reviewed plant disease detection methods for specialty crops, and mentioned that any disease causing differences in spectral characteristics can be detected using remote sensing. They mentioned that remote sensing of plant disease could be used more effectively for damage assessment than identifying early disease infection, as early detection would be difficult or impossible in some situations. They also mentioned that more research is needed for developing efficient disease detection algorithm for practical farming operations and distinguishing the diseases from other stresses. The following describes different applications of plant health detection for agricultural crop production. 2 Water Status Monitoring Water plays a very important role for optimal plant growth. With strong water absorption bands in the electromagnetic spectrum, hyperspectral imaging has been used for monitoring plant water status. Allen et al. (1969) defined the equivalent water thickness (EWT) as “the hypothetical thickness of a sheet of liquid water in the target”. From this definition, Jacquemoud and Baret (1990) calculated the EWT of plant biomass as: $$ {\\\\mathrm{EWT}}_{\\\\mathrm{Biomass}} \\\\left(\\\\mathrm{cm}\\\\right)=\\\\frac{Fresh mass \\\\left({\\\\mathrm{cm}}^3\\\\right)- Dry mass \\\\left({\\\\mathrm{cm}}^3\\\\right)\\\\ }{Leaf area \\\\left({\\\\mathrm{cm}}^2\\\\right)} $$ Champagne et al. (2003) developed a physical model to estimate the canopy equivalent water thickness from airborne hyperspectral imaging with the Probe-1 sensor using a spectrum matching technique and look-up table approach. They tested the model using various crops (wheat, canola, corn, beans, and peas) by comparing EWT estimation (Fig. 11.2) and actual crop water status, and reported an RMSE of 0.052 cm. They observed that the model was more sensitive to water content in leaf than the water content in the whole plant. Further, Cheng et al. (2006) investigated the relationships between canopy water content and the EWT using three linked leaf and canopy radiative transfer models with different canopy structures: closed, row-structured, and forest canopy architectures. They estimated EWT from the AVIRIS imagery and found good agreement of EWT for agricultural crops with enhanced vegetation index (EVI), however better agreement was observed for conifer forest between EWT and normalized difference water index (NDWI) and shortwave infrared water stress index (SIWSI) than EVI, indicating canopy architecture should be considered when estimating EWT. As a recent study, Kim et al. (2010) utilized spectral indices from hyperspectral images to monitor water stress of young apple trees in a greenhouse, and reported red edge normalized difference vegetation index (NDVI) at 705 and 750 nm, and NDVI at 680 and 800 nm yielded the highest correlation with the water stress. Fig. 11.2 Example equivalent water thickness derived from an airborne hyperspectral image (adapted from Champagne et al. 2003) Full size image 3 Nutrient Status Monitoring Plant nutrient monitoring is also a very important application of hyperspectral imaging for agricultural crop production. Applications include estimation of leaf pigments such as chlorophylls and carotenoids, and nitrogen content. In early 2000s, Zarco-Tejada et al. (2002) used the fluorescence–reflectance–transmittance (FRT) and PROSPECT leaf models to mimic reflectance which were able to estimate chlorophyll fluorescence and chlorophyll a + b content. They developed a derivative chlorophyll index (DCI = D705/D722, where D is derivative of reflectance) based on double peak feature of derivative reflectance, which could be used to estimate plant stress. Further Zarco-Tejada et al. (2003) conducted experiments in controlled environments to observe natural chlorophyll fluorescence emission, and identified that the double-peak feature between 688, 697, and 710 nm of canopy derivative reflectance was due to chlorophyll fluorescence (Fig. 11.3). This double peak feature could be used to monitor plant stress by detecting changes in pigment and canopy structure. Fig. 11.3 Double-peak feature between 688, 697, and 710 nm of canopy derivative reflectance due to natural chlorophyll fluorescence emission (adapted from Zarco-Tejada et al. 2003) Full size image In another study, Haboudane et al. (2004) investigated different vegetation indices (VIs) to green leaf area index, developed new VIs and reported that two newly developed VIs (a modified triangular vegetation index (MTVI2) and a modified chlorophyll absorption ratio index (MCARI2)) worked well to predict green leaf area index (LAI). Blackburn (2007) discussed the importance of leaf pigments such as chlorophylls and carotenoids, different remote sensing platforms for measuring them, various issues in measuring pigments, new methods for analyzing hyperspectral data, and emerging applications including determination of crop N requirements, identification of high yielding genotypes, and mapping in-field crop yield variability. For plant nitrogen status detection, Goel (2003) investigated detection of nitrogen status and weeds in corn and soybean using aerial hyperspectral imaging, and found that 498 and 671 nm were highly related to N levels. They also reported that 701 and 839 nm were found to be important in yield prediction models, and decision trees and artificial neural networks showed strong potential for agricultural remote sensing applications. Min and Lee (2005) investigated reflectance characteristics of citrus leaves of varying nitrogen (N) concentrations, and identified important wavelengths (448, 669, 719, 1,377, 1,773, and 2,231 nm) for N detection using stepwise multiple linear regression (SMLR) and partial least squares (PLS) regression. Further Min et al. (2008) developed a portable hyperspectral sensing system in 620–950 nm and 1,400–2,500 nm to measure citrus nitrogen concentration using detector arrays, linear variable filters, a halogen light, and data acquisition cards. The sensor system had good linearity and stability, and was able to estimate citrus N content with a root mean square difference (RMSD) of 1.69 g/kg. 4 Detection of Plant Disease and Insect Damage Plant disease and insect damage detection are the mostly adopted application for hyperspectral imaging in agriculture. Plant disease detection includes fungal infestation, stem rot disease, yellow rust in winter wheat, rice brown spot disease, citrus canker disease, citrus greening disease (also known as Huanglongbing or HLB), apple scab disease, and diseases in rice, potato, and tomato. Lee et al. (2010) described different measurement techniques of foliar plant diseases based on their infection stages, as shown in Fig. 11.4. Fig. 11.4 Illustration of different techniques to identify foliar diseases based on infection stages (adapted from Lee et al. 2010) Full size image For fungal disease detection, Muhammed (2002) investigated discrimination of healthy and diseased plants, and estimation of level of infection of the fungi infested plants through simple steps of pre-processing and nearest neighbor classification, using correlation and sum of squared differences between a reference and unknown spectra. Laudien et al. (2003) studied detection of sugar beet disease by fungal infection using a ground-based hyperspectral spectroradiometer and were able to identify the disease using red edge (a ratio between reflectance at 750 and 700 nm) and modified chlorophyll-absorptions-integral (mCAI) index (an area of the trapeze of reflectance between 545 and 752 nm). $$ \\\\mathrm{mCAI}=\\\\frac{\\\\left(R545+R752\\\\right)}{2} * \\\\left(752-545\\\\right) - {\\\\displaystyle \\\\sum_{R545}^{R752}}\\\\left(R * 1.158\\\\right) $$ As an example of stem rot disease detection, Vigier et al. (2004) utilized a narrowband spectrometer to detect sclerotinia stem rot diseases in soybean and reported the red narrow band (R675–R685) was the most contributable to damage estimation. For yellow rust disease detection for winter wheat, Moshou et al. (2005) investigated fusion of ground based multispectral and hyperspectral fluorescence imaging to detect crop disease (yellow rust in winter wheat) in an early stage before no visible symptoms show, and reported that disease presence could be detected by comparing fluorescence images at 550 and 690 nm. The overall classification error between healthy and diseased plant reduced to 1 % after data fusion using a Self-Organizing Map (SOM) neural network. Huang et al. (2007) evaluated the photochemical reflectance index (PRI = (R531 − R570)/(R531 + R570)) to quantify yellow rust disease in winter wheat and reported an R2 of 0.97 between PRI and measured spectral data, and an R2 of 0.91 between PRI and airborne hyperspectral data. For the citrus canker disease detection, Qin et al. (2008) utilized principal component analysis (PCA) to detect citrus canker disease from hyperspectral images acquired by a portable hyperspectral imaging unit, and identified four important wavelengths (533, 677, 718, and 858 nm), while reporting an overall 92.7 % detection accuracy. Further Qin et al. (2009) applied spectral information divergence (SID) classification method to detect citrus canker and other citrus surface conditions, and reported an overall accuracy of 96.2 % for citrus canker detection. Balasundaram et al. (2009) identified that wavelengths in 500–800 nm range showed the highest discriminatory power to detect citrus canker disease in grapefruit, and reported that wavelengths above 1,100 nm did not contain significant wavelengths. Citrus greening disease or Huanglongbing (HLB) is a catastrophic disease in Florida, since there is no cure. The disease was first found in 2005 in Florida and is spread most of Florida and other states in the USA. Currently ground inspection is being conducted to identify infected tree canopies, however it is subjective, time consuming, and labor intensive. Therefore, aerial hyperspectral imaging can be well applied for the HLB detection, which can provide a rapid detection over a wider area. As a first step for the disease detection, Mishra et al. (2007) measured HLB infected tree canopies with a handheld spectrometer (FieldSpec UV/VNIR, Analytical Spectral Devices, Boulder, CO) in 350–2,500 nm, and reported that wavelengths of 530–564, 710–715, 1,041, and 2,014 nm showed higher discriminant capability between healthy and infected canopies. Then, Lee et al. (2008) compared laboratory and ground measurement spectra of healthy and infected citrus tree canopies to detect the citrus greening disease, and reported that reflectance differences existed at 550 nm for healthy, diseased, and zinc-deficient canopies. HLB infected tree canopy could be detected based on first derivative peak near 730 nm. Also ANOVA analysis showed significant difference was found between healthy and infected tree canopies. However, variability of healthy and HLB infected canopies and georeference errors were main obstacles in detecting the disease. Kumar et al. (2009) investigated detection of the HLB disease using airborne hyperspectral images in 400–1,000 nm. Different algorithms including image-derived spectral library, mixture tuned match filtering (MTMF), spectral angle mapping (SAM), and spectral feature fitting (SFF) were employed. They reported an overall accuracy of 60 % using SAM, largely attributed to the inaccuracies of ground truthing. Further, Kumar et al. (2010) acquired aerial multispectral and hyperspectral images to detect the citrus greening disease, constructed spectral library for healthy and HLB infected canopies, applied SAM, MTMF, and linear spectral unmixing (LSU), and reported detection accuracies of 60–87 %, 73–80 %, and 53–73 % for SAM, MTMF, and LSU, respectively, depending on validation subset images. In a recent study, Li et al. (2011) investigated several classification algorithms for detecting HLB disease from airborne multispectral and hyperspectral images, and reported that the HLB infected canopy showed higher reflectance in the visible range, and that detection accuracies were ranged from 55 to 95 %, however simpler algorithms such as minimum distance and Mahalanobis distance worked better than other algorithms such as SAM or spectral information divergence. Figure 11.5 shows average reflectance spectra of healthy and HLB infected citrus canopies, and other objects in a citrus grove which were acquired using an airborne hyperspectral imaging system. Fig. 11.5 Spectral signatures of healthy and the HLB infected citrus canopies along with other objects found in a citrus grove. Numbers in a parenthesis indicate the number of samples used for averaging (adapted from Li et al. 2011) Full size image For an application of hyperspectral imaging to apple, Delalieux et al. (2009) detected apple scab disease using hyperspectral images and reported that ratios of reflectance at R440/R690 and R695/R760 yielded good separation between healthy and more developed infection. For early detection, ratio at water band performed well. They reported 570, 1,460, 1,940, and 2,400 nm were important to identify the disease. Sugar beet disease could be detected by hyperspectral imaging. Mahlein et al. (2010) investigated detection of sugar beet diseases by using three different VIs: NDVI, anthocyanin reflectance index (ARI = (1/R550) − (1/R700)), and modified chlorophyll absorption integral \\\\( \\\\left(\\\\mathrm{mCAI}=\\\\left({\\\\mathrm{R}}_{545}+{\\\\mathrm{R}}_{752}\\\\right)/2\\\\times \\\\left(752-545\\\\right)-{\\\\displaystyle {\\\\sum}_{R545}^{R752}\\\\left(R+1.423\\\\right)}\\\\right) \\\\) and found that combination of those VIs were able to assess the different diseases for sugar beet. Also Rumpf et al. (2010) adopted support vector machine (SVM) and VIs to detect diseased sugar beet leaves and achieved early disease detection using SVM with a radial basis function. They reported 97 % detection accuracy between healthy and diseased leaves, and 65–90 % for different types and degrees of infections. Hyperspectral imaging could be applied for disease detection for other crops such as rice, potato, and tomato. For rice disease detection, Liu et al. (2007) utilized stepwise regression, principal component regression (PCR), and PLS to identify severity of rice brown spot disease, and reported root mean square errors of 5.8 %, 13.9 %, and 2.0 % for the three methods, respectively. Liu et al. (2010a) applied neural networks and PCA to detect fungal disease of rice panicles in hyperspectral images in 350–2,500 nm acquired in a laboratory, and reported that four different infection levels were classified with 86–100 % accuracies. Liu et al. (2010b) adopted principal component analysis (PCA) and support vector machine (SVM) to classify healthy and infected rice panicles by rice false smut (U. virens), whose hyperspectral images were acquired in the visible and NIR ranges in a laboratory, and reported over 96 % accuracies using the original spectral data, first derivatives, and second derivatives. For potato disease detection, Ray et al. (2011) investigated detection of potato late blight disease using a hand-held spectroradiometer in 325–1,075 nm, utilized stepwise discriminant analysis and different VIs (NDVI, simple ratio (SR), soil adjusted vegetation index (SAVI), and red edge). They reported that 540, 610, 620, 700, 710, 730, 780, and 1,040 nm were optimal wavebands for the disease detection. For tomato, Zhang et al. (2003) employed aerial hyperspectral imaging (AVIRIS) to detect different infection levels of late blight in tomatoes, and observed more difference in reflectance in the NIR range than the visible range. They utilized the minimum noise fraction (MNF) and SAM for the disease detection and reported that severe infection could be identified, however it was not easy to detect less infected plants. They expected that more hyperspectral imaging would be used to detect plant disease on large-scale farms, if proper and fast image processing algorithms were developed. Also Jones et al. (2010) investigated detection of tomato disease using ultra violet, visible, and near infrared (NIR) reflectance spectroscopy, and employed PLS with B-matrix, correlation coefficient, and SMLR. They reported an RMSE of 4.9 % and an R2 of 0.82 for the best disease prediction model. Hyperspectral imaging could be applied for detection of insect damage. Carroll et al. (2008) studied different VIs to detect European corn borer infestation using airborne hyperspectral imaging. They reported that better detection could be achieved as the disease progressed more, and that chlorophyll related VIs were more closely related to the disease detection than VIs for anthocyanin and carotenoids. Also Singh et al. (2009) investigated detection of insect damaged wheat kernels using statistical image features and histogram features obtained from images taken at 1,101 and 1,305 nm which were selected from a PCA analysis, and reported that discriminant analyses were able to correctly classify 85–100 % infected wheat kernels. 5 Other Applications Hyperspectral imaging has been applied for other plant health monitoring and detection such as heavy metal contamination, weed, fruit quality, acid rain stress, sprouting, fruit defect, immature fruit detection, and fruit maturity status. For heavy metal contamination detection, Schuerger et al. (2003) studied the growth of bahiagrass under the stress of heavy metal (zinc) contamination. They utilized four handheld devices for hyperspectral imaging (two imaging systems), laser-induced fluorescence spectroscopy, and laser-induced fluorescent imaging. They reported that NDVI and ratio vegetation index (RVI = R750/R700, where R is reflectance) were able to predict chlorophyll concentrations in bahiagrass. Also Wilson et al. (2004) applied support vector classification (SVC), partial least squares (PLS) and logistic discrimination (LD) to classify different levels of heavy metal or petroleum exposed plants, and reported that SVC was better in classifying the images than PLS/LD. For weed detection, Williams and Hunt (2004) utilized AVIRIS images to distinguish leafy spurge (Euphorbia esula L.), a noxious perennial weed, using mixture tuned matched filtering (MTMF) method and reported an overall detection accuracy of 95 %. As an example of fruit quality detection, Mehl et al. (2002) studied detection of defects for three apple varieties by applying hyperspectral images to identify multispectral bands and to develop a multispectral imaging system. The multispectral imaging system with 705, 460, and 575 nm was able to detect 76–95 % of contaminated apples. Also Lenk et al. (2007) investigated multispectral fluorescence imaging in the blue, green, read, and far red, and reflectance imaging in the green and NIR regions and discussed applications such as detection of fruit quality, photosynthetic activity, disease symptoms, and leaf tissue structure along with different instrumentations. As an another example of quality detection, Xing et al. (2010) investigated detection of sprouted wheat kernels, identified a reflectance ratio of 878 nm over 728 nm as a feasible index to distinguish sprouted kernels, and also reported that four wavelengths identified from PCA loadings could be used to evaluate quality of wheat kernels. Figure 11.6 shows principal component score images of sound and sprouted wheat kernels. Fig. 11.6 Hyperspectral images of sound and sprouted wheat kernels represented by a principal component score (adapted from Xing et al. 2010) Full size image Hyperspectral imaging was applied for acid rain stress detection. Song et al. (2008) conducted ground-based hyperspectral imaging to detect acid rain stress on native forest by employing continuum removal, VIs, and PCA, and used two new chlorotic indices (RGY = RG/RY and RGO = RG/RO where RG, RY, and RO are reflectance at green, yellow, and orange wavebands) to explain leaf chlorosis from acid deposition stress. Immature fruit detection was conducted using hyperspectral imaging. Okamoto and Lee (2009) utilized a hyperspectral imaging system to detect green immature citrus fruit of three different varieties, and reported 80–89 % correct identification of foreground fruit by employing pixel discriminant function and spatial image processing steps. For fruit maturity detection, Yang et al. (2012) investigated spectral signatures of blueberry fruit and leaves of seven different varieties by measuring their reflectance using a spectrophotometer in 200–2,500 nm, and reported that significant differences were identified among mature fruit, intermediate fruit, immature fruit, light-green leaf and dark-green leaf, enabling monitoring fruit maturity status, as shown in Fig. 11.7. They developed normalized vegetation indices to find significant bands for identifying different maturity status, used classification tree and multinomial logistic regression with principal components, and achieved 95–100 % prediction accuracy of fruit maturity status. Fig. 11.7 Spectral signatures of different growth stages of blueberry fruit and leaves. All spectra are averages of seven southern highbush varieties (adapted from Yang et al. 2012) Full size image In conclusion, hyperspectral imaging provides a wide variety of applications for plant health detection and monitoring in agricultural crop production, and will continue to show great potential in future applications as hyperspectral sensing technology improves and equipment cost decreases. References Allen WA, Gausman HW, Richardson AJ, Thomas JR (1969) Interaction of isotropic light with a compact leaf. J Opt Soc Am 58(8):1023–1028 Article   Google Scholar   Balasundaram D, Burks TF, Bulanon DM, Schubert T, Lee WS (2009) Spectral reflectance characteristics of citrus canker and other peel conditions of grapefruit. Postharvest Biol Technol 51(2):220–226 Article   Google Scholar   Blackburn GA (2007) Hyperspectral remote sensing of plant pigments. J Exp Bot 58(4):855–867 Article   CAS   Google Scholar   Carroll MW, Glaser JA, Hellmich RL, Hunt TE, Sappington TW, Calvin D, Copenhaver K, Fridgen J (2008) Use of spectral vegetation indices derived from airborne hyperspectral imagery for detection of European corn borer infestation in Iowa corn plots. J Econ Entomol 101(5):1614–1623 Article   Google Scholar   Champagne CM, Staenz K, Bannari A, McNairn H, Deguise J-C (2003) Validation of a hyperspectral curve-fitting model for the estimation of plant water content of agricultural canopies. Remote Sens Environ 87:148–160 Article   Google Scholar   Cheng Y-B, Zarco-Tejada PJ, Riaño D, Rueda CA, Ustin SL (2006) Estimating vegetation water content with hyperspectral data for different canopy scenarios: relationships between AVIRIS and MODIS indexes. Remote Sens Environ 105:354–366 Article   Google Scholar   Delalieux S, Somers B, Verstraeten W, van Aardt JAN, Keulemans W, Coppin P (2009) Hyperspectral indices to diagnose leaf biotic stress of apple plants, considering leaf phenology. Int J Remote Sens 30(8):1887–1912 Article   Google Scholar   Goel PK (2003) Hyper-spectral remote sensing for weed and nitrogen stress detection. Ph.D. Dissertation, McGill University, Montreal Google Scholar   Haboudane D, Miller JR, Pattey E, Zarco-Tejada PJ, Strachan I (2004) Hyperspectral vegetation indices and novel algorithms for predicting green LAI of crop canopies: modeling and validation in the context of precision agriculture. Remote Sens Environ 90(3):337–352 Article   Google Scholar   Huang W, Lamb DW, Niu Z, Zhang Y, Liu L, Wang J (2007) Identification of yellow rust in wheat using in-situ spectral reflectance measurements and airborne hyperspectral imaging. Precis Agric 8:187–197 Article   Google Scholar   Jacquemoud S, Baret F (1990) PROSPECT: a model of leaf optical properties spectra. Remote Sens Environ 34:75–91 Article   Google Scholar   Jones CD, Jones JB, Lee WS (2010) Diagnosis of bacterial spot of tomato using spectral signatures. Comput Electron Agric 74(2):329–335 Article   Google Scholar   Kim Y, Glenn DM, Park J, Ngugi HK, Lehman BL (2010) Hyperspectral image analysis for plant stress detection. ASABE Paper No. 1009114. ASABE, St. Joseph Google Scholar   Kumar A, Lee WS, Ehsani R, Albrigo LG (2009) Airborne hyperspectral imaging for citrus greening disease detection. In: Proceedings of the 3rd Asian conference on precision agriculture (ACPA), Beijing Google Scholar   Kumar A, Lee WS, Ehsani R, Albrigo LG, Yang C, Mangan RL (2010) Citrus greening disease detection using airborne multispectral and hyperspectral imaging. In: 10th international conference on precision agriculture, Hyatt Regency Tech Center, Denver, 18–21 July 2010 Google Scholar   Laudien R, Bareth G, Doluschitz R (2003) Analysis of hyperspectral field data for detection of sugar beet diseases. In: EFITA 2003 conference 5–9, Debrecen Google Scholar   Lee WS, Ehsani R, Albrigo LG (2008) Citrus greening disease (Huanglongbing) detection using aerial hyperspectral imaging. In: Proceedings of the 9th international conference on precision agriculture, Denver, 20–23 July Google Scholar   Lee WS, Alchanatis V, Yang C, Hirafuji M, Moshou D, Li C (2010) Sensing technologies for precision specialty crop production. Comput Electron Agric 74(1):2–33 Article   Google Scholar   Lenk S, Chaerle L, Pfündel EE, Langsdorf G, Hagenbeek D, Lichtenthaler HK, van Der Straeten D, Buschmann C (2007) Multispectral fluorescence and reflectance imaging at the leaf level and its possible applications. J Exp Bot 58(4):807–814 Article   CAS   Google Scholar   Li X, Lee WS, Li M, Ehsani R, Mishra A, Yang C, Mangan R (2011) Comparison of different detection methods for citrus greening disease based on airborne multispectral and hyperspectral imagery. ASABE Paper No. 1110570. ASABE, St. Joseph Google Scholar   Liu Z-Y, Huang J-F, Shi J-J, Tao R-X, Zhou W, Zhang L-L (2007) Characterizing and estimating rice brown spot disease severity using stepwise regression, principal component regression and partial least-square regression. J Zhejiang Univ Sci B 8(10):738–744 Article   Google Scholar   Liu Z-Y, Wu H-F, Huang J-F (2010a) Application of neural networks to discriminate fungal infection levels in rice panicles using hyperspectral reflectance and principal components analysis. Comput Electron Agric 72(2):99–106 Article   Google Scholar   Liu Z-Y, Shi J-J, Zhang L-W, Huang J-F (2010b) Discrimination of rice panicles by hyperspectral reflectance data based on principal component analysis and support vector classification. J Zhejiang Univ Sci B 11(1):71–78 Article   Google Scholar   Mahlein A-K, Steiner U, Dehne HW, Oerke EC (2010) Spectral signatures of sugar beet leaves for the detection and differentiation of diseases. Precis Agric 11:413–431 Article   Google Scholar   Mehl PM, Chao K, Kim M, Chen YR (2002) Detection of defects on selected apple cultivars using hyperspectral and multispectral image analysis. Appl Eng Agric 18(2):219–226 Google Scholar   Min M, Lee WS (2005) Determination of significant wavelengths and prediction of nitrogen content for orange. Trans ASAE 48(2):455–461 Article   CAS   Google Scholar   Min M, Lee WS, Burks TF, Jordan JD, Schumann AW, Schueller JK, Xie H (2008) Design of a hyperspectral nitrogen sensing system for citrus. Comput Electron Agric 63(2):215–226 Article   Google Scholar   Mishra A, Ehsani R, Albrigo LG, Lee WS (2007) Spectroscopic study to identify citrus greening from other nutrient deficiencies. ASABE Paper No. 073056. ASABE, St. Joseph Google Scholar   Moshou D, Bravo C, Oberti R, West J, Bodria L, McCartney A, Ramon H (2005) Plant disease detection based on data fusion of hyper-spectral and multi-spectral fluorescence imaging using Kohonen maps. Real Time Imag 11:75–83 Article   Google Scholar   Muhammed HH (2002) Using hyperspectral reflectance data for discrimination between healthy and diseased plants, and determination of damage level in diseased plants. In: Proceedings of the 31st applied imagery pattern recognition workshop, Washington Google Scholar   Okamoto H, Lee WS (2009) Green citrus detection using hyperspectral imaging. Comput Electron Agric 66(2):201–208 Article   Google Scholar   Qin J, Burks TF, Kim MS, Chao K, Ritenour MA (2008) Citrus canker detection using hyperspectral reflectance imaging and PCA-based image classification method. Sens Instrum Food Qual 2:168–177 Article   Google Scholar   Qin J, Burks TF, Ritenour MA, Bonn WG (2009) Detection of citrus canker using hyperspectral reflectance imaging with spectral information divergence. J Food Eng 93:183–191 Article   Google Scholar   Ray SS, Jain N, Arora R, Chavan S, Panigrahy S (2011) Utility of hyperspectral data for potato late blight disease detection. J Indian Soc Remote Sens 39(2):161–169 Article   Google Scholar   Rumpf T, Mahlein A-K, Steiner U, Oerke E-C, Dehne H-W, Plümer L (2010) Early detection and classification of plant diseases with Support Vector Machines based on hyperspectral reflectance. Comput Electron Agric 74(1):91–99 Article   Google Scholar   Sankaran S, Mishra A, Ehsani R, Davis C (2010) A review of advanced techniques for detecting plant diseases. Comput Electron Agric 72(1):1–13 Article   Google Scholar   Schuerger AC, Capelle GA, Di Benedetto JA, Maoc C, Thai CN, Evans MD, Richards JT, Blank TA, Stryjewski EC (2003) Comparison of two hyperspectral imaging and two laser-induced fluorescence instruments for the detection of zinc stress and chlorophyll concentration in bahia grass (Paspalum notatum Flugge.). Remote Sens Environ 84(4):572–588 Article   Google Scholar   Singh CB, Jayas DS, Paliwal J, White NDG (2009) Detection of insect-damaged wheat kernels using near-infrared hyperspectral imaging. J Stored Prod Res 45:151–158 Article   Google Scholar   Song X, Jiang H, Yu S, Zhou G (2008) Detection of acid rain stress effect on plant using hyperspectral data in Three Gorges region, China. Chin Geogr Sci 18(3):249–254 Article   Google Scholar   Ustin SL, Roberts DA, Gamon JA, Asner GP, Green RO (2004) Using imaging spectroscopy to study ecosystem processes and properties. Bioscience 54(6):523–534 Article   Google Scholar   Vigier BJ, Pattey E, Strachan IB (2004) Narrowband vegetation indexes and detection of disease damage in soybeans. IEEE Geosci Remote Sens Lett 1(4):255–259 Article   Google Scholar   Williams AEP, Hunt ER Jr (2004) Accuracy assessment for detection of leafy spurge with hyperspectral imagery. J Range Manage 57(1):106–112 Article   Google Scholar   Wilson MD, Ustin SL, Rocke DM (2004) Classification of contamination in salt marsh plants using hyperspectral reflectance. IEEE Trans Geosci Remote Sens 42(5):1088–1095 Article   Google Scholar   Xing J, Symons S, Shahin M, Hatcher D (2010) Detection of sprout damage in Canada Western Red Spring wheat with multiple wavebands using visible/near-infrared hyperspectral imaging. Biosyst Eng 106:188–194 Article   Google Scholar   Yang C, Lee WS, Williamson JG (2012) Classification of blueberry fruit and leaves based on spectral signatures. Biosyst Eng 113(4):351–362 Article   Google Scholar   Zarco-Tejada PJ, Miller JR, Mohammed GH, Noland TL, Sampson PH (2002) Vegetation stress detection through chlorophyll a+b estimation and fluorescence effects on hyperspectral imagery. J Environ Qual 31:1433–1441 Article   CAS   Google Scholar   Zarco-Tejada PJ, Pushnik JC, Dobrowski S, Ustin SL (2003) Steady-state chlorophyll a fluorescence detection from canopy derivative reflectance and double-peak red edge effects. Remote Sens Environ 84:283–294 Article   Google Scholar   Zhang M, Qin Z, Liu X, Ustin SL (2003) Detection of stress in tomatoes induced by late blight disease in California, USA, using hyperspectral remote sensing. Int J Appl Earth Obs Geoinf 4(4):295–310 Article   Google Scholar   Download references Author information Authors and Affiliations Agricultural and Biological Engineering, University of Florida, Gainesville, FL, USA Won Suk Lee Corresponding author Correspondence to Won Suk Lee . Editor information Editors and Affiliations Agricultural Research Service, U.S. Department of Agriculture, Athens, Georgia, USA Bosoon Park Agricultural Research Service, U.S. Department of Agriculture, East Lansing, Michigan, USA Renfu Lu Rights and permissions Reprints and permissions Copyright information © 2015 Springer Science+Business Media New York About this chapter Cite this chapter Lee, W.S. (2015). Plant Health Detection and Monitoring. In: Park, B., Lu, R. (eds) Hyperspectral Imaging Technology in Food and Agriculture. Food Engineering Series. Springer, New York, NY. https://doi.org/10.1007/978-1-4939-2836-1_11 Download citation .RIS.ENW.BIB DOI https://doi.org/10.1007/978-1-4939-2836-1_11 Publisher Name Springer, New York, NY Print ISBN 978-1-4939-2835-4 Online ISBN 978-1-4939-2836-1 eBook Packages Chemistry and Materials Science Chemistry and Material Science (R0) Share this chapter Anyone you share the following link with will be able to read this content: Get shareable link Provided by the Springer Nature SharedIt content-sharing initiative Publish with us Policies and ethics Download book PDF Download book EPUB Sections Figures References Abstract Introduction Water Status Monitoring Nutrient Status Monitoring Detection of Plant Disease and Insect Damage Other Applications References Author information Editor information Rights and permissions Copyright information About this chapter Publish with us Discover content Journals A-Z Books A-Z Publish with us Publish your research Open access publishing Products and services Our products Librarians Societies Partners and advertisers Our imprints Springer Nature Portfolio BMC Palgrave Macmillan Apress Your privacy choices/Manage cookies Your US state privacy rights Accessibility statement Terms and conditions Privacy policy Help and support 129.93.161.219 Big Ten Academic Alliance (BTAA) (3000133814) - University of Nebraska-Lincoln (3000134173) © 2024 Springer Nature\"",
        "analysis": "",
        "verbatim_quote1": "",
        "verbatim_quote2": "",
        "verbatim_quote3": "",
        "relevance_score1": 0,
        "relevance_score2": 0,
        "limitations": "",
        "inline_citation": "",
        "full_citation": ""
    }
]