"[\n  {\n    \"DOI\": \"https://doi.org/10.1007/s00271-009-0184-x\",\n    \"authors\": [\n      \"Samuel Ortega-Far\\u00edas\",\n      \"Suat Irmak\",\n      \"Richard H. Cuenca\"\n    ],\n    \"citation_count\": 45,\n    \"full_citation\": \"\",\n    \"full_text\": \"\\\"Your privacy, your choice We use essential cookies to make sure the site can function. We also use optional cookies for advertising, personalisation of content, usage analysis, and social media. By accepting optional cookies, you consent to the processing of your personal data - including transfers to third parties. Some third parties are outside of the European Economic Area, with varying standards of data protection. See our privacy policy for more information on the use of your personal data. Manage preferences for further information and to change your choices. Accept all cookies Skip to main content Log in Find a journal Publish with us Track your research Search Cart Home Irrigation Science Article Special issue on evapotranspiration measurement and modeling Editorial Published: 29 August 2009 Volume 28, pages 1\\u20133, (2009) Cite this article Download PDF Irrigation Science Aims and scope Submit manuscript Samuel Ortega-Farias, S. Irmak & R. H. Cuenca  2961 Accesses 36 Citations Explore all metrics Water availability for irrigation throughout the world has been reduced in recent years due to a combination of frequent droughts and competition for water resources among agricultural, industrial, and urban users. In addition, some major agricultural areas face moderate to significant reductions of rainfall, or changes in timing of stream flow due to changes in timing of snowmelt, as a result of global climate change. Under such conditions, sophisticated irrigation water management will be required to optimize water use efficiency and maintain sufficient levels of crop productivity and quality. A key factor to achieve these targets is the estimation of actual evapotranspiration (ET). Accurate determination of ET can be a viable tool in better utilization of water resources through well-designed irrigation management programs. Reliable estimates of ET are also vital to develop criteria for in-season irrigation management, water resource allocation, long-term estimates of water supply, demand and use, design and management of water resources infrastructure, and evaluation of the effect of land use and management changes on the water balance. ET is commonly calculated using grass or alfalfa-reference evapotranspiration (ETo) multiplied by grass or alfalfa-reference-based crop-specific coefficients (Kc). The Penman\\u2013Monteith combination equation is widely accepted as the best-performing method for reference evapotranspiration estimates from a well-watered hypothetical grass or alfalfa surface having a fixed crop height, albedo, and surface canopy resistance. The Kc is basically the ratio of ET to ETo where ET can be measured using a lysimeter, soil water balance approach, eddy covariance method, Bowen ratio energy balance system, or surface renewal method. Advances over the last two to three decades in instrumentation, data acquisition systems, remote data access, and the off-the-shelf availability of aforementioned ET measurement tools have significantly enhanced our understanding of ET and its relation to microclimatic conditions. Advances also enabled the availability and affordability of data for practitioners for use in irrigation management. While the reference ET and Kc approach provides a simple and convenient way to estimate crop water requirements for a variety of crops and climatic conditions, a major uncertainty in this approach is that many Kc values reported in the literature are empirical and often not adapted to local conditions. This is due to the fact that ratios of ET to ETo depend on nonlinear interactions of soil, crop and atmospheric conditions, and irrigation management practices. This consideration is especially important for row crops, orchards, and vineyards which present sparse canopies and high spatial variability of soil and vegetation coverage. Locally calibrated Kc values are required because water consumption in sparse canopies is controlled by the energy absorbed by plants or trees and the soil surface. The energy absorbed by the vegetation and/or soil surface depends on plant growth, canopy size, leaf area index, soil characteristics, and fraction of soil surface covered by vegetation (fractional cover). In addition, canopy cover of orchards and vineyards is generally non-uniform as a result of the canopy geometry generated by training systems. Under these conditions, Kc values should be adjusted using the fractional cover and height of the vegetation to improve the estimation of ET. Alternatively, two- or three-source models based on the Penman\\u2013Monteith approach can be used to directly compute ET. These models take into account plant transpiration and soil evaporation from under the canopy or between plant rows. In these models, ET is calculated as the sum of the Penman\\u2013Monteith equation for evaporation and transpiration, weighted by the fractional cover and/or a set of coefficients that represent the combination of soil and canopy resistances. Finally, satellite-based energy balance models have been used to assess the spatial and temporal variability of Kc and ET. Remote sensing data can be from various ground, aerial, and satellite platforms and are now increasingly used to derive ET data from surface temperature, reflectance, and vegetation indices. Advances in this new ET estimation technology will likely provide improved capability for routinely mapping ET, especially at the watershed or regional scale. It can also be a viable tool for assessing the spatial distribution of ET for more detailed management and planning of water resources. This special issue on evapotranspiration measurement and modeling contains eight papers describing modeling techniques to estimate Kc and actual evapotranspiration. These papers were originally solicited to the Evapotranspiration in Irrigation and Hydrology Committee (American Society of Civil Engineers). Each paper has received substantial peer review and editing prior to its publication in this issue. First, the paper by Jia, Dukes, and Jacobs (Bahiagrass Crop Coefficients from Eddy Correlation Measurements in Central Florida) describes the bahiagrass crop coefficient determined using the eddy correlation method over a three and half year period under generally well-watered and humid conditions. Numerous corrections were made to the raw eddy correlation data and a Bowen ratio adjustment was applied. These findings indicate the importance of monthly crop coefficients in an environment such as Florida and the difference in warm season turfgrass crop coefficients depending on the study site and experimental methods. The paper by Allen and Pereira (Estimating Crop Coefficients from Fraction of Ground Cover and Height) describes a relatively simple approach for estimating the Kc value based on a physical description of the vegetation. The procedure is intended for estimating both basal and average Kc for natural vegetation, orchards and landscape systems for different portions of the growing season based on amount of vegetation present and background evaporation from soil. The generalized method does not replace measurement of Kc for developing crop coefficient curves. However, it does provide a consistent means to assess measured values for reasonableness as well as providing a means to estimate change in values for Kc with change in the fraction of ground covered by vegetation. This is important when estimating Kc for orchard crops which can vary widely in plant spacing (i.e., stand density, tree pruning, groundcover and age). Adjustments to Kc for climates different from a standard climate are indicated. Adjustments for crop stomatal control are described and adjustments for percent groundcover are used to present tabulated Kc values which go beyond those presented in the FAO irrigation and drainage paper No. 56 (FAO-56). The paper of Ch\\u00e1vez, Howell, and Copeland (Evaluating Eddy Covariance Cotton ET Measurements in an Advective Environment with Large Weighing lysimeters) evaluates the accuracy of eddy covariance (EC) systems in measuring ET over irrigated cotton fields in the advective environment of the US Southern High Plains. The procedures to adjust EC-based ET for lack of closure of the energy balance outlined in this study seemed to have adequately reproduced irrigated cotton ET measured with precision large weighing lysimeters in this advective/semi-arid climate. In addition, it was shown that estimating ET as a residual of the energy balance, assuming that the sensible heat flux was correctly measured by the eddy covariance system, is not an adequate procedure and instead the Bowen ratio method should be adopted to force energy balance closure on eddy covariance measured sensible and latent heat fluxes. The paper by Lagos, Martin, Verma, Syker, and Irmak (Surface Energy Balance Model of Transpiration from Variable Canopy Cover and Evaporation from Residue-Covered or Bare-Soil Systems) describes a multiple-layer surface energy balance model that accounts for the effects of canopy and crop residue on ET. The paper describes the development of the model and the procedures used to compute parameters for use in the energy balance. The model provides a method for partitioning ET into soil and crop residue evaporation and plant transpiration, and a tool to estimate the effect of crop residue on ET and consequently on water balance computations. Comparison between estimated ET and eddy covariance flux measurements from an irrigated maize field provides support for the validity of the surface energy balance model. Poblete-Echeverr\\u00eda and Ortega-Farias (Estimation of Actual Evapotranspiration for a Drip-Irrigated Merlot Vineyard Using a Three-source Model) evaluate the Clumped model to estimate ET and LE over a drip-irrigated Merlot vineyard trained on a vertical shoot positioned (VSP) system under semi-arid conditions. The results suggest that the Clumped model could be used to directly estimate the evapotranspiration for a drip-irrigated vineyard under dry atmospheric conditions. In this case, the application of the Clumped model for irrigation scheduling requires a good characterization of canopy architecture and an accurate estimation of the fractional vegetated cover which takes into account the differences between soil evaporation, divided into two components of soil evaporation (under vine canopy and bare soil between rows) and vine canopy transpiration. The paper by Ch\\u00e1vez, Gowda, Howell, Neale, and Copeland (Estimating Hourly Crop ET Using a Two-Source Energy Balance Model and Multispectral Airborne Imagery) evaluates the performance of a two-source energy balance model (TSM), where the energy exchanges of the soil/substrate and vegetation are evaluated separately, in deriving instantaneous estimates of actual evapotranspiration (ETi) using high-resolution airborne remote sensing imagery under advective conditions of the Southern High Plains. Data from four precise weighing lysimeters were applied to obtain ground-truth. Results indicated that crop height, roughness length for momentum transfer, clumping factor, and soil resistance sub-models need to be refined. Nevertheless, the application of the TSM using high-resolution remote sensing imagery in the Southern High Plains is shown to be promising. Samani, Bawazir, Bleiweiss, Skaggs, Longworth, Tran, and Pinon (Using Remote Sensing to Evaluate the Spatial Variability of Evapotranspiration and Crop Coefficient in the Lower Rio Grande Valley, New Mexico) study the spatial and temporal variability of Kc and evapotranspiration for pecan orchards using remote sensing information from Landsat-5 and Landsat-7, combined with ground-level measurements, on a field scale in the Lower Rio Grande Valley (LRGV) in New Mexico. The Regional ET Estimation Model (REEM) applied in this study shares the surface energy balance approach of the Surface Energy Balance Algorithm for Land (SEBAL) and Mapping Evapotranspiration at High Resolution (METRIC\\u2122) models. The findings in this paper reveal that LRGV consumptive use for pecan varies widely over the region. Finally, Irmak and Kamble (Evapotranspiration Data Assimilation with Genetic Algorithms and SWAP Model for On-Demand Irrigation) develop a conceptual methodology for estimating parameters of an agro-hydrological model via data assimilation and remotely sensed ET. The model output is used to control on-demand irrigation (ODI) management. The surface energy balance method employing the SEBAL algorithm is applied to remote sensing data from the Moderate Resolution Imaging Spectroradiometer (MODIS) satellite data to quantify ET. The model output is coupled with a soil\\u2013water\\u2013atmosphere\\u2013plant (SWAP) simulation model in a data assimilation scheme to estimate the soil water state for ODI management. Although the analyses were limited to the conditions imposed on the water management optimization model, useful findings were developed to make the best possible use of the ODI supply in an irrigation system. Author information Author notes R. H. Cuenca Present address: Hydrologic Sciences, Division of Earth Sciences, National Science Foundation, 4201 Wilson Blvd., Arlington, VA, 22230, USA Authors and Affiliations Facultad de Ciencias Agrarias, Centro de Investigaci\\u00f3n y Transferencia en Riego y Agroclimatolog\\u00eda (CITRA), Universidad de Talca, Avenida Lircay S/N, Talca, Chile Samuel Ortega-Farias Department of Biological Systems Engineering, University of Nebraska-Lincoln, 241 L.W. Chase Hall, Lincoln, NE, 68583-0726, USA S. Irmak Department of Biological and Ecological Engineering, Oregon State University, 116 Gilmore Hall, Corvallis, OR, 97331-3906, USA R. H. Cuenca Corresponding author Correspondence to Samuel Ortega-Farias. Additional information Communicated by R. Evans. Rights and permissions Reprints and permissions About this article Cite this article Ortega-Farias, S., Irmak, S. & Cuenca, R.H. Special issue on evapotranspiration measurement and modeling. Irrig Sci 28, 1\\u20133 (2009). https://doi.org/10.1007/s00271-009-0184-x Download citation Received 10 August 2009 Accepted 10 August 2009 Published 29 August 2009 Issue Date November 2009 DOI https://doi.org/10.1007/s00271-009-0184-x Share this article Anyone you share the following link with will be able to read this content: Get shareable link Provided by the Springer Nature SharedIt content-sharing initiative Use our pre-submission checklist Avoid common mistakes on your manuscript. Sections Author information Additional information Rights and permissions About this article Advertisement Discover content Journals A-Z Books A-Z Publish with us Publish your research Open access publishing Products and services Our products Librarians Societies Partners and advertisers Our imprints Springer Nature Portfolio BMC Palgrave Macmillan Apress Your privacy choices/Manage cookies Your US state privacy rights Accessibility statement Terms and conditions Privacy policy Help and support 129.93.161.219 Big Ten Academic Alliance (BTAA) (3000133814) - University of Nebraska-Lincoln (3000134173) \\u00a9 2024 Springer Nature\\\"\",\n    \"analysis\": \"\",\n    \"verbatim_quote1\": \"\",\n    \"verbatim_quote2\": \"\",\n    \"verbatim_quote3\": \"\",\n    \"relevance_score1\": 0,\n    \"relevance_score2\": 0,\n    \"limitations\": \"\",\n    \"inline_citation\": \"\",\n    \"journal\": \"Irrigation Science\",\n    \"pdf_link\": \"https://link.springer.com/content/pdf/10.1007/s00271-009-0184-x.pdf\",\n    \"publication_year\": 2009,\n    \"title\": \"Special issue on evapotranspiration measurement and modeling\"\n  }\n]"