[
    {
        "title": "Prediction of soil salinity with soil-reflected spectra: A comparison of two regression methods",
        "doi": "10.1038/s41598-019-41470-0",
        "description": "To achieve the best high spectral quantitative inversion of salt-affected soils, typical saline-sodic soil was selected from northeast China, and the soil spectra were measured; then, partial least-squares regression (PLSR) models and principle component regression(PCR) models were established for soil spectral reflectance and soil salinity, respectively. Modelling accuracies were compared between two models and conducted with different spectrum processing methods and different sampling intervals. Models based on all of the original spectral bands showed that the PLSR was superior to the PCR; however, after smoothing the spectra data, the PLSR did not continue outperforming the PCR. Models established by various transformed spectra after smoothing did not continue showing superiority of the PCR over the PLSR; therefore, we can conclude that the prediction accuracies of the models were not only determined by the smoothing methods, but also by spectral mathematical transformations. The best model was the PCR based on the median filtering data smoothing technique (MF) + log (1/X) + baseline correction transformation (R 2 = 0.7206 and RMSE = 0.3929). To keep the information loss becoming too large, this suggested that an 8 nm sampling interval was the best when using soil spectra to predict soil salinity for both the PLSR and PCR models.",
        "journal": "Scientific Reports",
        "authors": [
            "Zhang X.",
            "Huang B."
        ],
        "citation_count": "30",
        "full_text": "\"Your privacy, your choice We use essential cookies to make sure the site can function. We also use optional cookies for advertising, personalisation of content, usage analysis, and social media. By accepting optional cookies, you consent to the processing of your personal data - including transfers to third parties. Some third parties are outside of the European Economic Area, with varying standards of data protection. See our privacy policy for more information on the use of your personal data. Manage preferences for further information and to change your choices. Accept all cookies Skip to main content Advertisement View all journals Search Log in Explore content About the journal Publish with us Sign up for alerts RSS feed nature scientific reports articles article Article Open access Published: 25 March 2019 Prediction of soil salinity with soil-reflected spectra: A comparison of two regression methods Xiaoguang Zhang & Biao Huang  Scientific Reports  9, Article number: 5067 (2019) Cite this article 2925 Accesses 25 Citations 1 Altmetric Metrics Abstract To achieve the best high spectral quantitative inversion of salt-affected soils, typical saline-sodic soil was selected from northeast China, and the soil spectra were measured; then, partial least-squares regression (PLSR) models and principle component regression(PCR) models were established for soil spectral reflectance and soil salinity, respectively. Modelling accuracies were compared between two models and conducted with different spectrum processing methods and different sampling intervals. Models based on all of the original spectral bands showed that the PLSR was superior to the PCR; however, after smoothing the spectra data, the PLSR did not continue outperforming the PCR. Models established by various transformed spectra after smoothing did not continue showing superiority of the PCR over the PLSR; therefore, we can conclude that the prediction accuracies of the models were not only determined by the smoothing methods, but also by spectral mathematical transformations. The best model was the PCR based on the median filtering data smoothing technique (MF) + log (1/X) + baseline correction transformation (R2 = 0.7206 and RMSE = 0.3929). To keep the information loss becoming too large, this suggested that an 8 nm sampling interval was the best when using soil spectra to predict soil salinity for both the PLSR and PCR models. Similar content being viewed by others Study on hyperspectral estimation model of soil organic carbon content in the wheat field under different water treatments Article Open access 20 September 2021 Prediction and variability mapping of some physicochemical characteristics of calcareous topsoil in an arid region using Vis–SWNIR and NIR spectroscopy Article Open access 19 May 2022 Estimating growth and photosynthetic properties of wheat grown in simulated saline field conditions using hyperspectral reflectance sensing and multivariate analysis Article Open access 11 November 2019 Introduction Soil salinization is one of the most important obstacle factors that has caused adverse effects on soil production, such as a decrease in cultivated soil fertility and crop failures, which restrict the global development of agriculture1,2,3,4,5,6. At the same time, soil salinization greatly influences the ecological environment, which is closely related to human lives and seriously influences the development of the social economy7,8,9,10,11. Traditional field sampling analysis technology is time-consuming and laborious and different sampling methods have a large number of uncertainties and errors when expressing the soil salinization level in a study area12,13,14. Technology regarding hyperspectral analysis is time-saving, can perform rapid analysis, saves energy, has a low cost, is not destructive, and can simultaneously estimate the multiple components in soil given new technology and methods for soil information research12,14,15,16,17. The soil spectrum is a comprehensive reflection of various soil physical and chemical properties. In recent years, soil spectral characteristics have used to estimate soil organic matter18,19,20, total nitrogen21, heavy metals22,23, and soil moisture content24,25 and have obtained certain achievements and built abundant models. The use of hyperspectral data to estimate soil salinization information has gradually developed for different salt components26,27,28,29,30. Regarding the use of a high-spectral quantitative model to predict soil properties, due to multiple spectral variables, the correlation between variables needs to be eliminated when building models. Most authors have established partial least-squares regression (PLSR) models31 and obtained good precision28,29,32,33,34. Several authors have obtained better principle component analysis (PCR) models35,36, which perform better than the PLSR. Some authors asserted that the PLSR method performs better than the PCR method. Others asserted the opposite opinion. Sometimes these models are not directed at the same property (e.g., soil salinity). For salinity, it is hypothesized that the precision of a model is associated with the processing methods, such as smoothing and various mathematical transformations. Therefore, it is not rigorous and arbitrary to determine which modelling method is better to predict soil salinity under non-unified modelling conditions. In addition, we often develop transformations to soil spectral data when building models, such as smoothing, multiplicative scatter correction (MSC), and vector normalization (SNC). A number of different spectral transformations have been carried out when predicting soil organic matter, total nitrogen and soil heavy metals with high spectra31. However, the chemical properties of soil decide whether the selected data transformations are different. For soil salinity research, due to geographical differences among regions, the same data processing methods have different model precisions as those for different soil salt components37,38. Our early studies have indicated that when the PLSR model is used to predict soil salinization, the best data transformation was smoothing + MSC37. However, it is still necessary to prove whether the PCR model has the same regulations when using the same transformations. The same type of saline soil should be selected to ensure uniform condition of modelling, so that the models could be compared. China has vast areas of saline-sodic soil distributed mainly in the arid and semi-arid areas of northern China39. It not only restricts the regional development of agriculture and the economy, but it also has adverse effects on regional food and ecological security. Therefore, monitoring soil salinization is a very important task40. The soil type in the study area is classified as Aquic Alkalic Halosol based on Chinese Soil Taxonomy41. The above studies of soil salinity inversion models were less focused on saline-sodic soil37. Because soil compositions are very complicated, the inversion methods established from the areas with different soil salinization types had certain limitations. Even if an adequate and complex model has already been established in the same type of soil regions42, it cannot guarantee the applicability in a wider region. Establishing the best quantitative model in this region has important significance. Therefore, the saline-sodic soil was selected as the study subject. Based on the above literatures and analysis, we find that the main existed problems were: (1) there was no definite conclusion on which model is more suitable for predicting soil salinity in soil with same salt components, and lacking of systematic analysis because of the different conditions of modelling in previous studies. (2) It is need to verify whether different spectral processing methods affect the accuracy of the two models under the uniform external conditions. Thus, this study aimed to (1) build PCR and PLSR models between the soil reflection spectrum and the soil salinity content and compare the pros and cons of the two methods when predicting soil salinity in saline-sodic soil and (2) analyse the influence of different spectral transformation methods on the accuracy of the two models and determine the best spectral transformation methods. This conclusion can be used as a reference for the establishment of the spectral model and the selection of the spectral transformation method in investigation of soil salinity, and the best model can also be used in the prediction of soil salinity in saline-sodic soil. Results The accuracy of the soil electrical conductivity prediction models based on the original spectra We established the PLSR and PCR models based on the original spectral bands and soil electrical conductivity (EC) values; the prediction accuracy of the established models can be seen in Table 1. The calibration accuracies of the PLSR model and the PCR model were R2 = 0.8623 and R2 = 0.5373, respectively. The calibration accuracy of the PLSR method was significantly higher than that of the PCR method, and the independent prediction accuracy of the PLSR method (R2 = 0.5346 and RMSE = 0.5071) was superior to that of the PCR method (R2 = 0.4534 and RMSE = 0.5496). However, it was too soon that conclude that the prediction of EC with the PLSR method was significantly higher than that with the PCR method. The soil spectra data required further processing and mathematical transformation; models established based on the processed spectra data may strengthen the results. Therefore, we were able to perform spectral transformations when building models to verify which model was superior. Table 1 Accuracies of the PLSR and PCR models for EC based on the original spectra. Full size table The accuracy of models based on different spectral smoothing methods When establishing a soil property inversion model, one of the most commonly used methods for hyperspectral data processing is spectrum smoothing. There are four main methods for spectral smoothing: Moving-Average data smoothing technique (MA), Savitzky-Golay data smoothing technique (SG), Median filtering data smoothing technique (MF), and Gaussian filtering data smoothing technique (GF)43. This paper chose four smoothing methods to smooth soil spectra and aimed to determine which smoothing method was better, as well as verify whether the PLSR model continued to outperform the PCR model based on the smoothed spectra. Based on the smoothed spectra data, the PLSR and PCR models for soil EC were established, and the model accuracies are shown in Table 2. Table 2 Prediction accuracies of the PLSR and PCR models for EC based on different spectral smoothing methods. Full size table Table 2 shows that smoothing improved the accuracy of the models after implementing different spectral smoothing methods. Although the calibration of the models had a good prediction (R2 > 0.7600), the independent prediction of models showed different results. In addition to the PLSR model, which was established based on spectra that were smoothed with the MA method, the other PLSR models that were established based on the remaining spectral smoothing methods all achieved good results; of these results, the PLSR model based on the median filter smoothing was the best (R2 = 0.6414 and RMSE = 0.4452). As for the PCR models, four smoothing methods significantly improved the precision of the prediction. Among them, the best smoothing method was the median filtering method (R2 = 0.6799 and RMSE = 0.4206). However, compared with the models based on the original spectra, the PLSR models did not continue outperforming the PCR models. This indicated that the accuracy of prediction model regarding soil electrical conductivity was also affected by some factors besides the model itself. Looking at the model accuracy based on four types of spectral smoothing, the prediction accuracy of the PLSR with the second smoothing method approached the prediction accuracy of the PCR. For the MA, MF and GF smoothing methods, the prediction accuracies of the PCR were obviously better than those of the PLSR model. The changes of prediction accuracies between PLSR and PCR models mainly occurred after the smoothing. Soil spectra were only processed by the smoothing method. Therefore, from the above results, we concluded that the smoothing method affected the predictive precision of the PLSR and PCR models. Model accuracies based on different spectral mathematical transformations From the four types of smoothing methods mentioned above, both the MA and SG smoothing methods represent a linear smoothing spectrum method, while both the MF and GF methods represent a nonlinear smoothing spectrum method. To verify the above deduction, we chose the MA and MF smoothed spectrum methods (both have prediction accuracies of PCR > PLSR) and performed various mathematical transformations. If the deduction was correct, the prediction accuracy of the models, which were established on various transformation spectrums after smoothing, continued showing the accuracies better for the PCR than for the PLSR. Regarding the MA smoothing method, the prediction accuracy of models, which were established for various transformation spectra after MA smoothing, did not continue to show PCR superiority over the PLSR (Table 3). Table 3 Prediction accuracy of the PLSR and PCR models for EC based on moving-average data smoothing technique (MA) spectral smoothing. Full size table As for the MF smoothing method, the prediction accuracy of models, which were established for various transformation spectra after MA smoothing, also did not show PCR superiority to the PLSR (Table 4). Therefore, we can conclude that the prediction accuracy of the models was not only determined by the smoothing methods, but also by the spectra mathematical transformations. Table 4 Prediction accuracy of PLSR and PCR modes for EC based on MF spectral smoothing. Full size table According to the results from the spectral mathematical transformations, three types of methods, including the MF + log(1/X) transformation, the MF + log(1/X) + baseline correction transformation, and the MF + area normalization transformation, had adequate prediction accuracies for the PCR and PLSR models, where the PCR model based on the MF + log(1/X) + baseline correction transformation had the highest prediction accuracy (R2 = 0.7206 and RMSE = 0.3929). The accuracy of the PCR models based on different resampled hyperspectral data The resampling of hyperspectral soil was conducted at intervals of 2, 4, 8, 10, 16, 32, and 64 nm based on the smoothing + log (1/X) processing method in order to find the optimal sampling interval for modelling the prediction of soil salt. The relevant content regarding the effects of different resampling intervals in the PLSR model (based on MF smoothing) has been discussed in our previous studies37; here, this paper mainly studies the effect of different resampling intervals on the PCR (based on MF smoothing). As Table 5 shows, all the prediction accuracies of the PCR calibration models were high, with R2 ranging from 0.75 to 0.83; these values were higher than those of the corresponding validation models and prediction models, and the RMSEs for all the calibration models were lower than those of the corresponding validation models and prediction models. With an increasing in sampling interval, the precision of the calibration model also gradually increased, with an R2 ranging from 0.7518 to 0.8298, and the RMSE decreased to 0.3938 from 0.4602. With an increase in sampling interval, the precision of the cross-validation set slowly increased. There was a significant turning point at the 32 nm interval. When comparing the calibrated PCR models and the cross-validation PCR models, the precision of the independent validation set showed different changes. With an increase in sampling interval from 2 nm to 8 nm, the change in R2 was minimal; as the sampling interval gradually increased, the RMSE gradually declined. Table 5 Results of calibration, validation and prediction with different resampling intervals by the PCR analysis. Full size table Discussion From the view of the established models based on optimal smoothing (MF), most PCR models were superior to the PLSR models (Table 4). Different smoothing methods had different principles, which affected the extraction of the principal components. The MF smoothing method used a filtering principle, which obviously improved the accuracy of the PCR model. The MA smoothing method used a linear principle, which did not obviously improve the accuracy of the PCR model. Different mathematical transformation methods based on different smoothing methods had different prediction accuracies, which indicated that mathematical transformations had different effects than those from smoothing methods36,43. It can be seen from the above results that the treatment of spectral data was necessary and significantly improved the precision of the model28. However, the results did not show that increasing the transformation applications resulted higher the prediction accuracy of the models. For example, for the PLSR, MA + log(1/X) (R2 = 0.6088 and RMSE = 0.4650) > MA + log(1/X) + baseline correction (R2 = 0.5863 and RMSE = 0.4782) > MA (R2 = 0.3069 and RMSE = 0.6189). This result corresponds to the previous reserches37. Therefore, we should choose the appropriate mathematical method when modelling. From the perspective of mathematical processing convenience and practicability of the model, we recommend the MF + log(1/X) and MF + area normalization transformations to soil spectra when building PCR and PLSR models. Because the hyperspectral data interval was small, the hyperspectral data provided rich information regarding redundancy and noise. In addition, the small data interval also caused inconvenience in the calculation due to the huge amounts of hyperspectral data in other spectral applications. Resampling of the spectrum can reduce noise and the number of independent variables, which can improve the efficiency of modelling and prediction accuracy23. Kemper and Sommer44 thought that a large sampling interval (20 nm or 10 nm) reduced the influence of noise and produced adequate prediction results; their study was similar to our study. However, when the sampling interval was 32 nm, the prediction accuracy of the PCR obviously changed; the PCR models were barely able to predict soil salt. Therefore, if the focus is on reducing noise, a spectrum interval that is too large will cause a loss in spectrum information and a decline in prediction accuracy when using the spectrum. As for the PLSR models analysed in this study37, the performance was similar to that of the PCR models. However, if the prediction accuracy of the PLSR reached a certain level (i.e., R2 exceeded 0.6), then the sampling interval could not exceed 8 nm. Otherwise, the prediction accuracy would decrease. To avoid the large loss of information, it was suggested that a sampling interval of 8 nm was the best when using soil spectra to predict soil salinity both with PLSR and PCR models. Conclusions In this paper, we established PLSR and PCR models based on original spectral bands and soil conductivity; it is feasible to predict salinity in saline-sodic soil using soil spectra. Smoothing improved the accuracy of the models, and the best smoothing method was median filtering for both the PLSR and PCR. According to the results of the spectral mathematical transformations, the best model was the PCR model based on the MF + log(1/X) + baseline correction transformation, which had the highest prediction accuracy. The prediction accuracies of the models were not just determined by smoothing methods, but also by spectral mathematical transformations. To avoid a large loss of information, it was suggested that a sampling interval of 8 nm was best when using soil spectra to predict soil salinity with both PLSR and PCR models. This paper built adequate prediction models and determined the effect of spectral transformations on models; however, it should be noted that the best model we established was suitable for saline-sodic soil. This model whether or not is suitable for other types of soil salt needs to be verified. Methods Study area Our study area is located west of the Jilin Province in northeast China (44°13′57″–46°18′N,121°38′–124°22′50″E). The area has a very typical and large area of saline-sodic soil. The soil type in the study area is classified as Aquic Alkalic Halosol based on Chinese Soil Taxonomy41. The study area belongs to the temperate continental monsoon climate, and the average annual precipitation is only 400–450 mm, while annual evaporation reaches 1200 mm. The small amount of precipitation and large amount of evaporation leads to climate droughts. In addition to the special climate, hydrogeological conditions and human activities have contributed to soil salinization in the area39. Field Sampling and Laboratory Measurements Soil samples were collected from the typical saline-sodic soil of the Songnen Plain, which consists of 6 counties that encompass 29302 km2 in northeast China (Fig. 1). A soil sample experienced 5–7 subsamples at each sampling point, then the soils were mixed and transfered (1–2 kg) into plastic bags, labelled, then taken back to the lab for analysis. A total of 126 soil samples were collected from the surface to a depth of 20 cm and sieved through a 2-mm mesh, and a 0.147 mm mesh. The soil samples equally represent all soil types and land uses. Soil sieved through a 2-mm mesh was used to measure the soil electrical conductivity, and soil sieved through a 0.147-mm mesh was used to measure the soil spectrum for excluding the effect of particle size on soil spectra45,46. The soil electrical conductivity was measured at 1:5 of soil: water using conductometry47. Figure 1 Sampling plots in the classic district of northeast China. The small black dots represent the location of the sampling points. The rectangular frames represent the scope of the study area. Full size image Soil spectral measurement and processing Soil samples sieved through a 0.147-mm mesh were ground until fine particles(<0.038 mm) were obtained and then were tabulated. After the tabulated soil dried at a low temperature, the soil spectrum was measured using the Lamdar900 spectrum test45,46. A total of 1051 bands were measured, with wavelengths ranging from 400 to 2500 nm and a spectrum sampling interval of 2 nm (see Supplementary spreadsheet S1). There were four main methods of spectral smoothing: MA, SG, MF, GF43. To study the effects of spectral smoothing on the accuracy of a hyperspectral soil model, our original spectral data were smoothed by the four types of smoothing methods, subsequently. To study the influence of other mathematical transformations on the precision of the hyperspectral soil model, a variety of mathematical transformations, including the SNV, MSC, baseline correction, area normalization, the maximum normalization (MAX), range normalization, first derivative (FD), and logarithm transformation, were conducted based on the smoothed spectrum43,48. Finally, the soil spectra were resampled to compare the influences of different sampling intervals on the prediction accuracy of the spectral model. Modelling and verification methods Because the number of hyperspectral variables was greater than the number of soil samples, the ordinary least-squares model cannot be used. For this situation, the commonly used methods for modelling soil hyperspectral data are the PCR and PLSR methods. These two types of modelling methods extract the principal components from spectral variables and exhibit adequate spectral prediction49,50,51. Both the PLSR and the PCR methods extract the maximum information reflecting the variation of the data. The principal components extracted by PCR were orthogonal, while the principal components extracted by PLSR were based on three analytical methods: principal component analysis, canonical correlation analysis and multivariate linear regression analysis. This paper used these two types of common methods for modelling49,50,51. The calibration and validation set would have a significant impact on the results. In this study, the distribution of soil salt content of soil samples collected is widespread and data of soil salt content distributed in each grade of soil salinization (0.02–30 g/kg), therefore, the Rank method52 was chosen in this paper. The procedure was: all samples were sorted according to the electrical conductivity (EC) content, and then two neighbouring soil samples were selected as calibration sets for each soil sample to avoid this effect. The remaining soil samples were selected as validation sets. The cross-set was the same as the calibration set. In all, ninety samples were selected as a calibration set, and 36 samples were selected as an independent validation set for prediction. The whole established models were tested by the independent validation set. The evaluation of the model precision mainly adopted determination coefficient R2 and the root mean square error (RMSE) to forecast and measure values, respectively50. The larger the value of R2, the better the precision of the model. In addition, the smaller the RMSE, the better the precision of the model. The root mean square error algorithm is as follows $${\\\\rm{RMSE}}=\\\\sqrt{\\\\sum {(X-Y)}^{2}/N},$$ (1) where X represents the real value, Y represents the predictive value, and N represents the sample number. We had discussed the accuracy of PLSR models under different spectral transformation methods37. In this manuscript, we will establish the PCR models under the unified condition on the basis of the previous study, and analyze the accuracies of the two types of model (PLSR and PCR). The purpose of this paper is to compare the modelling accuracies between the two models (PLSR and PCR), specifically by analyzing the influence of different spectral transformation methods on the accuracy of the two models and considering the consistency of the models in experiments with four different spectral smoothing methods and a variety of spectral mathematical transformations. For convenience a small portion of the data were quoted from the reference37 for reuse and analysis. To avoid misunderstanding and ensure the seriousness and rigour of the article, we added annotations to the involved data (Tables 2 and 4). References Qadir, M. & Oster, J. D. Crop and irrigation management strategies for saline-sodic soils and waters aimed at environmentally sustainable agriculture. Sci. Total Environ. 323, 1–19 (2004). Article   ADS   CAS   Google Scholar   Wichelns, D. & Qadir, M. Achieving sustainable irrigation requires effective management of salts, soil salinity, and shallow groundwater. Agric. Water Manage. 157, 31–38 (2015). Article   Google Scholar   Singh, K., Singh, B. & Singh, R. R. Effect of land rehabilitation on physicochemical and microbial properties of a sodic soil. Catena. 109, 49–57 (2013). Article   CAS   Google Scholar   Ouni, Y. et al. Effects of two composts and two grasses on microbial biomass and biological activity in a salt-affected soil. Ecol. Eng. 60, 363–369 (2013). Article   Google Scholar   Rady, M. M. Effect of 24-epibrassinolide on growth, yield, antioxidant system and cadmium content of bean (Phaseolus vulgaris L.) plants under salinity and cadmium stress. Sci. Hortic. 129, 232–237 (2011). Article   CAS   Google Scholar   Yan, K. et al. Physiological adaptive mechanisms of plants grown in saline soil and implications for sustainable saline agriculture in coastal zone. Acta Physiol. Plant. 35, 2867–2878 (2013). Article   CAS   Google Scholar   Jiang, H. et al. The spatial and seasonal variation characteristics of fine roots in different plant configuration modes in new reclamation saline soil of humid climate in China. Ecol. Eng. 86, 231–238 (2016). Article   Google Scholar   Li, X. B. et al. First and second-year assessments of the rapid reconstruction and re-vegetation method for reclaiming two saline–sodic, coastal soils with drip-irrigation. Ecol. Eng. 84, 496–505 (2015). Article   Google Scholar   Liu, G. M. et al. GIS-mapping spatial distribution of soil salinity for Eco-restoring the Yellow River Delta in combination with Electromagnetic Induction. Ecol. Eng. 94, 306–314 (2016). Article   Google Scholar   Ouni, Y. et al. Influence of municipal solid waste (MSW) compost on hormonal status and biomass partitioning in two forage species growing under saline soil conditions. Ecol. Eng. 64, 142–150 (2014). Article   Google Scholar   Kitamura, Y., Yano, T., Honna, T., Yamamoto, S. & Inosako, K. Causes of farmland salinization and remedial measures in the Aral Sea Basin-Research on water management to prevent secondary salinization in rice-based cropping system in arid land. Agric. Water Manage. 85, 1–14 (2006). Article   Google Scholar   Metternicht, G. I. & Zinck, J. A. Remote sensing of soil salinity: Potentials and constraints. Remote Sensing of Environment. 85, 1–20 (2003). Article   ADS   Google Scholar   Farifteh, J., Farshad, A. & George, R. J. Assessing salt affected soils using remote sensing, solute modelling, and geophysics. Geoderma. 130, 191–206 (2006). Article   ADS   CAS   Google Scholar   Shoshany, M., Goldshleger, N. & Chudnovsky, A. Monitoring of agricultural soil degradation by remote-sensing methods:A review. Int. J. Remote. Sens. 34, 6152–6181 (2013). Article   ADS   Google Scholar   Liu, Y., Pan, X. Z., Wang, C. K., Li, Y. L. & Shi, R. J. Can subsurface soil salinity be predicted from surface spectral information? From the perspective of structural equation modelling. Biosystems Engineering. 152, 138–147 (2016). Article   Google Scholar   Zhang, T. T. et al. Using hyperspectral vegetation indices as a proxy to monitor soil salinity. Ecol. Eng. 11, 1552–1562 (2011). Google Scholar   Allbed, A. & Kumar, L. Soil salinity mapping and monitoring in arid and semi-arid regions using remote sensing technology: a review. Advances in Remote Sensing. 2, 373–385 (2013). Article   Google Scholar   Shi, Z., Ji, W., Viscarra Rossel, R. A., Chen, S. & Zhou, Y. Prediction of soil organic matter using a spatially constrained local partial least squares regression and the Chinese vis –NIR spectral library. Eur. J. Soil Sci. 66, 679–687 (2015). Article   CAS   Google Scholar   Clairotte, M. et al. National calibration of soil organic carbon concentration using diffuse infrared reflectance spectroscopy. Geoderma. 276, 41–52 (2016). Article   ADS   CAS   Google Scholar   Liu, H. J., Zhang, X. L. & Zheng, S. F. Black Soil Organic Matter Predicting Model Based on Field Hyperspectral Reflectance. Spectroscopy and Spectral Analysis. 30, 3355–3358 (2011). Google Scholar   Chang, C. & David, L. Near-infrared reflectance spectroscopic analysis of soil C and soil N. Soil Science. 167, 110–116 (2002). Article   ADS   CAS   Google Scholar   Wu, Y. Z., Zhang, X., Liao, Q. L. & Ji, J. F. Can contaminant elements in soils be assessed by remote sensing technology: A case study with simulated data. Soil Science. 176, 196–205 (2011). Article   ADS   CAS   Google Scholar   Ren, H. Y. et al. Estimation of As and Cu contamination in agricultural soils around a mining area by reflectance spectroscopy: A case study. Pedosphere. 19, 719–726 (2009). Article   CAS   Google Scholar   Haubrock, S. N., Chabrillat, S., Lemmnitz, C. & Kaufmann, H. Surface soil moisture quantification models from reflectance data under field conditions. Int. J. Remote. Sens. 29, 3–29 (2008). Article   ADS   Google Scholar   Li, Y., Liu, S. B., Liao, Z. H. & He, C. S. Comparison of two methods for estimation of soil water content from measured reflectance. Can. J. Soil Sci. 92, 845–857 (2012). Article   Google Scholar   Weng, Y. L., Gong, P. & Zhu, Z. L. Reflectance spectroscopy for the assessment of salt content in soils of the Yellow River Delta of China. Int. J. Remote. Sens. 29, 5511–5531 (2008). Article   ADS   Google Scholar   Zhang, F., Ding, J. L., Tashpolat., T. & He, Q. S. Spectral Data Analysis of Salinity Soils with Ground Objects in the Delta Oasis of Weigan and Kuqa Rivers. Spectroscopy and Spectral Analysis. 28, 2921–2926 (2008). CAS   PubMed   Google Scholar   Farifteh, J., Van der Meer, F., Atzberger, C. & Carranza, E. J. M. Quantitative analysis of salt-affected soil reflectance spectra: A comparison of two adaptive methods (PLSR and ANN). Remote Sensing of Environment. 110, 59–78 (2007). Article   ADS   Google Scholar   Nawar, S., Buddenbaum, H., Hill, J. & Kozak, J. Modeling and mapping of soil salinity with reflectance spectroscopy and landsat data using two quantitative methods (PLSR and MARS). Remote Sensing. 6, 10813–10834 (2014). Article   ADS   Google Scholar   Liu, Y., Pan, X. Z., Wang, C. K., Li, Y. L. & Shi, R. J. Predicting soil salinity with Vis-NIR spectra after removing the effects of soil moisture using external parameter orthogonalization. PLoS One. 10, e0140688 (2015). Article   Google Scholar   Stenberg, B., Viscarra Rossel, R. A., Mouazen, A. M. & Wetterlind, J. Visible and near infrared spectroscopy in soil science. Adv. Agron. 107, 163–215 (2015). Article   Google Scholar   Shi, X. Z., Aspandiar, M. & Oldmeadow, D. Using hyperspectral data and PLSR modelling to assess acid sulphate soil in subsurface. Journal of Soils and Sediments. 14, 904–916 (2014). Article   CAS   Google Scholar   Zeng, R. et al. Selection of “Local” models for prediction of soil organic matter using a regional soil Vis-NIR spectral library. Soil Science. 181, 13–19 (2016). Article   CAS   Google Scholar   Qu, Y. H. et al. Quantitative Retrieval of Soil Salinity Using Hyperspectral Data in the Region of Inner Mongolia Hetao Irrigation District. Spectroscopy and Spectral Analysis. 29, 1362–1366 (2009). CAS   PubMed   Google Scholar   Ren, H. Y., Zhuang, D. F., Qiu, D. S. & Pan, J. J. Analysis of Visible and Near-Infrared Spectra of As-Contaminated Soil in Croplands Beside Mines. Spectroscopy and Spectral Analysis. 29, 114–118 (2009). CAS   PubMed   Google Scholar   Chang, C. W., Laird, D. A., Mausbach, M. J. & Hurburgh, C. R. Near-infrared reflectance spectroscopy–principal components regression analyses of soil properties. Soil Sci. Soc. Am. J. 65, 480–490 (2001). Article   ADS   CAS   Google Scholar   Zhang, X. G. et al. Quantitative Prediction of Soil Salinity Content with Visible-Near Infrared Hyper-Spectra in Northeast China. Spectroscopy and Spectral Analysis. 32, 2075–2079 (2012). PubMed   Google Scholar   Ben-Dor, E., Ong, C. & Lau, I. C. Reflectance measurements of soils in the laboratory: standards and protocols. Geoderma. 245–246, 112–124 (2015). Article   ADS   Google Scholar   Wang, Z. Q., Zhu, S. Q. & Yu, R. P. Saline Soil of China. (ed. Chen, P. L.) 130–216 (Science Press, 1993). Zhang, S. W., Yang, J. C., LI, Y., Zhang, Y. Z. & Chang, L. P. Changes of saline-alkali land in Northeast China and its causes since the mid-1950s. Journal of natural resources. 25, 435–442 (2015). Google Scholar   Gong, Z. T. et al. Chinese Soil Taxonomy: Theory, methodology and practices. (ed. Chen, P. L.) 885–893 (Science Press, 1999). Wang, J., Liu, X. N., Huang, F. & Zhao, L. B. Salinity forecasting of saline soil based on ANN and hyperspectral remote sensing. Transactions of the Chinese Society of Agricultural Engineering. 25, 161–166 (2009). Google Scholar   Xu, L. & Shao, X. G. Methods of Chemomeletcs, second. (eds Liu, J. L., Wang, Z. X. & Wu, L. L.) 130–177, (Science Press, 2004). Kemper, T. & Sommer, S. Estimate of heavy metal contamination in soils after a mining accident using reflectance spectroscopy. Environ. Sci. Technol. 36, 2742–2747 (2002). Article   ADS   CAS   Google Scholar   Wu, Y. Z., Chen, J., Ji, J. F., Tian, Q. J. & Wu, X. M. Feasibility of reflectance spectroscopy for the assessment of soil mercury contamination. Environ. Sci. Technol. 39, 873–878 (2005). Article   ADS   CAS   Google Scholar   Xia, X. Q. et al. Reflectance spectroscopy study of Cd contamination in the sediments of the Changjiang River, China. Environ. Sci. Technol. 41, 3449–3454 (2007). Article   ADS   CAS   Google Scholar   Lu, R. K. Methods of soil and agro-chemical analysis. (eds Liu, X. S. & Chen, S. H.) 130–216 (China Agricultural Science and Technology Press, 2000). Roberts, C., Workman, J. & Reeves, J. Near-Infrared Spectroscopy in Agriculture. (eds Roberts, C., Workman, J. & Reeves, J.) 1–646 (Soil Science Society of America, Crop Science Society of America and Soil Science Society of America, 2004). Mevik, B. H. & Wehrens, R. The pls package: principal component and partial least squares regression in R. J. Stat. Softw. 18, 1–24 (2007). Article   Google Scholar   David, M. H. & Edward, V. T. Partial least-squares methods for spectral analyses. 1. relation to other quantitative calibration methods and the extraction of qualitative information. Anal. Chem. 60, 1193–1202 (1988). Article   Google Scholar   Wold, S., Sjostrom, M. & Eriksson, L. PLS-regression: A basic tool of chemometrics. Chemometrics and Intelligent Laboratory Systems. 58, 109–130 (2001). Article   CAS   Google Scholar   Tang, J., Baldocchi, D. D., Qi, Y. & Xu, L. Assessing soil CO2 efflux using continuous measurements of CO2 profiles in soils with small solid-state sensors. Agric. For. Meteorol. 118, 207–220 (2003). Article   ADS   Google Scholar   Download references Acknowledgements This research is supported by the National Natural Science Foundation of China (No. 41601211), the Open Fund at the State Key Laboratory of Soil and Sustainable Agriculture (No. Y20160007), Talent Fund of Qingdao Agricultural University (No. 1114344) and the Special Fund for Agro-scientific Research in the Public Interest (No. 200903001-01). Author information Authors and Affiliations State Key Laboratory of Soil and Sustainable Agriculture, Institute of Soil Science, Chinese Academy of Sciences, Nanjing, 210008, China Xiaoguang Zhang & Biao Huang Key Laboratory of soil Environment and pollution Remediation, Institute of Soil Science, Chinese Academy of Sciences, Nanjing, 210008, China Xiaoguang Zhang & Biao Huang College of Resources and Environment, Qingdao Agricultural University, Qingdao, 266109, China Xiaoguang Zhang Contributions Xiaoguang Zhang and Biao Huang conceived and designed the experiments, Xiaoguang Zhang analysed the data, and Xiaoguang Zhang wrote the paper. Corresponding author Correspondence to Biao Huang. Ethics declarations Competing Interests The authors declare no competing interests. Additional information Publisher’s note: Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary information soil spectral data Dataset 1 Rights and permissions Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/. Reprints and permissions About this article Cite this article Zhang, X., Huang, B. Prediction of soil salinity with soil-reflected spectra: A comparison of two regression methods. Sci Rep 9, 5067 (2019). https://doi.org/10.1038/s41598-019-41470-0 Download citation Received 24 April 2018 Accepted 04 March 2019 Published 25 March 2019 DOI https://doi.org/10.1038/s41598-019-41470-0 Share this article Anyone you share the following link with will be able to read this content: Get shareable link Provided by the Springer Nature SharedIt content-sharing initiative Subjects Ecological modelling Environmental impact Natural hazards This article is cited by Soil salinity mapping using Landsat 8 OLI data and regression modeling in the Great Hungarian Plain Ghada Sahbeni SN Applied Sciences (2021) Comments By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Download PDF Sections Figures References Abstract Introduction Results Discussion Conclusions Methods References Acknowledgements Author information Ethics declarations Additional information Supplementary information Rights and permissions About this article This article is cited by Comments Advertisement Scientific Reports (Sci Rep) ISSN 2045-2322 (online) About Nature Portfolio About us Press releases Press office Contact us Discover content Journals A-Z Articles by subject Protocol Exchange Nature Index Publishing policies Nature portfolio policies Open access Author & Researcher services Reprints & permissions Research data Language editing Scientific editing Nature Masterclasses Research Solutions Libraries & institutions Librarian service & tools Librarian portal Open research Recommend to library Advertising & partnerships Advertising Partnerships & Services Media kits Branded content Professional development Nature Careers Nature Conferences Regional websites Nature Africa Nature China Nature India Nature Italy Nature Japan Nature Korea Nature Middle East Privacy Policy Use of cookies Your privacy choices/Manage cookies Legal notice Accessibility statement Terms & Conditions Your US state privacy rights © 2024 Springer Nature Limited\"",
        "analysis": "",
        "verbatim_quote1": "",
        "verbatim_quote2": "",
        "verbatim_quote3": "",
        "relevance_score1": 0,
        "relevance_score2": 0,
        "limitations": "",
        "inline_citation": "",
        "full_citation": ""
    },
    {
        "title": "Smoothing and gap-filling of high resolution multi-spectral time series: Example of Landsat data",
        "doi": "10.1016/j.jag.2016.12.012",
        "description": "This paper introduces a novel methodology for generating 15-day, smoothed and gap-filled time series of high spatial resolution data. The approach is based on templates from high quality observations to fill data gaps that are subsequently filtered. We tested our method for one large contiguous area (Bavaria, Germany) and for nine smaller test sites in different ecoregions of Europe using Landsat data. Overall, our results match the validation dataset to a high degree of accuracy with a mean absolute error (MAE) of 0.01 for visible bands, 0.03 for near-infrared and 0.02 for short-wave-infrared. Occasionally, the reconstructed time series are affected by artefacts due to undetected clouds. Less frequently, larger uncertainties occur as a result of extended periods of missing data. Reliable cloud masks are highly warranted for making full use of time series.",
        "journal": "International Journal of Applied Earth Observation and Geoinformation",
        "authors": [
            "Vuolo F.",
            "Ng W.T.",
            "Atzberger C."
        ],
        "citation_count": "61",
        "full_text": "\"Skip to main content Skip to article Journals & Books Search Register Sign in Brought to you by: University of Nebraska-Lincoln View PDF Download full issue Outline Highlights Abstract Keywords 1. Introduction 2. Material and methods 3. Results and discussion 4. Conclusions Acknowledgments References Show full outline Cited by (62) Figures (10) Show 4 more figures Tables (3) Table 1 Table 2 Table 3 International Journal of Applied Earth Observation and Geoinformation Volume 57, May 2017, Pages 202-213 Smoothing and gap-filling of high resolution multi-spectral time series: Example of Landsat data Author links open overlay panel Francesco Vuolo, Wai-Tim Ng, Clement Atzberger Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.jag.2016.12.012 Get rights and content Highlights • An approach to filter multi-spectral images using template-based gap-filling. • The algorithm is implemented and demonstrated with Landsat CDR data. • Results are time series of 15-day images at 30 m pixel in six spectral bands. • Independent validation showed very positive results. • Improved cloud masks should be a top research. Abstract This paper introduces a novel methodology for generating 15-day, smoothed and gap-filled time series of high spatial resolution data. The approach is based on templates from high quality observations to fill data gaps that are subsequently filtered. We tested our method for one large contiguous area (Bavaria, Germany) and for nine smaller test sites in different ecoregions of Europe using Landsat data. Overall, our results match the validation dataset to a high degree of accuracy with a mean absolute error (MAE) of 0.01 for visible bands, 0.03 for near-infrared and 0.02 for short-wave-infrared. Occasionally, the reconstructed time series are affected by artefacts due to undetected clouds. Less frequently, larger uncertainties occur as a result of extended periods of missing data. Reliable cloud masks are highly warranted for making full use of time series. Previous article in issue Next article in issue Keywords Time seriesGap-fillingFiltering 1. Introduction An increasing number of analytical and methodological tools, applications and services require continuous and frequently updated Earth Observation (EO) time series data. Examples are land surface phenology (Verbesselt et al., 2010a, Verbesselt et al., 2010b, Melaas et al., 2013), agricultural monitoring systems (Moran et al., 1997), crop yield mapping and prediction (Unganai and Kogan, 1998, Rembold et al., 2013), irrigation management (Vuolo et al., 2015a, Vuolo et al., 2015c), mapping of crop types (Wardlow et al., 2007) and cropping systems (Sakamoto et al., 2006, El Hajj et al., 2009). The opportunities for exploiting time series improved radically in 2008 when the Landsat program opened its more than 40 years archive (Woodcock et al., 2008). Further improvements are expected thanks to the European Copernicus program (Berger et al., 2012). Its first optical high resolution satellite (Sentinel-2A) was successfully launched on April 27th 2015 and a twin satellite will follow in early 2017 (Sentinel-2B). One main limiting factor for full exploitation of these high spatial resolution optical time series relates to data gaps and noise due to clouds, cloud shadow and snow cover. Impacts depend on season, topography, location and environment (e.g. mountainous and coastal areas with usually less usable data) (Beck et al., 2006, Ju and Roy, 2008). Various approaches attempted to reconstruct EO data to obtain high resolution cloud- and gap-free images using temporal composited mosaicking (Bielski et al., 2007, Roy et al., 2010, Eivazi et al., 2015, Lei and Siqueira, 2015), histogram matching (Helmer and Ruefenacht, 2005, Rakwatin et al., 2007, Shapira et al., 2013), pixel based compositing (Griffiths et al., 2013, Hermosilla et al., 2015a, Vanonckelen et al., 2015, Zhu et al., 2015a), data fusion (Gao et al., 2006, Roy et al., 2008, Hilker et al., 2009, Zhang et al., 2013, Bisquert et al., 2015, Gevaert and García-haro, 2015) and spatial-temporal gap-filling (Xu et al., 2015, Malambo and Heatwole, 2016). A review can be found in (Shen et al., 2015). These approaches are often applied to gap-fill time series of spectral indices and frequently do not provide sufficient temporal resolution (e.g. 15-day) to study highly dynamic crop growing conditions at high spatial resolution (i.e. 30 m with Landsat). The scope of this paper is to introduce a novel methodology to create spatially and temporally consistent and continuous time series of cloud-free, bottom-of-the-atmosphere (BOA) multi-spectral images at high spatial and temporal resolution. To develop and validate the methodology, we use Landsat data and compare reconstructed images against non-cloudy reference data not used during the filtering and gap-filling process. 2. Material and methods The proposed methodology is applied on temporal stacks of Landsat data, where the data cube includes layers being (partially) cloudy and/or showing sensor artefacts (Fig. 1). The novelty of the proposed approach stems from two innovative aspects: • the filling of data gaps using templates (e.g. information derived from the neighbourhood of the pixel to be filtered) complementing the available data where missing, and • the use of a state-of-the-art Whittaker smoother for filtering the previously gap-filled time series. Download : Download high-res image (727KB) Download : Download full-size image Fig. 1. Illustration of the main radiometric problems occurring when working with high spatial resolution data, hindering the generation of high quality time series. The methodological workflow to produce smooth and gap-filled images is presented in Fig. 2 and the key elements are illustrated in Fig. 3 for one exemplary pixel in two spectral channels. Download : Download high-res image (418KB) Download : Download full-size image Fig. 2. Flowchart of the proposed processing. Download : Download high-res image (1MB) Download : Download full-size image Fig. 3. Key elements of the smoothing and gap-filling algorithm illustrated for one exemplary pixel in two spectral channels: (A) time series (2009–2015) of the selected pixel in the red (left) and near-infrared bands (right). Using the valid observations, the best templates are found (B). The best five templates are combined (median value) and integrated with the valid observations (C). A weight of 1 and 0.5 is assigned to the valid observations and to the templates, respectively. (D) data are finally filtered with the Whittaker smoother to produce smoothed and gap-filled spectral reflectance time series (black continuous line). (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) In the first step, Landsat data are clipped in image tiles of equal size (1000 × 1000 pixels) preserving the native pixel size, geographic projection (UTM WGS 84) and day of acquisition. Then, in a second step, a mask is constructed, which is used to weight each observation in the subsequent filtering process. For the construction of this mask, an essential requirement is the identification of data gaps. We rely on the Function of mask (‘fmask’) algorithm, part of the Landsat production chain, to flag clouds, cloud shadows and snow pixels (Zhu et al., 2015b). Our binary mask takes a value of w = 1 (i.e. valid observations) for non-cloudy and non-missing values and a value of w = 0 (not valid observations) for all other pixels (including snow). The data is transformed in a third step into equally spaced observations with a temporal resolution of 15 days resulting in 24 regularly spaced images per year (2 images per month). The date of the first day of the compositing period is assigned to the new images (e.g. 1st and 16th of each month). If two (or more) valid observations for the same pixel are found within a 15-day period, the average is calculated and used; the mask value remains at w = 1 (valid observation). Note that gaps are still present in these composite images. The forth step consists in building a pool of so-called ‘templates’. Templates are time series of pixels characterized by a high number of valid observations in the temporal dimension. Before making use of the templates for gap-filling, gaps in the templates are filled using the Whittaker smoother developed by Eilers (Eilers, 2003) (a weighted spline with second order finite difference penalty) and a smoothing parameter (λWS = 0.5) that preserves fidelity to data rather than data smoothness (Atzberger and Eilers, 2011) (Eq. (1)). The template selection is performed considering multiple years in the temporal stack of 15-day images (e.g. 2009–2016). To ensure representativeness of the templates, the template search is stratified using the CORINE land cover map (European Environment Agency, 2006) aggregated to 11 classes (Table 3). Within each class, we first count the total number of valid observations per pixel and the length of data gaps and then select the pixels with the highest number of valid observations and the most regular distribution of gaps (e.g. avoiding clumped − and therefore long − data gaps). For this study, to qualify as template, the number of valid observations should be greater than the 99th percentile of the valid observations in a specific image tile and the variance in the length of data gaps should be less than the 1st percentile. Amongst the candidates that satisfy these two rules (quantity of valid observations and distribution of gaps), we exclude the most similar templates based on the pair-wise Euclidean distance ensuring that at least 50% of the pairs have a distance below the total mean distance of the overall distance matrix. Table 1. Overview of parameters and recommended settings. Parameter Description Min. Max Standard value λWS Smoothing parameter of the Whittaker filter 1 9 3 w Weight assigned to: cloudy pixels 0 clear pixels 1 wt Weight assigned to templates 0.1 0.7 0.5 nT Number of considered templates 500 1000 500 tpp Templates considered per pixel 1 5 5 Table 2. Overview of the available Landsat CDR data. Satellite/ Sensor Status Design life Bands Revisit time Temporal coverage Spatial resolutiona Spectral resolutiona Landsat 4–5 TM Failure 2012 ≥3 years 7 16 days Nov 1982–May 2012 30 m 0.45–2.35 μm Landsat 7 ETM+ SLC-scan line error 1999 ≥5 years 8 16 days Jul 1999–today 30 m 0.45–2.35 μm Landsat 8 OLI Fully operational 5–10 years 11 16 days Apr 2013–today 30 m 0.43–2.29 μm a Excluding the thermal and panchromatic bands. Table 3. Overview of the coefficient of determination (R2) and the normalized Mean Absolute Error (nMAE) grouped by land cover type. All results refer to independent validation data from the nine validation test sites (Fig. 5). Empty Cell Empty Cell R2 nMAE Land cover % Area Blue Green Red NIR SWIR1 SWIR2 Blue Green Red NIR SWIR1 SWIR2 Artificial surfaces 5.1% 0.76 0.76 0.82 0.80 0.84 0.81 15 12 13 9 9 12 Arable land 42.7% 0.79 0.84 0.86 0.77 0.84 0.83 15 13 16 12 11 15 Permanent crops 5.5% 0.74 0.84 0.88 0.71 0.83 0.85 14 11 12 9 10 13 Pasture 8.3% 0.55 0.66 0.68 0.74 0.68 0.68 22 15 22 12 12 18 Heter. Agric. 10.4% 0.83 0.88 0.89 0.81 0.88 0.89 16 12 15 10 10 13 Broad-leaved F. 9.1% 0.76 0.83 0.87 0.90 0.84 0.87 17 12 16 8 9 12 Coniferous F. 7.7% 0.76 0.87 0.92 0.90 0.94 0.94 25 16 19 9 12 15 Mixed Forest 3.7% 0.65 0.81 0.84 0.90 0.90 0.89 28 17 22 12 12 16 Scrubland 6.3% 0.85 0.90 0.93 0.89 0.92 0.93 15 11 12 8 8 10 Open spaces (no veg.) 0.3% 0.89 0.79 0.78 0.97 0.96 0.90 31 21 22 8 17 20 Wetlands/water 1.0% 0.27 0.43 0.62 0.81 0.87 0.86 24 20 26 36 40 44 All 100% 0.84 0.89 0.91 0.83 0.90 0.89 16 12 15 10 10 14 The fifth step is the ‘template matching’. During this step we compute the Euclidean distance between each template and each pixel and then select the templates that best match the temporal and spectral profile of each pixel. The Euclidean distance is calculated considering all spectral bands and temporal dimensions combined, ignoring non-valid observations in the target pixel (e.g. where w = 0). At least three years of data are used to ensure a sufficient number of common dates over which we can compute the Euclidean distance. This step is computationally intensive and therefore we limit the templates to a maximum number of 1000. To process a full Landsat scene (40 Mil. pixels) requires about 30 core-hours with 1000 templates (based on an Intel Core i7-2600K @ 3.40 GHz processor) or 14 core-hours using 500 templates. After template matching, non-valid (w = 0) observations in the target pixel are replaced with the values from the corresponding best matching templates. Gap-filled values are assigned an intermediate weight (0 < w < 1) in the weight map. Valid observations remain unchanged (w = 1). In the sixth and final step, the Whittaker smoother is applied independently for each spectral band and each pixel to produce smoothed and gap-filled images. The smoother is based on penalised least squares. It fits a discrete series to discrete data and penalises the roughness of the smooth curve. In this way, it balances reliability of the data and roughness of the fitted data. The smoother the result, the more it will deviate from the input data. A balanced combination of the two goals is the sum (Q): (1) With: (2) (3) The lack of fit to the data S (Eq. (2)) is measured as the usual sum of squares of differences. The roughness of the smoothed curve R (Eq. (3)) is expressed here as third order differences. The smoothing parameter λWS is chosen by the user. The aim of penalised least squares is to find the series VI(t) that minimises Q (Eq. (1)). The larger the parameter λWS, the greater is the influence of R on the goal Q and the smoother will be VI(t) (at the cost of the degradation of the fit). In summary, five parameters are used to parameterize the algorithm (Table 1): • λWS: the smoothing parameter determines the smoothness of the resulting temporal profile. Based on a sensitivity analysis, we use values in the range 1 ≤ λWS ≤ 9 (for filling the gaps in the templates we use λWS = 0.5). • w and wt: the weights of observations and gap-filled values define the importance of each observation when applying the Whittaker smoother. Valid observations obtain a value of w = 1 (maximum weight); lower weights (wt, between 0.1 and 0.7) are assigned to templates assuming that they do not perfectly substitute actual valid observations; • nT: the total number of templates in the pool of suitable templates defines amongst how many different temporal profiles the algorithm can chose to fill gaps. • tpp: the number of templates per pixel defines how many templates are considered and averaged to replace non-valid observations. We use the five best fitting templates to calculate the median from those templates. 2.1. Assessment of data reconstruction To assess the performance of the proposed approach, high quality subsets of the images are removed to create artificial data gaps (Fig. 4). Subsequently, the reconstruction of the artificially removed pixels is assessed. Download : Download high-res image (246KB) Download : Download full-size image Fig. 4. Generation of independent validation samples. The illustration shows the sampling strategy in the spatial-temporal space. The coloured layers represent the actual Landsat observations. The black polygons are the locations of the boxes of 10 × 10 pixels, which are removed from the time series to serve as (left-out) validation samples. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) To implement this approach, we first loop over the time series of 15-day Landsat CDR data, and for each time step, we randomly select a box of 10 × 10 pixels. Within this box, if data are of high quality (w = 1), we artificially set the weight to 0 (i.e. no data). These data are than reconstructed and compared against the original Landsat CDR data. We make sure that for each bi-monthly time step, a different box location is selected (black polygons in Fig. 4). The scatter plots and simple linear regressions between Landsat (x-axis) and reconstructed (y-axis) reflectance data are generated considering all pixels within the boxes. The agreement between the two datasets is evaluated with the mean absolute error (MAE) and through the normalized MAE (nMAE). The latter statistic has the advantage that values can be compared across spectral bands. For comparison with other studies, the root mean square error (RMSE) is also provided (Zhu et al., 2015a, Hermosilla et al., 2015b). 2.2. Study area The approach is applied over one large test site (Bavaria, Germany, >70.000 km2) as well as nine smaller sites (each 3.600 km2) distributed across Europe (Fig. 5). The large site is one of our main project area (Immitzer et al., 2015) and is used to illustrate the quality of wall-to-wall mapping. The nine smaller sites are used to quantify the model performance for different climatic conditions. In all cases, we process data covering the time span from 2008 to 2016 and restrict the evaluation to the time period 2009–2015 to avoid boundary effects at the tails of the time series. Download : Download high-res image (468KB) Download : Download full-size image Fig. 5. Location of the nine small validation sites within Europe (labelled A to I; red polygons) and the state of Bavaria (grey). The blue outline shows the footprint of the Landsat coverage for the respective small sites. The full Landsat coverage for the state of Bavaria is not shown. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) 2.3. Earth observation data To develop and validate the approach, we use Landsat Surface Reflectance Climate Data Record (Landsat CDR) combining atmospherically corrected data from multiple sensors such as Landsat 4–5 Thematic Mapper (TM), Landsat-7 Enhanced Thematic Mapper Plus (ETM+) and Landsat-8 Operational Land Imager (OLI) (Table 2). Landsat CDR is a Level-2A product (Masek et al., 2006, Vermote et al., 2015) covering the period from 1982 until the present day. Roy et al. (Roy et al., 2015) showed that these product still presents some minor differences not related to physical properties of the surface but rather to differences in the sensor specifications and atmospheric correction procedures. Excluding the blue band, however, the differences between sensors (i.e. Landsat-8 OLI and Landsat-7 ETM+) are small and within the accuracy of the atmospheric correction procedures (Roy et al., 2015). Landsat CDR data were found in good agreement with the Aerosol Robotic Network (AERONET), with Moderate Resolution Imaging Spectroradiometer (MODIS) (Vermote et al., 2015, Maiersperger et al., 2013, Ju et al., 2012, Feng et al., 2013) and with other atmospherically corrected Landsat and Deimos-1 data (Vuolo et al., 2015b). 3. Results and discussion 3.1. Qualitative assessment Fig. 6 depicts the spatial and temporal variability in the vegetation phenology for the start of the four meteorological seasons, without revealing artefacts due to clouds or missing data. The first image (top left; DoY 75) displays more soils as most agricultural areas are not yet vegetated. At the same time, the leaves of deciduous trees have not yet developed. The vegetated pixels (in red) are either coniferous trees or winter crops. The second image (top right; DoY 167) shows abundant healthy vegetation from agricultural areas and the least amount of snow cover. The third image (down left; DoY 259) still shows some vegetation, but to a lesser extent compared to the summer image as most crops have been harvested and photosynthetic activity decreased. Finally, the last image (down right; DoY 350) shows the highest amounts of bare soils and snow and the lowest number of vegetated pixels. Download : Download high-res image (2MB) Download : Download full-size image Fig. 6. Examples of false colour composites (RGB: NIR, Green and Red) for four images generated at the day of the year (DoY) 75, 167, 259 and 350 in 2010 for the state of Bavaria. The dates selected for the display correspond to the start of the four meteorological seasons. For better interpretation of the images, the CORINE land cover map (European Environment Agency, 2006) is also presented. (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) Fig. 7 shows a detail of an area affected by clouds (both detected and undetected) and its reconstruction. In this part of the scene, the main clouds and their shadows were correctly identified by the ‘fmask’. However, a contrail (and its shadow) is also present but not identified. The reconstructed image (top left) and the difference between original (16 May 2014) and reconstructed image (bottom left) shows the accuracy of the reconstruction and the spatial variability of the reconstruction effect. Download : Download high-res image (3MB) Download : Download full-size image Fig. 7. An example of reconstructed (top left) and original (top right) Landsat image and their difference (bottom left). The ‘fmask’ data showing detected clouds and cloud shadows is also reported (bottom right). (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) 3.2. Performance of reconstruction over validation areas The performance of reconstruction was quantitatively evaluated for the nine small sites (labelled A-I in Fig. 5) using λWS = 1 with wt = 0.5 (Table 1). In total, we used a randomly selected set of 702.854 cloud-free observations over all spectral channels as independent reference. The close relation between reconstructed spectral reflectances and independent (left-out) reference data for the combined data across the six spectral channels is shown in Fig. 8. The normalized mean absolute error (nMAE) ranges between 10% (NIR and SWIR-1) and 16% (blue) with an overall nMAE across all spectral bands of 12%. Fig. 9, Fig. 10 present the accuracy of reconstruction aggregated per month of the year and for each of the nine test sites. Amongst the six spectral bands, near- and short-wave infrared bands are better reconstructed compared to visible bands and short-wave infrared band 7 (SWIR-2). As expected, the blue band is the most difficult to reconstruct due to stronger atmospheric disturbances in this spectral region. To detect possible influences related to land cover type, the results were further disaggregated based on CORINE land cover data. The resulting R2 and nMAE for the combination of all test sites, bands and years are presented in Table 3. Results show very high accuracy of reconstruction (R2 > 0.8) for artificial surfaces, shrubland and open spaces with no vegetation. Probably, these land cover types are less subject to temporal changes, leading to a better fitting of the templates. Amongst the other vegetation classes, pasture and mixed forest are reconstructed with a lower R2 and higher nMAE. The band-specific correlation (R2) is in the range 0.77–0.89 (25th and 75th percentile). The nMAE values are in the range 11.3% (25th percentile) to 16.1% (75th percentile) with the exception of low reflecting wetlands/water, with larger (normalized) errors. Download : Download high-res image (846KB) Download : Download full-size image Fig. 8. Validation results using independent reference data from the nine validation test sites (Fig. 5). The scatter plots show the relation between Landsat CDR (x-axis) observations and reconstructed reflectances (y-axis) in the six spectral channels. Download : Download high-res image (103KB) Download : Download full-size image Fig. 9. Coefficient of determination (R2) and the normalized Mean Absolute Error (nMAE) grouped by month. Results refer to independent validation data from the nine validation test sites. Download : Download high-res image (1MB) Download : Download full-size image Fig. 10. Climate, topography, cumulative distribution function (CDF) of valid observations and accuracy of reconstruction for the nine validation sites. Climate classification according to the Köppen-Geiger (Kottek et al., 2006). (For interpretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) 3.3. Applicability and limitations Under most conditions, the algorithm reconstructs missing data with a good accuracy. However, the approach relies on the cloud mask and a failure in the detection of clouds, or non-permanent snow areas, directly impacts the accuracy of the data reconstruction. The lack of a sufficient number of high quality observations for specific years (i.e. 2012 due to L-5 failure) or geographic regions (especially over the Alps due to saturated Landsat reflectances and/or persistent cloud cover) is also problematic as well as the Landsat-7 Scan Line Corrector (SLC) failure, which leads − over certain (reoccurring) areas − to a strong persistency of missing observations. The approach smooths the temporal trajectories of the spectral values and it is not recommended for applications relying on the detection of abrupt changes. Sudden changes occur, for example, as a result of wind-throw and forest fires, or after floods or earthquakes. For (abrupt) change detection, methods such as (Verbesselt et al., 2010b) are probably more efficient. The main innovation compared to previous studies is the possibility to reconstruct reflectance at high spatial (30 m) and temporal (15-day) resolutions. Such resolutions are necessary to monitor gradual temporal evolutions, for instance, to detect different crop types and tree species (Immitzer et al., 2016), and to support the monitoring of land surface phenology [53]. Attempts to produce gap- and noise-free reflectance data were tested by (Zhu et al., 2015a) and (White et al., 2014). In (Zhu et al., 2015a), results are accurate if temporal trajectories can be modelled according to the prescribed (mathematical) model. In (White et al., 2014), a Best Available Pixel (BAP) approach is proposed and tested. However, BAP only produces seasonal or annual composites, whereas our methodology achieves a temporal resolution of 15 days keeping the original time course of the observation and filling in missing data with a flexible smoothing algorithm. The performance of our method is in line with findings of other studies. Using the same set of data for model development and accuracy assessment, Zhu et al. (Zhu et al., 2015a) reported a RMSE (units of reflectance) of 0.01 for VIS bands, of 0.01–0.02 for SWIR and 0.02–0.03 for NIR bands. In our study, using an independent validation dataset, we achieved a RMSE of 0.013–0.022 for VIS, 0.032–0.035 for SWIR and 0.041 for NIR bands. Hermosilla et al. (Hermosilla et al., 2015b) reconstructed annual Landsat gap-free composites obtaining a RMSE between 0.008 (Blue) and 0.025 (NIR) also based on independent reference data. 4. Conclusions In this study, we introduce a novel filtering approach to obtain cloud- and gap-free high spatial resolution (30 m) time series of reflectance data. The methodology was developed and validated for one large test site and nine smaller sites, comprising a wide range of environmental conditions using Landsat-5, −7 and −8 observations for a multi-year time period (2009–2015). The validation indicates a good match between observed and reconstructed data. Reconstruction was more accurate during summer months and for longer wavelengths (i.e. NIR and SWIR). Land cover surfaces that remain mostly unchanged over time (i.e. artificial surfaces) showed a slightly higher performance compared to highly dynamic land cover types (i.e. arable land or pastures). Main limitations in our methodology are due to occasional problems in the identification of clouds in the “fmask” and periodically insufficient cloud-free observations (especially in mountainous regions). We expect that the use of multiple sensors (e.g. Landsat-8 and Sentinel-2) in a virtual constellation will improve the availability of cloud-free observations and therefore the reconstruction of missing data. However, the inter-calibration of the Landsat ETM+ and OLI and between Landsat and Sentinel-2 will need to be addressed in more detail. A QGIS project with raw and processed data for the Bavaria region can be download at Mendeley Data repository (Vuolo, 2016). Acknowledgments The work has been partly supported by the Austrian Space Applications Programme (ASAP) FFG within the projects “CropMon” and “LandMon”. References Verbesselt et al., 2010a J. Verbesselt, R. Hyndman, A. Zeileis, D. Culvenor Phenological change detection while accounting for abrupt and gradual trends in satellite image time series Remote Sens. Environ., 114 (no. 12) (2010), pp. 2970-2980 View PDFView articleView in ScopusGoogle Scholar Verbesselt et al., 2010b J. Verbesselt, R. Hyndman, G. Newnham, D. Culvenor Detecting trend and seasonal changes in satellite image time series Remote Sens. Environ., 114 (no. 1) (2010), pp. 106-115 View PDFView articleView in ScopusGoogle Scholar Melaas et al., 2013 E.K. Melaas, M. a. Friedl, Z. Zhu Detecting interannual variation in deciduous broadleaf forest phenology using Landsat TM/ETM+ data Remote Sens. Environ., 132 (2013), pp. 176-185 View PDFView articleView in ScopusGoogle Scholar Moran et al., 1997 M.S. Moran, Y. Inoue, E.M. Barnes Opportunities and limitations for image-based remote sensing in precision crop management Remote Sens. Environ., 61 (no. 3) (1997), pp. 319-346 View PDFView articleView in ScopusGoogle Scholar Unganai and Kogan, 1998 L.S. Unganai, F.N. Kogan Drought monitoring and corn yield estimation in southern Africa from AVHRR data Remote Sens. Environ., 63 (no. 3) (1998), pp. 219-232 View PDFView articleView in ScopusGoogle Scholar Rembold et al., 2013 F. Rembold, C. Atzberger, I. Savin, O. Rojas Using low resolution satellite imagery for yield prediction and yield anomaly detection Remote Sens., 5 (no. 4) (2013), pp. 1704-1733 CrossRefView in ScopusGoogle Scholar Vuolo et al., 2015a F. Vuolo, L. Essl, C. Atzberger Costs and benefits of satellite-based tools for irrigation management Front. Environ. Sci, 3 (July) (2015), pp. 1-12 CrossRefView in ScopusGoogle Scholar Vuolo et al., 2015c F. Vuolo, G. D’Urso, C. De Michele, B. Bianchi, M. Cutting Satellite-based irrigation advisory services: a common tool for different experiences from Europe to Australia Agric. Water Manag., 147 (2015), pp. 82-95 View PDFView articleView in ScopusGoogle Scholar Wardlow et al., 2007 B.D. Wardlow, S.L. Egbert, J.H. Kastens Analysis of time-series MODIS 250??m vegetation index data for crop classification in the U.S. Central Great Plains Remote Sens. Environ., 108 (no. 3) (2007), pp. 290-310 View PDFView articleView in ScopusGoogle Scholar Sakamoto et al., 2006 T. Sakamoto, N. Van Nguyen, H. Ohno, N. Ishitsuka, M. Yokozawa Spatio-temporal distribution of rice phenology and cropping systems in the Mekong Delta with special reference to the seasonal water flow of the Mekong and Bassac rivers Remote Sens. Environ., 100 (no. 1) (2006), pp. 1-16 View PDFView articleView in ScopusGoogle Scholar El Hajj et al., 2009 M. El Hajj, A. Bégué, S. Guillaume, J.F. Martiné Integrating SPOT-5 time series, crop growth modeling and expert knowledge for monitoring agricultural practices—the case of sugarcane harvest on Reunion Island Remote Sens. Environ., 113 (no. 10) (2009), pp. 2052-2061 View PDFView articleView in ScopusGoogle Scholar Woodcock et al., 2008 C.E. Woodcock, R. Allen, M. Anderson, A. Belward, R. Bindschadler, W. Cohen, F. Gao, S.N. Goward, D. Helder, E. Helmer, R. Nemani, L. Oreopoulos, J. Schott, P.S. Thenkabail, E.F. Vermote, J. Vogelmann, M.a. Wulder, R. Wynne Free access to Landsat imagery Science, 320 (no. 5879) (2008), p. 1011 CrossRefView in ScopusGoogle Scholar Berger et al., 2012 M. Berger, J. Moreno, J. a. Johannessen, P.F. Levelt, R.F. Hanssen ESA’s sentinel missions in support of Earth system science Remote Sens. Environ., 120 (2012), pp. 84-90 View PDFView articleView in ScopusGoogle Scholar Beck et al., 2006 P.S.A. Beck, C. Atzberger, K.A. Høgda, B. Johansen, A.K. Skidmore Improved monitoring of vegetation dynamics at very high latitudes: a new method using MODIS NDVI Remote Sens. Environ., 100 (no. 3) (2006), pp. 321-334 View PDFView articleView in ScopusGoogle Scholar Ju and Roy, 2008 J. Ju, D.P. Roy The availability of cloud-free Landsat ETM+ data over the conterminous United States and globally Remote Sens. Environ., 112 (no. 3) (2008), pp. 1196-1211 View PDFView articleView in ScopusGoogle Scholar Bielski et al., 2007 C. Bielski, J. Grazzini, P. Soille Automated morphological image composition for mosaicing large image data sets International Geoscience and Remote Sensing Symposium (IGARSS) (2007), pp. 4068-4071 View in ScopusGoogle Scholar Roy et al., 2010 D.P. Roy, J. Ju, K. Kline, P.L. Scaramuzza, V. Kovalskyy, M. Hansen, T.R. Loveland, E. Vermote, C. Zhang Web-enabled landsat data (WELD): landsat ETM+ composited mosaics of the conterminous United States Remote Sens. Environ., 114 (no. 1) (2010), pp. 35-49 View PDFView articleView in ScopusGoogle Scholar Eivazi et al., 2015 A. Eivazi, A. Kolesnikov, V. Junttila, T. Kauranne Variance-preserving mosaicing of multiple satellite images for forest parameter estimation: radiometric normalization ISPRS J. Photogramm. Remote Sens., 105 (2015), pp. 120-127 View PDFView articleView in ScopusGoogle Scholar Lei and Siqueira, 2015 Y. Lei, P. Siqueira An automatic mosaicking algorithm for the generation of a large-scale forest height map using spaceborne repeat-Pass InSAR correlation magnitude Remote Sens., 7 (no. 5) (2015), pp. 5639-5659 CrossRefView in ScopusGoogle Scholar Helmer and Ruefenacht, 2005 E.H. Helmer, B. Ruefenacht Cloud-free satellite image mosaics with regression trees and histogram matching Photogramm. Eng. Remote Sens., 71 (9) (2005), pp. 1079-1089 View in ScopusGoogle Scholar Rakwatin et al., 2007 P. Rakwatin, W. Takeuchi, Y. Yasuoka Stripe noise reduction in MODIS data by combining histogram matching with facet filter IEEE Trans. Geosci. Remote Sens., 45 (6) (2007), pp. 1844-1855 View in ScopusGoogle Scholar Shapira et al., 2013 D. Shapira, S. Avidan, Y. Hel-Or Multiple histogram matching, image process. (ICIP), 2013 20th IEEE Int. Conf. (2013), pp. 2269-2273 CrossRefView in ScopusGoogle Scholar Griffiths et al., 2013 P. Griffiths, S. van der Linden, T. Kuemmerle, P. Hostert A pixel-Based landsat compositing algorithm for large area land cover mapping Sel. Top. Appl. Earth Obs. Remote Sens. IEEE J., 99 (2013), pp. 1-14 CrossRefGoogle Scholar Hermosilla et al., 2015a T. Hermosilla, M. a. Wulder, J.C. White, N.C. Coops, G.W. Hobart An integrated Landsat time series protocol for change detection and generation of annual gap-free surface reflectance composites Remote Sens. Environ., 158 (2015), pp. 220-234 View PDFView articleView in ScopusGoogle Scholar Vanonckelen et al., 2015 S. Vanonckelen, S. Lhermitte, A. Van Rompaey The effect of atmospheric and topographic correction on pixel-based image composites: improved forest cover detection in mountain environments Int. J. Appl. Earth Obs. Geoinf, 35 (PB) (2015), pp. 320-328 View PDFView articleView in ScopusGoogle Scholar Zhu et al., 2015a Z. Zhu, C.E. Woodcock, C. Holden, Z. Yang Generating synthetic Landsat images based on all available Landsat data: predicting Landsat surface reflectance at any given time Remote Sens. Environ., 162 (2015), pp. 67-83 View PDFView articleView in ScopusGoogle Scholar Gao et al., 2006 F. Gao, J. Masek, M. Schwaller, F. Hall On the blending of the landsat and MODIS surface reflectance: predicting daily landsat surface reflectance IEEE Trans. Geosci. Remote Sens., 44 (8) (2006), pp. 2207-2218 View in ScopusGoogle Scholar Roy et al., 2008 D.P. Roy, J. Ju, P. Lewis, C. Schaaf, F. Gao, M. Hansen, E. Lindquist Multi-temporal MODIS-Landsat data fusion for relative radiometric normalization, gap filling, and prediction of Landsat data Remote Sens. Environ., 112 (no. 6) (2008), pp. 3112-3130 View PDFView articleView in ScopusGoogle Scholar Hilker et al., 2009 T. Hilker, M.A. Wulder, N.C. Coops, N. Seitz, J.C. White, F. Gao, J.G. Masek, G. Stenhouse Generation of dense time series synthetic Landsat data through data blending with MODIS using a spatial and temporal adaptive reflectance fusion model Remote Sens. Environ., 113 (no. 9) (2009), pp. 1988-1999 View PDFView articleView in ScopusGoogle Scholar Zhang et al., 2013 W. Zhang, A. Li, H. Jin, J. Bian, Z. Zhang, G. Lei, Z. Qin, C. Huang An enhanced spatial and temporal data fusion model for fusing landsat and modis surface reflectance to generate high temporal landsat-like data Remote Sens., 5 (no. 10) (2013), pp. 5346-5368 CrossRefView in ScopusGoogle Scholar Bisquert et al., 2015 M. Bisquert, G. Bordogna, A. Bégué, G. Candiani, M. Teisseire, P. Poncelet A simple fusion method for image time series based on the estimation of image temporal validity Remote Sens., 7 (no. 1) (2015), pp. 704-724 CrossRefView in ScopusGoogle Scholar Gevaert and García-haro, 2015 C.M. Gevaert, F.J. García-haro Remote Sensing of Environment A comparison of STARFM and an unmixing-based algorithm for Landsat and MODIS data fusion Remote Sens. Environ., 156 (2015), pp. 34-44 View PDFView articleView in ScopusGoogle Scholar Xu et al., 2015 L. Xu, B. Li, Y. Yuan, X. Gao, T. Zhang A temporal-spatial iteration method to reconstruct NDVI time series datasets Remote Sens., 7 (no. 7) (2015), pp. 8906-8924 CrossRefView in ScopusGoogle Scholar Malambo and Heatwole, 2016 L. Malambo, C.D. Heatwole A multitemporal profile-based interpolation method for gap filling nonstationary data IEEE Trans. Geosci. Remote Sens., 54 (1) (2016), pp. 252-261 View in ScopusGoogle Scholar Shen et al., 2015 H. Shen, X. Li, Q. Cheng, C. Zeng, G. Yang, H. Li, L. Zhang Missing information reconstruction of remote sensing data: a technical review IEEE Geosci. Remote Sens. Mag., 3 (no. 3) (2015), pp. 61-85 View in ScopusGoogle Scholar Zhu et al., 2015b Z. Zhu, S. Wang, C.E. Woodcock Improvement and expansion of the Fmask algorithm: cloud, cloud shadow, and snow detection for Landsats 4–7, 8, and Sentinel 2 images Remote Sens. Environ., 159 (2015), pp. 269-277 View PDFView articleView in ScopusGoogle Scholar Eilers, 2003 P.H.C. Eilers A perfect smoother Anal. Chem., 75 (no. 14) (2003), pp. 3631-3636 View in ScopusGoogle Scholar Atzberger and Eilers, 2011 C. Atzberger, P.H.C. Eilers A time series for monitoring vegetation activity and phenology at 10-daily time steps covering large parts of South America Int. J. Digit. Earth, 4 (5) (2011), pp. 365-386 CrossRefView in ScopusGoogle Scholar European Environment Agency, 2006 European Environment Agency, CORINE Land Cover, 2006. Google Scholar Hermosilla et al., 2015b T. Hermosilla, M.a. Wulder, J.C. White, N.C. Coops, G.W. Hobart An integrated Landsat time series protocol for change detection and generation of annual gap-free surface reflectance composites Remote Sens. Environ., 158 (2015), pp. 220-234 View PDFView articleView in ScopusGoogle Scholar Immitzer et al., 2015 M. Immitzer, K. Einzmann, S. Böck, M. Mattiuzzi, W.-T. Ng, A. Wallner, N. Pinnel, A. Reichmuth, M. Frost, A. Müller, R. Seitz, C. Atzberger Erstellung von Fichten- und Kiefernanteilskarten auf Basis von Satellitendaten für Bayern Forstl. Forschungsberichte München, 214 (2015), pp. 19-32 Google Scholar Masek et al., 2006 J.G. Masek, E.F. Vermote, N.E. Saleous, R. Wolfe, F.G. Hall, K.F. Huemmrich, F. Gao, J. Kutler, T.K. Lim A landsat surface reflectance dataset for North America, 1990–2000 IEEE Geosci. Remote Sens. Lett., 3 (no. 1) (2006), pp. 68-72 View in ScopusGoogle Scholar Vermote et al., 2015 E. Vermote, C. Justice, M. Claverie, B. Franch Preliminary analysis of the performance of the Landsat 8/OLI land surface reflectance product Remote Sens. Environ. (2015) Google Scholar Roy et al., 2015 D.P. Roy, V. Kovalskyy, H.K. Zhang, E.F. Vermote, L. Yan, S.S. Kumar, A. Egorov Characterization of Landsat-7 to Landsat-8 reflective wavelength and normalized difference vegetation index continuity Remote Sens. Environ. (2015), pp. 0-13 CrossRefGoogle Scholar Maiersperger et al., 2013 T.K. Maiersperger, P.L. Scaramuzza, L. Leigh, S. Shrestha, K.P. Gallo, C.B. Jenkerson, J.L. Dwyer Characterizing LEDAPS surface reflectance products by comparisons with AERONET, field spectrometer, and MODIS data Remote Sens. Environ., 136 (2013), pp. 1-13 View PDFView articleView in ScopusGoogle Scholar Ju et al., 2012 J. Ju, D.P. Roy, E. Vermote, J. Masek, V. Kovalskyy Continental-scale validation of MODIS-based and LEDAPS Landsat ETM+ atmospheric correction methods Remote Sens. Environ., 122 (2012), pp. 175-184 View PDFView articleView in ScopusGoogle Scholar Feng et al., 2013 M. Feng, J.O. Sexton, C. Huang, J.G. Masek, E.F. Vermote, F. Gao, R. Narasimhan, S. Channan, R.E. Wolfe, J.R. Townshend Global surface reflectance products from Landsat: assessment using coincident MODIS observations Remote Sens. Environ., 134 (2013), pp. 276-293 View PDFView articleView in ScopusGoogle Scholar Vuolo et al., 2015b F. Vuolo, M. Mattiuzzi, C. Atzberger Comparison of the Landsat Surface Reflectance Climate Data Record (CDR) and manually atmospherically corrected data in a semi-arid European study area Int. J. Appl. Earth Obs. Geoinf., 42 (2015), pp. 1-10 View PDFView articleView in ScopusGoogle Scholar Kottek et al., 2006 M. Kottek, J. Grieser, C. Beck, B. Rudolf, F. Rubel World Map of the Köppen-Geiger climate classification updated Meteorol. Zeitschrift, 15 (June (3)) (2006), pp. 259-263 CrossRefView in ScopusGoogle Scholar Immitzer et al., 2016 M. Immitzer, F. Vuolo, C. Atzberger First experience with sentinel-2 data for crop and tree species classifications in central europe Remote Sens., 8 (no. 3) (2016), p. 166 CrossRefView in ScopusGoogle Scholar White et al., 2014 J.C. White, M.A. Wulder, G.W. Hobart, J.E. Luther, T. Hermosilla, P. Griffiths, N.C. Coops, R.J. Hall, P. Hostert, A. Dyk, L. Guindon Pixel-based image compositing for large-area dense time series applications and science Can. J. Remote Sens., 40 (3) (2014), pp. 192-212 CrossRefView in ScopusGoogle Scholar Vuolo, 2016 F. Vuolo Example Data: Smoothing and Gap-filling of High Resolution Multi-spectral Time Series: Example of Landsat Data (2016) Available: https://data.mendeley.com/datasets/8nj4fs9yx4/1 [Accessed: 05-Dec-2016] Google Scholar Cited by (62) Instability of remote sensing ecological index and its optimisation for time frequency and scale 2022, Ecological Informatics Show abstract Time-frequency optimization of RSEI: A case study of Yangtze River Basin 2022, Ecological Indicators Show abstract Reconstruction of Sentinel-2 derived time series using robust Gaussian mixture models — Application to the detection of anomalous crop development 2022, Computers and Electronics in Agriculture Show abstract Analysis of surface urban heat islands based on local climate zones via spatiotemporally enhanced land surface temperature 2022, Remote Sensing of Environment Show abstract Recurrent-based regression of Sentinel time series for continuous vegetation monitoring 2021, Remote Sensing of Environment Show abstract Reviews and syntheses: Remotely sensed optical time series for monitoring vegetation productivity 2024, Biogeosciences View all citing articles on Scopus View Abstract © 2016 Elsevier B.V. All rights reserved. Recommended articles Quantifying mangrove chlorophyll from high spatial resolution imagery ISPRS Journal of Photogrammetry and Remote Sensing, Volume 108, 2015, pp. 234-244 Muditha K. Heenkenda, …, Sytze de Bruin View PDF Mapping leaf chlorophyll content from Sentinel-2 and RapidEye data in spruce stands using the invertible forest reflectance model International Journal of Applied Earth Observation and Geoinformation, Volume 79, 2019, pp. 58-70 Roshanak Darvishzadeh, …, Marc Paganini View PDF Quantifying vegetation biophysical variables from the Sentinel-3/FLEX tandem mission: Evaluation of the synergy of OLCI and FLORIS data sources Remote Sensing of Environment, Volume 251, 2020, Article 112101 Charlotte De Grave, …, José Moreno View PDF Show 3 more articles Article Metrics Citations Citation Indexes: 61 Policy Citations: 1 Captures Readers: 113 Social Media Shares, Likes & Comments: 2 View details About ScienceDirect Remote access Shopping cart Advertise Contact and support Terms and conditions Privacy policy Cookies are used by this site. Cookie settings | Your Privacy Choices All content on this site: Copyright © 2024 Elsevier B.V., its licensors, and contributors. All rights are reserved, including those for text and data mining, AI training, and similar technologies. For all open access content, the Creative Commons licensing terms apply.\"",
        "analysis": "",
        "verbatim_quote1": "",
        "verbatim_quote2": "",
        "verbatim_quote3": "",
        "relevance_score1": 0,
        "relevance_score2": 0,
        "limitations": "",
        "inline_citation": "",
        "full_citation": ""
    }
]