"[\n  {\n    \"DOI\": \"https://doi.org/10.1109/access.2019.2949703\",\n    \"authors\": [\n      \"Muhammad Shoaib Farooq\",\n      \"Shamyla Riaz\",\n      \"Adnan Abid\",\n      \"Kamran Abid\",\n      \"Muhammad Naeem\"\n    ],\n    \"citation_count\": 441,\n    \"full_citation\": \"\",\n    \"full_text\": \"\\\"This website utilizes technologies such as cookies to enable essential site functionality, as well as for analytics, personalization, and targeted advertising purposes. To learn more, view the following link: Privacy Policy Manage Preferences Loading [MathJax]/extensions/MathZoom.js IEEE.org IEEE Xplore IEEE SA IEEE Spectrum More Sites Donate Cart Create Account Personal Sign In Browse My Settings Help Access provided by: University of Nebraska - Lincoln Sign Out All Books Conferences Courses Journals & Magazines Standards Authors Citations ADVANCED SEARCH Journals & Magazines >IEEE Access >Volume: 7 A Survey on the Role of IoT in Agriculture for the Implementation of Smart Farming Publisher: IEEE Cite This PDF Muhammad Shoaib Farooq; Shamyla Riaz; Adnan Abid; Kamran Abid; Muhammad Azhar Naeem All Authors 442 Cites in Papers 48545 Full Text Views Open Access Comment(s) Under a Creative Commons License Abstract Document Sections I. Introduction II. Major Components and Relevant Technologies for IoT Based Smart Farming III. IoT Agricultural Networks IV. IoT Agriculture Applications V. IoT Agricultural Security Show Full Outline Authors Figures References Citations Keywords Metrics Abstract: Internet of things (IoT) is a promising technology which provides efficient and reliable solutions towards the modernization of several domains. IoT based solutions are being developed to automatically maintain and monitor agricultural farms with minimal human involvement. The article presents many aspects of technologies involved in the domain of IoT in agriculture. It explains the major components of IoT based smart farming. A rigorous discussion on network technologies used in IoT based agriculture has been presented, that involves network architecture and layers, network topologies used, and protocols. Furthermore, the connection of IoT based agriculture systems with relevant technologies including cloud computing, big data storage and analytics has also been presented. In addition, security issues in IoT agriculture have been highlighted. A list of smart phone based and sensor based applications developed for different aspects of farm management has also been presented. Lastly, the regulations and policies made by several countries to standardize IoT based agriculture have been presented along with few available success stories. In the end, some open research issues and challenges in IoT agriculture field have been presented. Topic: New Technologies for Smart Farming 4.0: Research Challenges and Opportunities IOT Agricultural Trends. Published in: IEEE Access ( Volume: 7) Page(s): 156237 - 156271 Date of Publication: 25 October 2019 Electronic ISSN: 2169-3536 DOI: 10.1109/ACCESS.2019.2949703 Publisher: IEEE Authors Figures References Citations Keywords Metrics More Like This Smart Monitoring Agriculture Based on Internet of Things 2018 2nd East Indonesia Conference on Computer and Information Technology (EIConCIT) Published: 2018 Monitoring of Soil Moisture and Atmospheric Sensors with Internet of Things (IoT) Applied in Precision Agriculture 2020 XIV Technologies Applied to Electronics Teaching Conference (TAEE) Published: 2020 Show More IEEE Personal Account CHANGE USERNAME/PASSWORD Purchase Details PAYMENT OPTIONS VIEW PURCHASED DOCUMENTS Profile Information COMMUNICATIONS PREFERENCES PROFESSION AND EDUCATION TECHNICAL INTERESTS Need Help? US & CANADA: +1 800 678 4333 WORLDWIDE: +1 732 981 0060 CONTACT & SUPPORT Follow About IEEE Xplore | Contact Us | Help | Accessibility | Terms of Use | Nondiscrimination Policy | IEEE Ethics Reporting | Sitemap | IEEE Privacy Policy A not-for-profit organization, IEEE is the world's largest technical professional organization dedicated to advancing technology for the benefit of humanity. \\u00a9 Copyright 2024 IEEE - All rights reserved.\\\"\",\n    \"analysis\": \"\",\n    \"verbatim_quote1\": \"\",\n    \"verbatim_quote2\": \"\",\n    \"verbatim_quote3\": \"\",\n    \"relevance_score1\": 0,\n    \"relevance_score2\": 0,\n    \"limitations\": \"\",\n    \"inline_citation\": \"\",\n    \"journal\": \"IEEE Access\",\n    \"pdf_link\": \"https://ieeexplore.ieee.org/ielx7/6287639/8600701/08883163.pdf\",\n    \"publication_year\": 2019,\n    \"title\": \"A Survey on the Role of IoT in Agriculture for the Implementation of Smart Farming\"\n  }\n]"