"[\n  {\n    \"DOI\": \"https://doi.org/10.1109/access.2019.2949703\",\n    \"authors\": [\n      \"Muhammad Shoaib Farooq\",\n      \"Shamyla Riaz\",\n      \"Adnan Abid\",\n      \"Kamran Abid\",\n      \"Muhammad Naeem\"\n    ],\n    \"citation_count\": 441,\n    \"full_citation\": \"\",\n    \"full_text\": \"\\\"This website utilizes technologies such as cookies to enable essential site functionality, as well as for analytics, personalization, and targeted advertising purposes. To learn more, view the following link: Privacy Policy Manage Preferences IEEE.org IEEE Xplore IEEE SA IEEE Spectrum More Sites Donate Cart Create Account Personal Sign In Browse My Settings Help Access provided by: University of Nebraska - Lincoln Sign Out All Books Conferences Courses Journals & Magazines Standards Authors Citations ADVANCED SEARCH Journals & Magazines >IEEE Access >Volume: 7 A Survey on the Role of IoT in Agriculture for the Implementation of Smart Farming Publisher: IEEE Cite This PDF Muhammad Shoaib Farooq; Shamyla Riaz; Adnan Abid; Kamran Abid; Muhammad Azhar Naeem All Authors 442 Cites in Papers 48545 Full Text Views Open Access Comment(s) Under a Creative Commons License Abstract Document Sections I. Introduction II. Major Components and Relevant Technologies for IoT Based Smart Farming III. IoT Agricultural Networks IV. IoT Agriculture Applications V. IoT Agricultural Security Show Full Outline Authors Figures References Citations Keywords Metrics Abstract: Internet of things (IoT) is a promising technology which provides efficient and reliable solutions towards the modernization of several domains. IoT based solutions are being developed to automatically maintain and monitor agricultural farms with minimal human involvement. The article presents many aspects of technologies involved in the domain of IoT in agriculture. It explains the major components of IoT based smart farming. A rigorous discussion on network technologies used in IoT based agriculture has been presented, that involves network architecture and layers, network topologies used, and protocols. Furthermore, the connection of IoT based agriculture systems with relevant technologies including cloud computing, big data storage and analytics has also been presented. In addition, security issues in IoT agriculture have been highlighted. A list of smart phone based and sensor based applications developed for different aspects of farm management has also been presented. Lastly, the regulations and policies made by several countries to standardize IoT based agriculture have been presented along with few available success stories. In the end, some open research issues and challenges in IoT agriculture field have been presented. Topic: New Technologies for Smart Farming 4.0: Research Challenges and Opportunities IOT Agricultural Trends. Published in: IEEE Access ( Volume: 7) Page(s): 156237 - 156271 Date of Publication: 25 October 2019 Electronic ISSN: 2169-3536 DOI: 10.1109/ACCESS.2019.2949703 Publisher: IEEE CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation. SECTION I. Introduction The concept of IoT caught attention in 1999, by means of Auto-ID center at MIT and its relevant market investigation publications. Basically, IoT is an integration of multiple devices which communicate, sense and interact with their internal and external states through the embedded technology that IoT contain [1]. IoT has become the megatrend for next generation technologies which can impact the whole business spectrum with extended benefits which are advanced connectivity of end devices, system and services. IoT offers appropriate solutions for multiple applications such as smart health care, smart cities, security, retail, traffic congestion industrial control and agriculture [3]. A significant amount of work has been done regarding IoT technology in agricultural area to develop smart farming solutions [4]. IoT has brought a great revolution in agriculture environment by examining multiple complications and challenges in farming [5]. Now a days, with the advancement of technology it has been expected that by using IoT agriculturalists and technologists are finding out the solution of those problems which farmer are facing such as shortages of water, cost management and productivity issues [6], [7]. State-of-the-art IoT technologies have detected all these issues and provide solutions to increase productivity while lowering the cost. Efforts made on wireless sensors networks enable us to collect data from sensing devices and send it to the main servers [8]. Data collected through sensors gives information about different environmental condition to monitor the whole system properly. Monitoring the environmental conditions or crop productivity is not only the factor for the evaluation of crop but there are many other factors which effect the crops\\u2019 productivity, e.g. field management, soil and crop monitoring, movement of an unwanted object, attacks of wild animals, and thefts etc. [9], [10]. Moreover, IoT provides a well-organized scheduling of restricted resources which makes sure that the best use of IoT enhances the productivity. Figure 1 shows a schematic diagram showing the agricultural trends which provide easy and cost effective interactions through a secure and unblemished connectivity across individual Greenhouse, Livestock, Farmer, and Field monitoring. Whereby, the IoT agricultural networks using the wireless devices enable real time crop and animal monitoring. The figure shows that two sensor kits (Libelium Smart Agriculture Xtreme IoT Vertical Kit and Crop/Plant Monitoring Sensor Kit) have been implemented which monitor the soil moisture, leaf wetness, temperature, humidity, productivity, and air flow. While, MooMonitor sensor monitors the animal health, fertility, feeding, ruminating and resting. The agricultural servers, gateways, and agriculture database play an important role to store agriculture records and provide on demand agricultural services to authorized users. FIGURE 1. Agricultural trends. Show All As a whole, in agriculture field there are multiple applications, protocols and prototypes. IoT agriculture research trends include network platform, network architecture, applications, security, and challenges among others [28]\\u2013[30]. Moreover, in many countries and organizations over globe different IoT policies and guidelines have been implemented in agriculture field. However in IoT agricultural environment a reasonable amount of work has been done and there is a need of thorough study on IoT in agriculture context to understand the current research status. To transform agriculture technologies via IoT innovation this paper analyzes various issues and trends in IoT smart farming. In this research as a contribution following IoT agricultural techniques have been added from literature: Present major components of IoT based smart farming along with relevant technologies in Section II. Section III presents a rigorous discussion on network architecture of IoT that involves network architecture and layers, network topologies used; and devices and protocols used in agriculture IoT. Different application domains and relevant smart phone and sensor based applications have been discussed in Section IV. The security and privacy issues in IoT based agriculture have been discussed in Section V. The industrial trends have been discussed in Section VI that provides the details related to top technology industries investing in this area. The IoT agricultural policies made by different countries for the standardization of IoT based agriculture have been discussed in Section VII. This section also presents few success stories in this area. Lastly, the open issues and challenges to improve IoT based agricultural technologies from many aspects have been presented in Section VIII. SECTION II. Major Components and Relevant Technologies for IoT Based Smart Farming A. Major Components of IoT Based Smart Farming IoT based smart farming consist of four major components as shown in Figure 2. FIGURE 2. Major components of IoT based smart farming. Show All These four major components are physical structure, data acquisition, data processing, and data analytics. The physical structure is the most important factor for precision agriculture to avoid any unwanted happening. Whole system is designed in such a way which controls the sensors, actuators, and devices. A sensor performs multiple tasks like soil sensing, temperature sensing, weather sensing, light sensing, and moisture sensing. Similarly devices perform many control functions like, node discovery, device identification and naming services etc. All these functions are performed by any device or sensor which is controlled through a microcontroller. This controlling operation is performed by any remote device or a computer which is connected through the Internet. Data Acquisition is further divided into two sub components namely: IoT data acquisition and standard data acquisition. Whereby, the IoT data acquisition component consists of seven protocols that are Message Queuing Telemetry Transport (MQTT), Websocket, Advanced Message Queuing Protocol (AMQP), Node, Constrained Application Protocol (CoAP), Data Distribution Service (DDS), and Hyper Text Transfer Protocol (HTTP). Depending on the requirements and condition more protocols can be used for the implementation of smart farming. Whereas, in the standard data acquisition ZigBee, WIFI, Long Range Wide Area Network (LoraWan), SigFox and ISOBUS protocols have been used. Data processing consists of multiple features that are image or video processing, data loading, decision support system, and data mining as shown in Figure 2. According to the system requirements any feature may be added that may work in parallel to provide other services. Data analytics consists of two main features that are monitoring and controlling. Monitoring involves three main application in smart agriculture that are Live Stock Monitoring, Field Monitoring, and Green house Monitoring. IoT enables farmers to monitor livestock via multiple sensors which are used to monitor different animal\\u2019s diseases like temperature, heart rate, and digestion etc [11]. Whereas field monitoring applications intend to report different conditions of field like soil richness, temperature, humidity, gas, pressure (air pressure and water pressure), and crop disease monitoring [12], [13]. A smart greenhouse design eliminates the manual intervention and measures different climate parameters by intelligent IoT devices and sensors according to plants requirements [14]\\u2013[16]. B. Iotagricultural Relevant Technologies A Large number of technologies are being used in IoT agricultural solutions due to which it is hard to make an explicit of all those due to which our discussion focused on several core technologies which have played a vital role to modernize the IoT agricultural services. 1) Cloud and Edge Computing Collaboration of IoT and cloud computing in agriculture provides pervasive access to shared resources. To meet various agricultural needs upon request over network and execute operations cloud computing plays vital role [17]. Cloud based software architecture has been proposed which process and retrieve information and agricultural tasks in a more accurate way [18], [19]. In the field of IoT edge computing is considered as a solution to facilitate data processing at the source of data generation which are sensors, actuators and many other embedded devices. Edge computing or fog computing are measured as the backbone of cloud computing. This technology is deployed according to the features and requirements of smart farming [20]. 2) Big Data Analytics and Machine Learning Big data consist of a large amount of essential which are generated by agricultural sensors. Big data analysis provides different and efficient crop monitoring methods at different stages [21]. A good systematic review on big data analysis in agriculture has been presented [22]. Neural networks are very famous because they provide optimal solutions at a very high speed. Intrusion detection has been realized by using advance principles and technology of neural network. On the other hand most important feature of neural network is that they provide detection module and data training [23]. By using deep neural networks an IoT based hydroponic system has been developed [24]. 3) Communication Networks and Protocols IoT agricultural network consist of different kinds of long ranges and short ranges networks for communications. Several IoT networks technologies help to design a crop or field monitoring sensors and devices [25]. Communication protocols are the backbone of IoT agricultural network system and applications [26]. They are used to exchange all agricultural data or information over the network. 4) Robotics Multiple Agribots have been developed for the purpose of smart farming which are minimizing the amount of farmers by increasing the speed of work through advance techniques. Agribots performs elementary functions like weeding, spraying and sowing etc. All these robots are controlled by using IoT to increase the crop productivity and efficient resource utilization. A multi sensor robotics approach has been proposed for characterization and ground mapping [27]. SECTION III. IoT Agricultural Networks IoT agricultural network or IoT network for agriculture is one of the vital elements of IoT in agriculture. It helps to monitor agriculture data and facilitate the transmission and reception of agriculture data. As shown in Figure 3, the framework consists of IoT agricultural network architecture, IoT agricultural network platform and IoT agricultural network topologies and protocols. FIGURE 3. IoT agricultural network. Show All A. IoT Agricultural Neworkt Architecture The IoT agricultural network is the main factor of IoT in agriculture field [31]. IoT Agricultural network architecture suggests an outline for the specification of an IoT agricultural network physical elements as well as their working principles, and techniques. Most of the IoT applications usually follow the four layer architecture (Network Layer, Application layer, Physical and Mac Layer and Transport Layer) due to the popularity and interoperability of IP as suggested by Naik [32]. After reviewing these four layers protocol we have also survey two more approaches that are IPv6 and 6LoWPAN as shown in Figure 4. This layer is the final level of abstraction which allows the development of multiple user applications. At this layer deployed communication protocols monitor different agricultural parameters such as weather information, soil moisture values, irrigation monitoring etc. FIGURE 4. Layer structure of the 6LoWPAN. Show All 1) Application Layer Due to the energy constraints and stringent computation involved by the IoT devices there are many lightweight protocols on application layer such as CoAP, MQTT, AMQP, and HTTP. These protocols can be increased or decreased according to the system requirement. CoAP protocol runs on UDP and works on the principle of request or response architecture [33]. AMQP protocol runs over the TCP protocol by following publish/subscribe architecture asynchronously and use TSL/SSL for security assurance. MQTT is a bandwidth-efficient protocol which uses little battery power and designed for receiving and transmitting sensor information [34]. HTTP is a well known web messaging protocol which based on the request/response architecture [35]. Runs over TCP and does not define any QoS, uses TSL/SSL for security purpose. 2) Transport Layer This layer is also called host to host transport layer, and is directly transferred from IP to IoT domain. The main task of network layer is to collect and encapsulate the agricultural information which is obtained through sensor layer. There are two protocols that are transmission control protocol (TCP) and user datagram protocol (UDP). TCP is a connection oriented protocol which ensures the reliability of delivered data. TCP data transmission speed is low as compare to UDP. UDP is a connection less protocol which does not ensure reliability of data. Its data transmission speed is high as compared to TCP. Both of these protocols are used in different applications because their choices depend upon the requirements of application. 3) Network Layer This layer is an indispensable technology for precision farming and responsible to transmit agricultural information at application layer. IP is the major choice with the existing two versions that are IPv4 and IPv6. IPv4 came into existence due to increasing the large number of addressable devices. Whereas, invention of IPv6 was expected which gradually establish on all networking devices. Routing protocol for Low Power and Lossy Networks (RPL) is considered as the main protocol while applying routing on 6LoWPAN [36]. RPL consist of distance vector routing protocol which uses Destination Oriented Directed Acyclic Graphs (DODAG) to specify routes. To support different flows of traffic RPL modify itself according to network speed and acknowledge routing metrics such as status of the battery used in device, link quality, and higher computational cost exchange. 4) Adaptation Layer Adaptation Layer (AL) aim is to ensure the interoperability, and implement fragmentation, compression and reassembly mechanism. Although AL attained many advances but still there is a complexity for IPv6 supporting because its direct use on IoT devices is not considered reasonable. Usually clashes were seen with constraints which are associated with IoT devices. That\\u2019s why, 6LoWPAN made a big effort in order to decrease the limitations of IPv6 and make it suitable for IoT devices. Sensors and devices use IPv6 and 6LoWPAN to transmit data over IEEE 802.15.4 protocol in IoT agricultural network. 5) Physical and Mac Layers This is the bottom most layer in agriculture network archichture which is responsible to sense and actuate different agricultural parametrs. Within physical and MAC layer IEEE 802.15.4 is one of the most popular standard which was designed for low cost, low consumption and low complexity [37]. This standard was adopted by many protocols like Wireless HART, ZigBee and ISA100. IEEE802.15.4 mainly operates in ISM band of 2.4 GHz. Furthermore, it also operate 915 MHz (in United Nations of American) 868 MHz (in European countries) and supports up to 250 kbps data rates. However literature shows some significant limitation of later approaches, which are regarding to mobility and network formation [38]. EPC-Global (designed for RFID technologies) [39] and Z-wave (particularly designed for domotics) [40] have also been used as alternative of IEEE 802.15.4 to exchange information directly from internt protocol (IP). B. IoT Agricultural Network Platform IoT agricultural network platform refers to both the big data analytics model and cloud model. 1) Big Data Analytics Big data analysis applied to find out the required and meaningful information from the large amount of data from different data formates. The crop disease control and crop growth models build on the basis of farm data. Big data analysis also provides decision support services to farmers for crop productivity and optimal cost analysis. Figure 5 shows IoT agricultural network platform based on big data analytics. The proposed network platform consists of six components namely: i) Farmer/User experience, ii) Big Data analysis, iii) Sensing and monitoring, iv) Storage services, v) Communication protocols, and vi) Physical implementations. This platform provides access to the IoT backbone, and helps collecting information about soil fertility, weather conditioning, moisturization, and online crop monitoring etc. FIGURE 5. IoT agricultural network platform based on big data analysis. Show All a: Farmer Experience Farmer experience layer is designed to help the farmers to monitor crop productivity in multiple ways such as, for effective growth of crops farmers are awared by identifying the appropriateness of fertile selection. Climate conditions, crops growth conditions, soil quality, or cattle health monitoring helps the farmers to track the state of their business and mitigate the lower production risks. b: Predictive Analysis This analysis makes the whole environment smarter by the combination of smart farming market intelligence and IoT technology. The major task of predictive analysis is to analyze, explore and process the agricultural information for digital awareness. Predictive analysis is made to check the probabilistic chance of crop productivity up to the next season. Here different detecting devices are applied to check the, Crop disease, weather conditions, and estimate the profit/loss on the basis of crop productivity. Predictive analysis facilitates the farm to understand the optimal time for planting & harvesting and various farm management techniques. c: Multicultural Analysis Elaborates the multiple forms of agriculture. In this analysis big data analysis minimize the risk of crop destruction according to scientific ways. To enhance the growth rate of water featured Botanic Aquaculture layer is equipped with big data. Other multicultural techniques like Citriculture, Horticulture and Floriculture avail direct benefits when enabled with big data analysis. It is helpful for decision making related to crop or plants seasonal growth, and pest control. Vermiculture is used for the cultivation of earthworms. Arboriculture is basically used for the cultivation of woody plants. Olericulture is an application which is used for the prediction and measure the growth rate of different vegetables. d: Sensing and Monitoring Sensing and monitoring analysis is made by applying different sensing and monitoring devices. Sensors sense data and store the crop disease information. Data which is processed through multiple resources is automatically achieved by sensing layer. Ststistical analysis has been made on data received from sensors in order to actuate the disease. Farmers obtain necessary information such as ph value, temperature, soil moisture and humidity through web and message service. Real time image and video monitoring on data helps the farmer to gat timely and accurate information. e: Communication Protocols Communication protocols collect and encapsulate agricultural data. To process and transmit data by using these protocols have been considered as the nerve center of IoT in agriculture. These protocols consist of internet related technologies like WIFI, LoraWan and Code Division Multiple Access (CDMA) technologies. ZigBee is considered as the main enabler for communication over long distances when third party service providers such as Long-Term Evolution (LTE), CDMA or Global System for Mobile (GSM) are not available. f: Storage Services Farmers\\u2019 store crop related information to make better analysis in future and use stored information in multiple seasons for more productivity. g: Physical Implementations Multiple sensors, different types of actuators and microcontrollers are implemented physically to monitore different agricultural applications. Many other network equipments also implemented at physical layer like switches, routers and gateways are included. At this layer whole environmental conditions are sensed and then actuate according to a predefined instructions. Microcontroller plays the supervisor role and performs networking related operations and some other functionality which are done by sensors and actuators. An IoT based functional frame work is shown in figure 6. The functional framework shows that how agriculturists and farmers can access multiple databases with the assistance of support layer from application layer. Business layer contains all necessary operation which are important for any IoT farm. Data acquisition layer provides connection with session layer through IoT protocols like MQTT, AMQP and COAP etc. FIGURE 6. Functional framework for an agricultural information service model. Show All 2) Cloud Infrastructure Cloud provides a large amount of storage through large virtualized servers which are connected together to perform necessary action. A cloud based IoT design has been presented in [41] for precision farming. In which IoT techniques are applied to analyze and manage data from farms through sensors and devices to generate information for decision making. Design recommendations for IoT agricultural network on the basis of Cloud is shown in Figure 7. FIGURE 7. IoT agricultural network platform based on cloud. Show All Platform has been proposed on the basis of four layers which are Cloud Storage, Gateway, Fog Computing and hardware modules. Cloud storage layer centerlized the all agricultural related data such as weather related, soil, fertilization, crop and agricultural marketing in the cloud and provides on demand resources through networked infrastructure. Analyics resources and web services are also installed on cloud or internet which are accessible by cloud services. Most of the devices or sensors are not designed in such a way which can connect with internet for the purpose of data sharing. To resolve this data sharing problem local gateways are designed which act as bridge between all hardware devices and sensors for connectivity, security and controllability. Implementation of gateway in greenhouse or field improves the ability of automation and control the real time greenhouse monitoring system. Hardware modules and cloud services are distributed whereas resources are integrated through fog computing. Fog computing reduces the computational load of cloud and ensures the real time processing. Basic purpose of fog computing in this proposed network platform is to leverage the on demand scalability of cloud computing resources by taking the advantage of both cloud and edge computing. In hardware modules multiple actuators, sensors, microcontrollers and central processing unit have been implemented to monitor and sense various agricultural variables. Hardware modules are distributed in global or local networks and used to create services or processes. For the implementation of smart farming fast response time and capability to exchange information is necessary. Both of these requirements (fast response time and capability to exchange information) are fulfilled by two protocols that are Representational State Transfer (REST) and Message Queuing Telemetry Transport (MQTT). Instead of using big data center distributed system is more effective for smart farming because it breaks up large computation into easy and smaller tasks like: Crop, Temperature, nutrients, energy, climate, moisture of soil etc. C. IoT Agricultural Network Topology and Protocols IoT agricultural network topology shows the arrangement of multiple elements of an IoT Agricultural network and represents an ideal scenario for smart farming. Figure 8 described how heterogeneous computing grid collects necessary sensor data by using multiple sensing devices such as moisture sensor, humidity sensor, temperature sensor, gas sensor, ph sensor, ultra violet sensor etc and forms an IoT agricultural network topology. FIGURE 8. Conceptual illustration of IoT-based ubiquitous agricultural solutions. Show All This ubiquitous Agricultural solution transforms the storage capacity of multiple electronic devices like Smartphone, Laptops, and agricultural terminals into hybrid computing grids. Figure 9 visualize a scenario in which multiple crop parameters are monitored by implementing agricultural devices and sensors in all over the field. FIGURE 9. Farm remote monitoring in agriculture. Show All Sensed data is then analyzed and stored, and stored data from multiple sensors and devices becomes useful for aggregation. On the basis of aggregation and analysis agriculturists/farmer can monitor the different crop variables in all over the field from anywhere. Moreover, topology consists of a proper network configuration for the streaming of agricultural videos. For example figure 9 support the streaming of pests via an interconnected network with an internet protocol (IP), GSM, WiMAX and access service network gateway. 1) Low Power WSN Topology Figure 10 shows a topology in which low power wireless sensor network has been designed to monitor and control the various farming factors. In this topology ZigBee is being used for data transmission which consists of multiple end devices and router to propagate the information on larger distances. End devices which are scattered in the field consist of different kind of sensors such as temperature, gas, humidity, soil, Motion detector, PH, UV, PIR sensors and a microcontroller. FIGURE 10. Low power WSN topology. Show All End devices are directly connected to the router and controller, where controller communicates with base station by using serial port to analyze the received information. According to software monitoring perspective each end device is properly initialized and attached sensors are activated in an appropriate way. Once the sensors are activated then each device follows the router to connect in the same way according to which they have been designed. After confirmation end device may connect to the WSN by using identical key. Data which is collected through sensors is send to the base station which takes analysis on received data. When the sensors attached with end devices are being read then data is transmitted via ZigBee to the Controller or router. Major advantage of this net topology is its bi-directional communication by using ZigBee. 2) IoT Protocols for Agriculture There are many IoT communication protocols which are widely used in agriculture for the purpose of smart farming. By using these protocols farmers can communicate in a more convenient way and make more efficient decisions for smart farming to enhance and monitor the growth of crop. Most common wireless protocols which are being used named: IEEE 802.11 WIFI, 2G/3G/4 G-Mobile Communications Standards, LoraWan, WiMax, Low Rate Wireless Personal Area Networks, Bluetooth, RFID, and ZigBee. Comparison of all these wireless protocols is given in Table 1. TABLE 1 Comparison of Existing Wireless Protocols a: IEEE 802.11 WiFi IEEE 802.11 is a compilation of communication standards Wireless Local Area Network that is 802.11a, 802.11b, 802.11g, 802.11n and 802.11ac. All these standards operate in different bandwidths that are 5 GHz, 2.2GHz, 2.4/5 GHz, 60 GHz and 5 GHz. Data transfer range of these standards is from 1Mb/s to 7 Gb/s. Its communication range is from 20 m to 100 m [42]. A wifi based wireless sensor network in IoT has been discussed for smart agriculture [43]. b: LoraWan LoraWan is a long range communication protocol which is developed by an open and non-profit association namely Lora TM Alliance. The main purpose of this LoraWan protocol is to assure the interoperability between multiple operators [44]. To improve agricultural productivity and anticipate the problems a framework has been presented in [45] whose component based on Lora and ARIMA technology. c: WiMax Data transfer range of Worldwide Interoperability for microwave access is from 1.5 Mb/s to 1 Gb/s. But now a days with the advancement of technology data transfer rate has been changed [46]. WiMax provides broadband multi access connectivity that includes fixed, portable, nomadic and mobile communication through wired or wireless connectivity. Both WiFi and WiMax technologies have been deployed in Ministry of Food and Agriculture, Ghana (MOFA) which enables user to connect either WiMax networks or building Wifi [47]. d: 2G/3G/4G-Mobile Communications Standards There are multiple generations of Mobile Communication Standards consist of Second Generation, Third Generation, and Fourth Generation. IoT devices Communicate by using these standards over cellular networks. Through the use of mobile communication farmer can detect temporal variability across their fiels and monitor crop yield, soil and climate conditions [48]. e: LR-WPAN Low Rate Wireless Personal Area Networks figure out the specification of high level communication standards like ZigBee. Data transfer rate of LR-WPAN consist of 40 Kb/s-250 Kb/s. The major property of this standard is that it provides low speed and low cost communication services [49]. LR-WPAN is mostly used for indoor agriculture such as home garden or in small farms. f: RFID RFID works on the principal by assigning a unique number individually to each object in order to record information. RFID consists of readers, host and tags where tags receive and transmit radio waves due to which it is also known as responder. RFI tags consist of active tags and passive tags which are available in different sizes and shapes. Passive tag is more advantageous as compare to active tag because it is cheap than active tags. Tags have unique ID number and environmental information such as moisture level, temperature condition, and humidity etc. These tags are embedded and attached in multiple objects to identify that object. g: ZigBee ZigBee is on the top of IEEE 802 standards created by ZigBee Alliance. It is a set of specifications for device to device network having low power data rates. With the advancement of technology and increasing the demand of throughput there is a need of faster and low power consumption technology. These requirements are fulfilled by more established technologies which provides faster data transfer. In agriculture environment IoT sensors sense the data and transfer it towards remote server. After sensing, collected data is analyzd for decisions making [50]. h: MQTT MQTT is a messaging protocol in IoT which is mainly designed for remote connections. It\\u2019s a bandwidth efficient protocol and uses little battery power. MQTT is used for continuous analysis and deploy a smart system for agriculture sector. A low cost web based IoT solution has been presented by using MQTT for monitoring, tracking and analyzing agricultural data and collect knowledge from field ambience and improve environmental conditions [51]. By using MQTT a low cost irrigation system has been proposed for receiving and transmitting sensor information [52]. i: SigFox It\\u2019s a low data rate and an ultra narrowband wireless cellular network which is appropriate for IoT and machine type communications [53]. To construct a geo location system SigFox network was used which localize animals pasture of the whole summer [54]. System proposed in [55] helps the farmers to locate their cattle\\u2019s position and increase their productivity. j: Bluetooth Bluetooth is a low power and low range Personal Area Network which is best for short range mobile communication. There are many IoT agricultural devices which are bluetooth enabled such as Farmnote Air gateway and color sensor work with bluetooth enabled sensors. Bluetooth has ubiquitous nature due to which it is considered as an appropriate technology for multi-tier agricultural applications [56]. SECTION IV. IoT Agriculture Applications IoT agriculture system applied as an array of wide variety of fields such as, Precision farming, livestock monitoring, and greenhouse monitoring. Agriculture applications have been categorized into three sections: IoT agricultural applications, Smartphone based applications and sensor based applications. IoT and sensor based applications categorization has been illustrated in figure 11 which is framed by reviewing the today\\u2019s available IoT solutions in agriculture. FIGURE 11. IoT structure in agriculture. Show All A. IoT Agricultural Application Domains There are number of IoT agriculture applications which are being used to create more efficient resources for agriculture productivity. Main domains of IoT agriculture applications are precision farming, livestock monitoring, greenhouse monitoring and agricultural drones. The following subsection consists of various types of agricultural applications. 1) Precision Farming Precision farming helps the farmers to improve, automate and optimize all feasible directions in order to enhance the agricultural productivity and make cropping system smart [57]. Different IoT sensors are deployed to measure soil quality, weather conditions, moisture level, and effectively plan to optimize harvesting techniques. To enhance the crop production a correlation analysis between agricultural environment information and crop statistical analysis has been developed to collect crop data [28]. In [58] an IoT based platforms has been developed for precision agriculture and ecological monitoring. IoT based weather forecasts helps to optimize productivity and take anticipatory analysis to prevent the crop from damage. Multiple monitoring devices/sensors are used to predict pest behavior, plant or crop growth and address any pending pest issue before they damage crop. Ranchers use IoT based irrigation solutions to manage and analyze crop irrigation requirements. In [59] a remote agricultural monitoring platform has been presented on the basis of monitored data. A conceptual architecture based on cyber systems and software defined setworks has been presented in [60] for precision farming. IoT base Precision farming consist of multiple monitroing and controling applications such as climate conditions monitoring, soil patterns monitoring, pest and crop disease monitoring, irrigation, determine optimal time to plant and harvest and tracking/tracing. a: Climate Conditions Monitoring In agriculture it is the most important to monitor weather conditions continuously so that future activities can be planed accordingly. Weather stations are the most popular gadgets in the field of agriculture which are used to monitor different climte conditions. Weather parameters which are being monitored include temperature, humidity, wind direction, and air pressure etc. Located across the field, weather stations collect the environmental data and send it to the cloud server. Collected data is used for weather analysis to map climate conditions, and provide new insights to take required actions to improve agricultural productivity. US Food and Agriculture Organization (FAO) has been defined a weather related approach called Climate Smart Agriculture (CSA) which helps the user to transform agriculture system by identifying climate conditions [61]. A wireless sensor network has been deployed by using IoT technology to monitor weather changes by integrating the sensors and devices [62]. b: Soil Patterns Soil monitoring has become one of the most demanding practices in agriculture field for both industries and farmers. In soil monitoring there are many environmental issues which affects on crop production. If hese kinds of issues are identified data accurately then the farming patterns and processes can be understand easily. Soil patterns which are being monitored consists of Soil Humidity, moisture, fertilization and temperature. Soil humidity and moisture sensors are deployed to monitor the moisture content in soil [63]. An adequate amount of fertilization in the field also increase crop yield [64]. Soil monitoring test report increase crop productivity and recommends an appropriate fertilization solutions to farmer [65]. Moreover, identification of contaminated soil by using IoT technologies protect the field from over fertilization and crop loss. c: Pest and Crop Disease Monitoring Root causes of revenue and production losses are crop diseases. Due to the boom of IoT agricultural system has been changed into digital system which helps the farmer to make informed decisions. Prediction of crop diseases at early stages helps the farmers to generate more revenue by saving crop from pest attacks. IoT protect crop in multiple ways by detecting different diseases and prevent crop from animal attacks. An IoT based monitoring system has been presented in [66] to monitor the wheat diseases, pest and weeds. Crop raiding is the biggest issue due to contraction of cultivated land into different wildlife haunts. In [67] a monitoring and repelling system for the protection of crop against wild animals attack has been presented. Detection of crop disease at early stages is very challenging in the field of agriculture. Because to detect crop or leaf disease a team of experts is called, which is expensive and time taking process. Whereas, automatic detection of diseases is very beneficial, accurate and cheaper for farmer as compared to manual observation by experts. Image processing technique also plays a vital role for the earlier detection of plant disease [68]. A crop disease detection scenario has been shown in figure 12. FIGURE 12. Disease detection scenario. Show All Sensed raw data via sensing devices is converted into usable format via remote server and then stored into database which is displayed through a user interface. After getting data multiple data mining models are applied for disease (bacterial, fungal, viral etc) analysis. d: Irrigation Monitoring System IoT improve the current irrigation system in a more innovative way. A farmer can optimize irrigation system in multiple ways by monitoring weather conditions and soil conditions. IoT technology monitor irrigation system in four ways like weather forecasting data, control and monitor whole field from anywhere, Ethernet connection and WIFI. This modern irrigation system facilitates the farmers by installing multiple sensors, reducing farmers monthly irrigation cost, and limit water resources [69]. In [70] an intelligent irrigation management system has been presented by using Maching learning and open source technologies which sense different soil and weather parametrs. An IoT based Low cost irrigation system has been designed in [71] which uses HTTP and MQTT protocols to inform the user. Water quality is monitored by sensor nodes which are empowered with wireless communication. IoT technology measure both physical and chemical constraints of ph, dissolved, temperature, conductivity and oxygen [72]. Gathered data about water management system is viewed on internet by using cloud computing services. Recently multiple IoT irrigation platforms have been developed to control the water consumption in the field. In [73] a simple irrigation system has been developed by using WSN. In more advance system users can control the process of irrigation through cellular technologies. Likewise, system is proposed in [75] in which user transfer sensors data via cellular technologies to a database system. e: Determine the Optimal Time to Plant and Harvest IoT increase operational efficiency and enhance the crop productivity by determining the best possible time to harvest and plant. IoT amalgamate multiple existing technologies like cloud computing applications, end user applications, wireless sensor networks (WSN\\u2019s) and Radio Frequency Identification (RFID) to determine the accurate time of weeding and seeding [76]. f: Tracking and Tracing IoT provides informative data to agricultural companies for better decisions making such as planning, managing and connect with business partners intelligently by saving money and time. In growing environment soil, air, water, fertilizers, and pesticides conditions are monitored by RFID and Global Positioning System (GPS). GPS system is used to find the exact location of agriculture field and monitor various agricultural parameters by using wireless communication networks. In [77] an architecture has been develop which remotely monitor the soil condition and soil structure as per requirement of crops culture. In this structure ZigBee is connected with other devices like content management system (CMS), Global System for Mobile (GSM) and General Packet Radio Service (GPRS) by using Wireless sensor networks to monitor and realize real time data checking. GPS provides interface to interact with ARM (an intelligent monitoring system to achieve functions like SMS/MMS) and gives an alarm to farm manager when an unwanted changes occur and helps the farmers to take corrective action. Although it\\u2019s operational and maintenance cost is high but it is widely used in agriculture due to its exact location monitoring and tracking property. g: Farm Management System The adoption of smart farming is correspondingly increasing the amount of productivity by reducing the environmental impact but this smart farming technique can be possible via Farm Management System (FMS). FMS is a key element for processing, planning, and decision making for the purpose of smart farming [78]. An integrated FMS allows the farmers to monitor the entire where whole data is collected via WSN, GSM modules and microcontroller. An identifier is used on the sensors and devices in all over the farm which gives the proper knowledge of fertilization, weather data, automatic buffer zone width monitoring, and automatic detail record is generated according to per day activities of farm. This whole information is stored in the computer in standard format and can be accessible via cell phone or internet for further processing. To optimize the use of water resources an automated irrigation and monitoring system is used [73]. Apart from irrigation system farm is also protected from pest and animal intrusion [66], [67]. h: Agricultural Drones Drones are defined as Unmanned Aerial Vehicles (UAVs) which are being utilized in agriculture to improve various practices of farming. These flying devices are controlled remotely by remote control or autonomously programmed. Agricultural processes which are performed by drones are crop health assessment, spraying, screening, planting, scouting reports, measurement of nitrogen in wheat and analysis of soil conditions. Drones facilitate the farmers via integration with Geographic Information Systems (GIS) mapping, and crop health imaging. Drones are mostly deployed in large farms where issues related to bacteria fungus are difficult to handle and require regular monitoring. In the area of agriculture pesticides and fertilizers are very important for crop yield [65], [66]. Agricultural drones are carrying out this job efficiently because of its high speed and effectiveness in the spraying operation. In addition they also deployed to monitor forests, livestock and aquaculture. An organization Precision Hawk is using drones for valuable data gathering through sensors for surveying mapping, and imaging of agricultural land. They perform in-flight monitoring, farmers enters the detail about which field to survey and select a ground resolution. An IoT based Farm management information system approch has been developed to meet the bussiness objectives [29]. Agricultural drones are integrated with GPS devices cameras and sensors to monitor crop health, like planting, crop spraying, screening and analysis of soil. There are many other advantages of drone\\u2019s utilization like crop health imaging, plant counting, amount of nitrogen in wheat, plant height, drainage mapping, and weed pressure etc. 2) Greenhouse Monitoring In greenhouse plants are grown under controlled environment. This glasshouse technology provides benefits to growing plants anytime anywhere by monitoring appropriate environmental conditions. Cultivation of greenhouse is more intense, therefore in terms of controlling and monitoring it requires high precision. To monitor environmental or weather conditions there have been several studies on the applications of WSN\\u2019s in greenhouse. Recent studies shows that how IoT can be implemented in greenhouse to minimize the human resources, accumulate energy and provides direct link of greenhouse from ranchers to customers. Most of the studies have focused only on remote monitoring and localized [14]\\u2013[16]. In addition, for the purpose of high precision there have been a lot of studies which integrates meta-processing structure with data to transfer it on remote infrastructures through internet. By applying well evaluated crop models, assessment of the crop status helps the ranchers to take better decisions [80]. In Figure 13 a Wireless Sensor Network (WSN) has been implemented to monitor the greenhouse environment. Whole network is divided into multi parts which processes the data and gives feedback. FIGURE 13. WSN for monitoring greenhouse environment. Show All Data can be obtained by corresponding sensors and detectors and then transferred to the main server for processing. In physical implementation the major components are the sensors and network for accurate data transmission. Growers setup the different monitoring devices and sensors according to the specific requirements and track or record the required information. Agriculturists make better decisions by analyzing the received information and achieve specific goals by obtaining optimal data. There are many IoT based greenhouse applications such as water management, plant monitoring, and climate monitoring etc. a: Water Management To measure the exact amount of required water in greenhouses is a key problem. Smart sensors are implemented which are controlled by applying multiple IoT techniques to avoid from excessive use of water. In greenhouses water management is carried out by using automatic drip irrigation which works by following soil mositure threshhold that is set accordingly [81]. b: Plant Monitoring IoT sensors and cameras creates ideal environment for plants by monitoring the state of plants regularly and generates an alert if any problem is recognizable. On the other side, cloud based IoT solutions store the sensed data and view it periodically which is helpful for growers to ensure that all plants obtains ideal attention in the greenhouse [82]. c: Climate Monitoring There are many parameters which are combined to maintain and create an ideal environment for plants within strict limits such as, the maintenance of ventilation, temperature, carbon dioxide, and oxygen level. This can be made possible by deploying IoT enabled greenhouse where smart devices and sensors share their information for strong decision making [81]. 3) Livestock Monitoring Optimal environment or weather circumstances which absorbs excessive amount of climate conditions leaves negative impact on the productivity of animals that is a serious issue for many researchers [83]. Whereas, due to increasing the demand of high quality dairy products precision livestock also considered as the major concern. Each year ranchers lose a large amount of profit because of animals illness. But IoT based livestock management solutions helps the farmers to improve the farming principles, livestock conditions and dairy products [11]. Just like crop monitoring sensors, different livestock monitoring sensors are also attached to the animals to monitor their log performance. Livestock monitoring factors varies on the categories of animals under consideration such as conductivity of milk, pest attack, humidity, and water quality. By tagging RFID to individual animal allow farmers to track their location, thereby preventing animal from theft. Connected sensors and wearables in the livestock allow the farmer to monitor overall animals\\u2019 activities and data streamed to the cloud directly helps the farmers to identify the issues. Cowlar and SCR by Allflex are using smart agriculture sensors to monitor animals health, activity, temperature, nutrition and collect information on each individual as well as about the herd [84], [85]. In the field of livestock several studies have been realized. Wireless Sensor have been used which are most advantageous for large farm as well as for hazardous gas monitoring. An IoT based livestock scenario is shown in Figure 14. FIGURE 14. IoT based livestock scenario. Show All In the field different IoT sensing devices have been deployed to monitor the weather conditions via weather station and sense other activities in the field by all other data sources which have been implemented in the whole farm. Sensed data is stored on the cloud server, which user can use for decision making. User can interact remotely by using multiple smart devices (Laptops, Tablets, and Mobile etc.). Some IoT base applications of livestock monitoring have discussed below: a: Animal Temperature Monitoring Identification of disease symptoms and prevention is the major function for animal health monitoring. Normal body temperature of dogs is 38.3\\u00b0C-39.2\\u00b0C and cow\\u2019s is 38.5\\u00b0C-39.5\\u00b0C. When the body temperature is increased or decreased from the normal body temperature then it indicates that animal is suffering from any disease [86]. b: Heat Stress Level Heat stress decreases the cow\\u2019s milk productivity with same dietary input, due to which farmers face the cost production issues. In summer season moisture content becomes low due to which stress level in animals increased, because of this animal can also die. c: Physical Gesture Recognition Gesture analysis can be made by using IoT animal monitoring devices. Animal\\u2019s gesture behavior is classified into different groups such as in cattle, this behavior is consisting of two classes that are traveling and stationary. Traveling behavior consists of animal\\u2019s walking, running and grazing whereas stationary behavior is animal\\u2019s sitting, sleeping and standing. d: Rumination Rumination monitor the digested food by animal and it is detected by mounting a monitoring device in the animal\\u2019s (cows) nose. In this way farmer can get accurate indication about animal\\u2019s health. e: Heart Rate Measurement of heart rate is an indirect method which impacts due to the agitation and stress that cow have. Normal heart rate of cow is 43 to 84 bpm whereas calf\\u2019s normal heart rate is 100 to 140 bpm. By using IoT devices and sensors heart rate can be monitored constantly. f: GPS Based Monitoring GPS system is used to obtain the specification of farm and sends the monitored parameters to central monitoring station by using wireless sensor network. To prevent animals from theft, wild attacks or weather conditions a repelling system has been provided by using wireless technologies like Zigbee, WIFI, and LoWPAN [88]. B. Agricultural Solutions by Using Smart Phones From the last few years it has been observed that integration of electronic devices with smartphones innovate the technology world and smartphones are taken as a driver of IoT. To make smart phones versatile in agriculture field various hardware and software have been designed. A good (but not complete) survey of smart phone apps providing agricultural solutions has been presented [98]. Figure 15 showing a classification illustration of smart phone apps for smart farming. Morever, there is a number of recent apps which are serving similar functionalties. All smart phone apps which are elaborated in figure 15 discussed in tabular form with a small description of each. These smart phone apps are not limited; developers from all over the world have developed many e-Farming apps therefore, this paper highlighted some selected apps which have been discussed according to their popularity. FIGURE 15. Smartphone applications for agriculture. Show All C. IoT Devices and Sensors in Agriculture In today\\u2019s modern world everything needs to be automatic with less man power by consuming less time. Sensor is such a device which can fulfill this requirement by detecting same input from the existing physical environment and responds back. User set some setting over sensing devices to perform their task without the involvement of human. There are some major IoT sensors like: Motion Detector, PIR, Soil Moisture, Temperature, Humidity, Barometric Pressure, Ultra Violet, PH, and gas sensor. In Table 3 various sensor based agricultural applications, their operations and IoT association have been discussed but table 2 pay attention only on smart phone agricultural apps. TABLE 2 Smartphone Agricultural Applications Description TABLE 3 IoT Sensor Based Applications in Agriculture SECTION V. IoT Agricultural Security In the coming years agricultural sector is expected to witness the extensive acceptance of IoT and grow through the new e-farming IoT applications and devices. These agricultural applications and devices are expected to deal with a large amount of sensitive data. Due to the distributed nature of IoT a single security protocol is not sufficient therefore, leakage of information is a major security concern [107]. If we adopt IoT fully in the field of agriculture then it will be more critical to analyze and identify the distinctive features of privacy and security like different security requirements and threat models in the perspective of Agriculture. On the basis of literature some security issues has been presented in Figure 16. FIGURE 16. IoT security issues in agriculture. Show All A. Security Requirements IoT based smart farming security requirements are similar to standard security scenario. Therefore, to achieve a secure farming solution we have need to pay attention on the following security requirements: Confidentiality: Agricultural information or personal data relevant to it should be accessible only by authorized users. Integrity: Here integrity means received and stored data or content is not changed. Authentication: Authentication means peer devices should have an identity to which it is communicating. Data Freshness: It consists of key freshness and data freshness because IoT agricultural networks sometime provides varying measurements, therefore it is necessary to ensure that every message is fresh. Non Repudiation: Its means a node can never deny to send a message that sent earlier. Authorization: Here authorization means for network or any other resources only authorized devices are allowed. Self Healing: If any device in an IoT based agricultural network fail or out of energy then other devices in the network should be able to provide security to some extent. B. Security Challenges Security of IoT based smart farming mainly consists of three basic requirements that are Authentication, access control and confidentiality of the stakeholders. Whereas, at the perception layer network must be secured from external attacks and in the network layer aggregation of the data should be secured. Authorize specific entities ensures that only authorized user can access data from application layer [28]. The most common issue of security in the perception layer is physical security that is the security of hardware and information acquisition security [108]. Here physical security is very important because all the devices are deployed in an open field. That\\u2019s why a single security protocol is not enough because IoT devices may be implemented in a diverse environment. Another major security issue is leakage of information, this information consist of location and sensitive data. Security countermeasures consist of data encryption, jamming, blocker tags use, modification in tag frequency, and tag destruction strategy. There is a difference between sensor nodes and RFID tags that\\u2019s\\u2019 why while implementing encryption algorithm, intrusion detection policies, key distribution and routing policies, hardware restrictions should keep in mind [109]. In IoT concept data flows from an end device towards gateway, during this process data also uploaded to other platform such as cloud infrastructure. There are multiple security policies exist for sensor nodes like identity authentication, data filtering, cryptographic algorithm, data flow control mechanisms etc. Cheating, wiretapping, replay attacks and tampering are also security threats. Due to which, confidentiality, authentication and integrity should be must employed while data acquisitions phase [17]. C. Stack Challenges Middleware layer also plays a vital role in IoT to increase security. Middleware stands in between application layer and network layer which is responsible to process data and provide interface for communication between these layers. Middleware layer requires secure and confidential data storage. Secure transmission via wireless medium is very challenging in IoT deployment due to which IoT based architecture is at risk like vulnerability, denial of services, illegal access, and many virus injects. In this way data integrity and confidentiality is affected by such attacks. According to IoT vision application layer is one of the top most layers and closely related to the cloud due to its computation resources and storage nature. Security issue at application layer and cloud are very similar such as data security, backup, recovery and privacy. Therefore, access rights of the data, information and ownership for physical users, machines and organizations should manage and administered by a control mechanisms. D. Threat Model Both IoT agricultural devices and networks are at risk because of increasing attack surface. IoT agricultural threat model consist of three scenarios. First one is cloud networks, second is native networks expansion and third is cloud services. Threat may be generates from internal or external network. If an attack is arise from an agriculture device then it will be considered as one of the more severe attack. Because it is very difficult to detect the malicious device within the network. In addition an adversary may attack on an agriculture device and network and use power device like mobile, laptop or tablet or may be same kind of IoT devices to penetrate the network. E. Attack Taxonomy There are many types of attacks in IoT paradigm due to which an attacker may attack by adopting a method on future or existing IoT agriculture devices and networks. In IoT agricultural field threat may be tangible, predictable or unpredictable. In this paper existing and possible threats are classified on the basis of three key factors: which are Information Disruption, Host, and networks. 1) Attacks on the Basis of Information Disruptions Stored agricultural data may be analyzed or manipulated by a hacker to provide wrong information. Such attacks consist of Interruption (denial of services), Interception (threaten data privacy and confidentiality), Modification (unauthorized access to the agricultural data), Fabrication and replay. 2) Attacks on the Basis of Host Properties Host properties attacks occure in two forms namely: hardware compromise (attacker may attact on device program code data or keys and reprogram the devices with malicious code) and software compromise (attacker may take the advantage of software vulnerabilities and glitches like operating system, applications software and system software). 3) Attacks on the Basis of Networks Properties Two types of attacks can be arised on basis of networks properties. Namely: standard protocol compromise (to threat service availability like integrity and authenticity where attacker deviates from standard protocols) and network protocol stack (consist of different types of vulnerabilities). F. Reference Security Model for IoT Based Agriculture IoT agricultural paradigms are not yet strong but continued to build up due to which currently it is difficult to discover all possible threats and vulnerabilities in IoT agricultural field. However, when experts find the security solution to solve the apparent security threats at that point they should have the ability to mitigate the hidden security issues. To accomplish a security solution, security checks should be deployed with dynamic properties. Consider a framework in which security mechanism consist of different systems which can detect and prevent IoT agricultural system from attacks. Now consider, that an attacker generate a new type of attack on agricultural applications devices and networks to steal agricultural information integrity. In such conditions existing security techniques should indentify this new attack by using dynamic algorithm. A security model presented in Figure 17 has been discussed to resolve these issue. The model is illustrated with its three security systems: protection system is designed to mitigate the attack while, dignosing system collects activity data from agricultural applications, networks, nodes and analyzes detected agricultural data. Reaction system is designed to help the agricultural entities survive all types of attacks. FIGURE 17. An intelligent collaborative security model for smart farming. Show All FIGURE 18. Selected IoT agricultural products. Show All Whole system has been designed by following dynamic algorithms. To prevent from present, probable and hidden attacks this system has strong collaboration. Upon intrusion detection system issues an operation command and store in reaction system after that share their anomaly diagnosing experience with protection system to prevent from further attacks. Operation command receive response from identification service, reaction system remove the system failure risks and after that pass out its experience with other two systems that are protection and diagnosing systems. In this way a complete inter collaboration system is accomplished. SECTION VI. IoT Agricultural Industry Trends and Practices The IoT in agriculture field has experienced a burst of creativity, activity, venture capital firms and exciting entrepreneurs. The space becomes visible as an active group of large firms and new start ups that are willing to become the part of what may be a giant market and technologies. In this section an extensive record of some products and technologies has been provided for a good understanding of IoT position in agriculture field. 3D Crop Sensor Array with PAR Addon can be mounted on any location, to monitor temperature, humidity and carbon dioxide in the farm [110]. EC-1 Controller monitors the environmental conditions and then programs them to control the environment by turning off and on devices [111]. Arable Mark is the first device which links the global weather data within the field observations developed by Arable. With the unprecedented ground truth accuracy device makes informed decisions and deliveres real time monitoring information to the palm of user\\u2019s hand [112]. Growlink designed Growlink one controller to deliver smart farming experience. It has highest processing power and components quality to coordinate with multiple sensors and devices in all over the farm. This device is simply all in one and farmers can expand the system according to their requirements by adding additional microcontroller via IP networks [113]. Easternpeak offers an IoT GreenIQ agricultural device which control irrigation and saves water of your garden\\u2019s lawn from anywhere. Growers can save up to 50% outdoor water bills by using a GreenIQ smart sprinklers controller [114]. Grofit provides a climate monitoring device based on Bluetooth and its transmission range is up to 200 m in all over field. This device also provide data log which store maximum 30 days measurements. Growers can monitor air humidity, real time air temperature and sun radiations by using this device [115]. MeteoHelix weather station designed by allmeteo which provides reliable, stable and open meteorological solutions according to weather requirements. This weather station provides multiple features like temperature, humidity, atmospheric pressure, dew point, sun radiations, and solar radiations measurement [116]. Leaf Wetness sensor is developed by Smart Element which determine the wetness of leaf by electrical resistance on the surface of sensor. It is used to measure wet and dry time on the leaf surface [117]. Swip Track Micro locates any moving object in all over the field that may be any farming machine, vehicle or engines [118]. Waspmote Plug & Sense! Smart Agriculture Xtreme is a sensor node which provides more reliable and accurate information about weather. This sensor measures the wind and rainfall condition via optical technology. The presence of fertilizers and soil morphology can be analyzed through this sensor by measuring the oxygen level, water content, and soil water potential [119]. SKY \\u2013 Lora Weather Station can easily communicate to nearby master sensor through LoRa [120]. This is suitable for those locations where there is nearby connectivity. This weather station can send data up to 600 meter away to a master sensor which has WIFI connection. Pycno has been developed a Pulse IoT automation sensor which comes in a self-sustained package powered by a tiny solar panel [121]. Sensor is WIFI and LoRa enabled device which has multiprotocol port in the bottom. In future Pulse Automation Sensor and Pycno soil sensor will be integrated to actuate devices and talk with each other in the field. CropX Starter Kit \\u2013 Soil Temperature 24/7 is a real-time soil-temperature monitoring Sensor. This sensor has direct cellular connection and better accuracy which provides advance sensing capabilities [122]. Some top technologies firm\\u2019s trends and directions are highlighted in Table 4. TABLE 4 IoT Agricultural Trends and Directions of Some Well Known Technology Industries SECTION VII. IoT Smart Farming Policies and Success Stories A. Policies Many countries have understood the importance of IoT and facilitating through its advance monitoring techniques. Government of different countries is seizing the IoT opportunity and investing maximum to boost up the crop productivity. Adaptation of IoT technology in different countries has been discussed in this section. 1) Australia Government of Australia has invested AU$ 134 million to boost up farming. Due to this large investment a center was created by a private company in Sidney to implement IoT technologies for Smart farming [150]. In 2014 an Innovative Network for Precision Agriculture System was established for the purpose of a collaborative frame work to create a national agenda in Australian agriculture. In terms of privacy and security, in 2015 an American farm Bureau took the lead in establishing a privacy and security set for farm data [151]. 2) Ireland Irish Farmer\\u2019s Association (IFA) Launched a program for agriculturists to reduce the cost, to improve the soil quality and guides the farmer how to save water and energy by adopting new technologies [8]. When the farmers follow these instructions the results were very positive and encouraging. Companies saved almost 8700 euro, 10% reduction in green house gas emission, 21% savings in pasture management and 47% saving was achieved by Soil Fertility. In 2016 a nationwide SigFox network was launched by VT-Networks Ireland which provides solution for tracking security sensors and farm assets [153]. 3) France Ministry of Agriculture in France has become the partner of the Agriculture Innovation Project 2025. The basic aim of this project is to increase the strengthen of agricultural land, monitor the climate conditions and create incubators to improve agriculture field in France. Ministry of agriculture also share the collected data with farmer\\u2019s to propose new solution in the field of Agriculture [154]. French agriculture is administrated by European Union (EU) rules and supported through a policy called Common Agriculture Policy (CAP). A new CAP framework was defined in 2015 at EU level for next five years which is beneficial for different agro ecology projects for farming. 4) China In 2016 china launched its 13th five years plan to integrate IoT in the field of agriculture to enhance profitability [156]. Project has been started in different eight provinces, with multiple products, technologies and 426 applications. Data was collected from multiple provincial and national level data centers. Moreover, NB-IoT App by Huawei company in china transforming the agriculture in a more efficient and an innovative way. NB-IoT provides low cost agriculture solutions as compare to cellular network where gateway implementation is not necessary. Huawei NB-IoT has large number of connections and wide coverage due to which it can resolve issue of scattered agricultural data [157]. 5) Malaysia Agricultural policy in Malaysia was established in two periods of time policy before and after independence 1948\\u20131957 and 1957\\u20132020 [158]. The purpose of the policy was to enhance the growth of crop and decrease the poverty. Multiple solutions have been created by Malaysian Institute of Microelectronic System (MIMOS) which are best for agriculture development. A sensor named Mi-MSCANT PH has been developed by MIMOS to gather environmental data. An agricultural framework has been developed by MIMOS to integrate IoT technologies which create a bonding between suppliers, traders, and agricultural producers mutually in unified manners. This framework utilizes technologies named Micro Electro Mechanical System (MEMS) and WSN which automatically collect environmental data [159]. 6) USA USA has funded million Dollars to generate new agricultural technologies to fulfill the necessary requirements of energy and food. National Institute of Food and Agriculture worked on a project that is Internet-of-Ag-Things and develop sensing technologies for smart farming practices. The major purpose of this project is to develop precision technologies to enhance the efficiency of agriculture industries and make better use of water, fertilizers and organic food [160]. The U.S. Department of Agriculture (USDA) has started a project to address water management challenges and develop new solution for those issues which are affecting agriculture. Technology experts are using USDA datasets to improve and design agricultural services [161]. 7) Thailand In Thailand National Electronics and Computer Technology Center (NECTEC) applying innovative IT technologies for the purpose of smart farming and their major focus is on four agricultural products including Rubber, Rice, Sugar and Cassava [162]. The major concern of this movement is to increase the agricultural productivity and facilitate the farmers in all rural areas of Thailand [163]. Faculty of Science and Technology at Thammasat University developed an IoT-based irrigation control system which helps the grower to preset watering cycle timing in advance. A smart farm service provider namely; FarmD Asia was established in 2015 to boost up the agricultural productivity by its flagship products. FarmD Asia has also designed a pesticides aerial drone which covers upto eight acres land in single fly. National Science and Technology Development Agency (NSTDA) launched Agricultural System Integrator (ASI) program which was primarily designed for farmers to start and run smart farm successfully [164]. 8) India Different IoT policies have been formulated by Indian government in order to leverage the strength of their agricultural field in all over the world. Indians basic purpose is to monitor the earth density, soil conditions, temperature and alerts the farmers to control pest related issues. In 2015 a policy on IoT in India was released by Ministry of Communication and Information Technology to transform digital landscape by using IoT [165]. 9) Philippine Philippines have used the remote sensing techniques to increase the production of rice. They are also using ground data processing and satellite imagery techniques to generate more information on different agricultural conditions. University of Southeastern Philippines (USeP) proposed an intelligent solution to monitor crop heat stress by using IoT technology with the collaboration of Western Mindanao State University (WMSU). In this project research team is on the brink with an effective technology counter heat stress which helps the farmer to get maximum benefit with the fewest inputs [166]. B. Food and Agriculture Organization of United NATIONSNN Food and Agriculture Organization of United Nations (FAO) is an e-agricultural organization which follows the international efforts to fulfill the deficiency of food in all over 130 countries worldwide. FAO predicted that there is a most probability that world population will reach 9.8 billion by 2050 therefore, it is necessary to increase the food production 70% by 2050 to fulfils the growing demand of food through the utilization of IoT technology. Mitsubishi Corporation (MC) and Vegetalia, changing Japanese agricultural sector by their join forces through AI and IoT. By using tensiometer sensors Tevatronic develops an autonomous irrigation system which is placed in the ground near the plants for monitoring. From the last 74 years FAO has been changed the agricultural world by launching its top ten achievements given in table 5 [167]. TABLE 5 Top 10 E-Agricultural Strategies of FAO C. IoT Agriculture Success Stories This research indicates that there have been several tools and techniques which helps the farmers to improve the crop productivity in a more innovative ways. Some IoT agriculture relevant technologies have been discussed in section I which provides additional tools to the farmers or agriculturists to increase the crop yield. Section III describes the different IoT and Smartphone based applications which facilitate the farmers to enhance the agriculture productivity by providing extended benefits. However over the globe governments are seizing the IoT opportunities in agriculture by making large investment. There are many pilot projects which reflects a great potential in the future of IoT in agriculture at country level such as china, India, Malaysia, Thailand, Taiwan etc. Therefore, in this research we have also discussed the results of some pilot projects conducted and being executed in different countries. Table 6 prepresents the success stories of these pilot projects in different countries with the main IoT agricultural applications (precision farming, greenhouse, and livestock). TABLE 6 IoT Agriculture Success Stories SECTION VIII. IoT Agricultural Challenges Many researchers have worked on IoT agriculture system and solve multiple technological issues and architectural problems by implementing and designing various IoT agricultural solutions. Moreover, according to the research point of view in the literature, there are also several open issues and challenges which are needed to address successfully [57]. There are many challenges which are linkage with IoT smart farming deployment and applications. This research has identified some explored and unexplored IoT agricultural issues and challenges. A. Hardware Challenges Several challenges arise in IoT agricultural setup. First of all the equipments which exists at the perception layer are directly expose to harsh environmental experience such as, rain, high level temperature, extreme humidity, hard winds, and many other possible dangers which destroy electronic circuits. End devices works consistently for a long period by depending on inadequate batteries power resources. So, a suitable programming tools and less power potential is necessary because in case of any program failure instantly battery replacement is complicated especially in a large scale open field [144]. B. Networking Challenges These challenges are not only for the hardware implementations, but also exist at the network layer. Due to high cost of wiring, wireless communication is most important for the deployment of IoT based agriculture. Physical deployment shows that accepted transceivers performance is exaggerated by human presence, temperature, humidity and many other barriers inside the space where wireless device or node wants to communicate. Due to which there should use most reliable and robust technologies to transfer data according to the environmental challenges and rural conditions [8]. A detailed analysis on IoT agriculture networking challenges and issues is given [145]. C. IoT Agricultural Platforms IoT agricultural architecture is more complicated as compare to other IoT end devices and requires real time monitoring system with additional stringent requirements. For this a tailored computing platform is needed with run time libraries. A service oriented approach (SOA) can also take to build a suitable platform; such services can be exploited by using different API\\u2019s. In addition, appropriate frameworks and libraries should be developed so that agricultural developers can make resourceful use of available document, classes, codes and other useful data. D. Other Technical Issues 1) Interfernce To implement smart farming a large number of IoT devices are deployed for agricultural purpose that creates hindrance especially for those IoT devices which are using unlicensed spectrum like Sogfox, ZigBee, LoRa, and WIFI. These technical issues reduce the reliability and loss of data. Moreover, unnecessary interference can be eliminated by using IoT devices with licensed spectrum. But, among the IoT devices which are using cellular licensed spectrum the reprocess of non-orthogonal multiple access method can create hindrance because of restricted pilot assignment in cellular band. 2) Reliability In agriculture field mostly the IoT devices are deployed in an open environment. Due to which there may occur some inconsiderate environmental impacts which may cause the communication failure as well as degradation of deployed sensors. Therefore, physical safety of IoT devices and system is necessary to secure the expensive gadgets from unauthorized user and severe attacks like weather conditions or theft. 3) Scalability Billions of IoT devices have been increased gradually, due to which more devices are getting connected. Therefor, large number of gateways and protocols are needed to support IoT devices. Moreover, IoT agricultural back end databases and network applications should be reliable and scalable because with the addition of diverse application related operations becomes more complex. Therefore, design a highly scalable security scheme and an intelligent IoT system for each end device. 4) Resource Optimization Farmers need optimization of resources to measure how many IoT devices, gateways, size of cloud storage, and amount of transmitted data is required. Due to different farm sizes and variables like crop or livestock monitoring resource optimization has become challenging because there is a need of different sensors and devices to perform each function. Therefore, this will require complex mathematical models and algorithms are required to determine the resource allocation for maximum agriculture productivity. 5) Cost Analysis and Lack Knwoledge of Technology In the field of agriculture profit margin is very important, there is a need of stability the trade-off between the deployments of IoT enabling technologies. When an IoT system is deployed the cost of implementations are very high like IoT devices/Sensors, gateways, and base station infrastructure. After that maintenance cost also important for the use of central services which are necessary for IoT devices management, data collection, and information sharing among all other services. Moreover, the major factor of slowing IoT in rural areas is basically the lack knowledge of IoT and its applications. This is the main problem because majority of ranchers is uneducated and lives in rural areas. Therefor, it is most important to overcome these obstacles by educating farmers in order to generate more revnue [7]. 6) Deployment of LPWA Technologies There is a large number of IoT devices in Agriculture scenario, and such devices should liable to be heterogeneous in the context of their transmit, receive, sleep, and deep sleep along with others. In the terms of power requirements each communication layer confronts a supplementary challenge. For example, to confirm the service accessibility at MAC layer to find a low power device discovery protocol is a difficult task. 7) Universal Platform Adaptation of IoT in agriculture will shift from just specific crop to a standard platform which can support multiple smart farming applications for crop productivity. This standard platform creates a system which can be easily modified to support multiple agricultural applications ranging from monitoring to managing. This kind of platform will be free from any kind of geographical limitations work as an enabler in IoT agriculture system. 8) Mobility IoT agricultural network should have the capability to hold up and maintain the farmers mobility. So, that they can connect their farms from anywhere at any time [146]. 9) Quality of Service (QOS) Recent studies on QoS highlight that at each layer of IoT architecture QoS is required [147] [148]. The ability to make sure that devices which needs to transmit sensitive information will be capable to do this by using IoT technology without any barrier is still an open research issue. There is a need to do more work by providing a mechanism that guarantees QoS throughout IoT network layers. E. The Business Model IoT agricultural business approach is not still vigorous because it consists of a set of essential elements with the latest requirements like new operational policies and processes to transform the organizational structure. F. Organizational Challenges When talk about food organizations and agricultural sectors, is mean the exchange of information and goods transportation. IoT is renovating this whole business process by providing reliable and accurate delivery of all products and materials [1]. At the circumference of network to store and process the data cloud computing provides highest quality of services like efficient storage, computational resources, and application development tools for hardware diagnostic. That\\u2019s why cloud computing is an ideal accompaniment in the world of IoT technologies. At the end of the network a large amount of data is produced which needs high cost to transfer towards cloud in terms of latency and money [18]. Due to which it is a serious issue because of workload and optimal balancing. On the other hand fog computing also the cloud computing extension which expanding cloud technologies like tools, and the application development scope [149]. SECTION IX. Conclusion All over the globe researchers are exploring technological solutions to enhance the agriculture productivity in a way that complements existing services by deploying IoT technology. In this article, we have presented a comprehensive survey on the state-of-the-art for IoT in agriculture. To this end, we discuss agricultural network architecture, platform, and topology which help to access to IoT backbone and facilitates farmers to enhance the crop productivity. In addition, this article provides an extensive overview on current and continuing advances in IoT agricultural applications, devices/sensors, communication protocols and many innovative technologies. This research considers various IoT agricultural challenges and security requirements for the better understanding of IoT smart farming security. Furthermore, many important dimensions of IoT based agricultural including technologies, industries trends and countries policies have been also been presented to facilitate various stake holders. Government has started patronizing IoT in agriculture and it is anticipated that soon IoT in agriculture will revamp the conventional farming method. It is also clear that many big organizations have started investing and developing new techniques for farm management system using IoT. Finally, it is expected that this comprehensive survey results into a very useful piece of information for researchers, professionals, agriculturists and policy makers who are participating and working in IoT field and agricultural technologies. Authors Figures References Citations Keywords Metrics More Like This Smart Monitoring Agriculture Based on Internet of Things 2018 2nd East Indonesia Conference on Computer and Information Technology (EIConCIT) Published: 2018 Monitoring of Soil Moisture and Atmospheric Sensors with Internet of Things (IoT) Applied in Precision Agriculture 2020 XIV Technologies Applied to Electronics Teaching Conference (TAEE) Published: 2020 Show More IEEE Personal Account CHANGE USERNAME/PASSWORD Purchase Details PAYMENT OPTIONS VIEW PURCHASED DOCUMENTS Profile Information COMMUNICATIONS PREFERENCES PROFESSION AND EDUCATION TECHNICAL INTERESTS Need Help? US & CANADA: +1 800 678 4333 WORLDWIDE: +1 732 981 0060 CONTACT & SUPPORT Follow About IEEE Xplore | Contact Us | Help | Accessibility | Terms of Use | Nondiscrimination Policy | IEEE Ethics Reporting | Sitemap | IEEE Privacy Policy A not-for-profit organization, IEEE is the world's largest technical professional organization dedicated to advancing technology for the benefit of humanity. \\u00a9 Copyright 2024 IEEE - All rights reserved.\\\"\",\n    \"analysis\": \"\",\n    \"verbatim_quote1\": \"\",\n    \"verbatim_quote2\": \"\",\n    \"verbatim_quote3\": \"\",\n    \"relevance_score1\": 0,\n    \"relevance_score2\": 0,\n    \"limitations\": \"\",\n    \"inline_citation\": \"\",\n    \"journal\": \"IEEE Access\",\n    \"pdf_link\": \"https://ieeexplore.ieee.org/ielx7/6287639/8600701/08883163.pdf\",\n    \"publication_year\": 2019,\n    \"title\": \"A Survey on the Role of IoT in Agriculture for the Implementation of Smart Farming\"\n  }\n]"