[
    {
        "title": "Decision-support tools for sustainable drainage",
        "doi": "10.1680/ensu.2006.159.3.117",
        "description": "The contribution of sustainable drainage systems (Suds) to the overall catchment dynamics of Glasgow and Edinburgh was studied. Seventy-nine sites in Glasgow and 103 sites in Edinburgh were identified for initial investigation, including a site feasibility assessment and a desk study relating to planning issues that may be relevant for subsequent future development, regeneration and retrofitting options. Detailed design guidelines were drafted for representative demonstration areas in both cities. Glasgow and Edinburgh are dominated by regeneration and retrofitting sites, respectively. Combinations of swales or infiltration trenches with ponds or below-ground storage cells were the most likely Suds options for the majority of the demonstration areas. Practical Suds decision-support tools (key, matrix and model) were developed to help identify appropriate Suds techniques for potential Suds sites. A decision-support model was developed by the author, his research team and senior planners, and provides the civil engineer with a novel practical tool to assess the suitability of different Suds techniques for a particular site with and without applying his or her own judgement. The Suds model (latest draft version on http://www.see.ed. ac.uk/research/IIE/research/environ/uw12.html) should be applied to other urban sites with similar characteristics to those in Glasgow and Edinburgh.",
        "journal": "Proceedings of the Institution of Civil Engineers: Engineering Sustainability",
        "authors": [
            "Scholz M."
        ],
        "citation_count": "20",
        "full_text": "\"Menu View Sections Decision-support tools for sustainable drainage M. Scholz Institute for Infrastructure and Environment, University of Edinburgh UK Proceedings of the Institution of Civil Engineers - Engineering Sustainability Vol. 159: , Issue. 3, : Pages. 117-125 (Issue publication date: September 2006) https://doi.org/10.1680/ensu.2006.159.3.117 The contribution of sustainable drainage systems (Suds) to the overall catchment dynamics of Glasgow and Edinburgh was studied. Seventy-nine sites in Glasgow and 103 sites in Edinburgh were identified for initial investigation, including a site feasibility assessment and a desk study relating to planning issues that may be relevant for subsequent future development, regeneration and retrofitting options. Detailed design guidelines were drafted for representative demonstration areas in both cities. Glasgow and Edinburgh are dominated by regeneration and retrofitting sites, respectively. Combinations of swales or infiltration trenches with ponds or below-ground storage cells were the most likely Suds options for the majority of the demonstration areas. Practical Suds decision-support tools (key, matrix and model) were developed to help identify appropriate Suds techniques for potential Suds sites. A decision-support model was developed by the author, his research team and senior planners, and provides the civil engineer with a novel practical tool to assess the suitability of different Suds techniques for a particular site with and without applying his or her own judgement. The Suds model (latest draft version on http://www.see.ed.ac.uk/research/IIE/research/environ/uw12.html) should be applied to other urban sites with similar characteristics to those in Glasgow and Edinburgh. Keywords: drainage & irrigation; environment; town & city planning View Full text View PDF (239 KB) SWIPE ACROSS ARTICLES NEXT ARTICLE ICE Virtual Library © 2024 Go to previous Article Download this Article Share this Article Add Article to Favorites Go to next Article\"",
        "analysis": "",
        "verbatim_quote1": "",
        "verbatim_quote2": "",
        "verbatim_quote3": "",
        "relevance_score1": 0,
        "relevance_score2": 0,
        "limitations": "",
        "inline_citation": "",
        "full_citation": ""
    }
]