"[\n  {\n    \"DOI\": \"https://doi.org/10.1016/j.biosystemseng.2019.12.013\",\n    \"authors\": [\n      \"Andr\\u00e9s Villa\\u2010Henriksen\",\n      \"Gareth Edwards\",\n      \"Liisa Pesonen\",\n      \"Ole Green\",\n      \"Claus Aage Gr\\u00f8n S\\u00f8rensen\"\n    ],\n    \"citation_count\": 203,\n    \"full_citation\": \"\",\n    \"full_text\": \"\\\"Skip to main content Skip to article Journals & Books Search Register Sign in Brought to you by: University of Nebraska-Lincoln View PDF Download full issue Outline Highlights Keywords 1. Introduction 2. Review methodology 3. IoT implementation in arable farming 4. Current and potential applications 5. Challenges and solutions 6. Conclusions and future perspectives Acknowledgements References Show full outline Figures (5) Tables (2) Table 1 Table 2 Biosystems Engineering Volume 191, March 2020, Pages 60-84 Review Internet of Things in arable farming: Implementation, applications, challenges and potential Author links open overlay panel Andr\\u00e9s Villa-Henriksen a b, Gareth T.C. Edwards b, Liisa A. Pesonen c, Ole Green b d, Claus Aage Gr\\u00f8n S\\u00f8rensen a Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.biosystemseng.2019.12.013 Get rights and content Under a Creative Commons license open access Highlights \\u2022 The role of Internet of Things in arable farming is reviewed. \\u2022 Internet of Things is leading arable farming to become data-driven. \\u2022 Implementation and application are described in depth. \\u2022 Challenges, corresponding solutions and potentials are discussed thoroughly. The Internet of Things is allowing agriculture, here specifically arable farming, to become data-driven, leading to more timely and cost-effective production and management of farms, and at the same time reducing their environmental impact. This review is addressing an analytical survey of the current and potential application of Internet of Things in arable farming, where spatial data, highly varying environments, task diversity and mobile devices pose unique challenges to be overcome compared to other agricultural systems. The review contributes an overview of the state of the art of technologies deployed. It provides an outline of the current and potential applications, and discusses the challenges and possible solutions and implementations. Lastly, it presents some future directions for the Internet of Things in arable farming. Current issues such as smart phones, intelligent management of Wireless Sensor Networks, middleware platforms, integrated Farm Management Information Systems across the supply chain, or autonomous vehicles and robotics stand out because of their potential to lead arable farming to smart arable farming. During the implementation, different challenges are encountered, and here interoperability is a key major hurdle throughout all the layers in the architecture of an Internet of Things system, which can be addressed by shared standards and protocols. Challenges such as affordability, device power consumption, network latency, Big Data analysis, data privacy and security, among others, have been identified by the articles reviewed and are discussed in detail. Different solutions to all identified challenges are presented addressing technologies such as machine learning, middleware platforms, or intelligent data management. Previous article in issue Next article in issue Keywords Smart farmingInternet of thingsWireless sensor networkFarm management information systemBig dataMachine learning 1. Introduction The global population and its food consumption are growing alarmingly quickly, while climate change effects are simultaneously complicating the challenge of ensuring food security in a sustainable manner (Godfray et al., 2010, Tilman et al., 2011). Data-driven agriculture is one of the main strategies and concepts proposed to increase production efficiently while decreasing its environmental impact (Foley et al., 2011). Data-driven technologies in general are quickly advancing with the development of the Internet of Things (IoT), and may become an important part of the future of farming (Brewster et al., 2017, Jayaraman et al., 2016, Verdouw, 2016, Wolfert et al., 2017). Smart Farming, also called Agriculture 4.0 or digital farming (CEMA, 2017), is developing beyond the modern concept of precision agriculture, which bases its management practices on spatial measurements largely thanks to Global Positioning System (GPS) signals. Smart farming bases its management tasks also on spatial data but is enhanced with context-awareness and is activated by real-time events, improving the performance of hitherto precision agriculture solutions (Sundmaeker et al., 2016, Wolfert et al., 2017). Additionally, Smart Farming usually incorporates intelligent services for applying and managing Information and Communication Technologies (ICT) in farming, and allows transverse integration throughout the whole agri-food chain in regards to food safety and traceability (Sundmaeker et al., 2016). IoT is therefore a key technology in smart farming since it ensures data flow between sensors and other devices, making it possible to add value to the obtained data by automatic processing, analysis and access, and this leads to more timely and cost-effective production and management effort on farms. Simultaneously, IoT enables the reduction of the inherent environmental impact by real-time reaction to alert events such as weed, pest or disease detection, weather or soil monitoring warnings, which allow for a reduction and adequate use of inputs such as agrochemicals or water. IoT eases documentation and supervision of different activities as well as the traceability of products, improving the environmental surveying and control in farms by the appropriate authorities. The IoT concept was introduced by Kevin Ashton in 1999 in relation to linking Radio-Frequency Identification (RFID) for supply chains to the internet (Ashton, 2009), but has no official definition. It implies, however, the connection of a network of \\u201cthings\\u201d to or through the internet without direct human intervention. \\u201cThings\\u201d can be any object with sensors and/or actuators that is uniquely addressable, interconnected and accessible through the world-wide computer network, i.e. the Internet. The application of IoT in agriculture is advantageous because of the possibility to monitor and control many different parameters in an interoperable, scalable and open context with an increasing use of heterogeneous automated components (Kamilaris, Gao, Prenafeta-Boldu, & Ali, 2016), in addition to the inevitable requirement for traceability. As a result of IoT, agriculture is becoming data-driven, i.e. making informed real-time decisions for managing the farm, reducing uncertainties and inefficiencies, and as a consequence reducing its environmental impact. The application of IoT in agriculture, also called Ag-IoT (Zhai, 2017), AIoT (Zou & Quan, 2017), or IoF meaning Internet of Farming (Alahmadi, Alwajeeh, Mohanan, & Budiarto, 2017) or Internet of Food and Farm (Sundmaeker et al., 2016, Verdouw et al., 2017), has received exponentially increasing attention in the scientific community (Fig. 1). Even though the publications are mainly dominated by Asian scientists (Talavera et al., 2017, Verdouw, 2016), in Europe several large scale international pilot projects, such as IoF2020 (Sundmaeker et al., 2016, Verdouw et al., 2017), AIOTI (P\\u00e9rez-Freire & Brillouet, 2015), SmartAgriFood (Kaloxylos et al., 2012), SMART AKIS (Djelveh & Bisevac, 2016), or more recently SmartAgriHubs (Chatzikostas et al., 2019), are aiming to implement IoT technologies in the agricultural industry in Europe. Similar projects elsewhere include the Accelerating Precision Agriculture to Decision Agriculture (P2D) project in Australia (Zhang, Baker, Jakku, & Llewellyn, 2017), which complement additional major investments with the aim to help farmers convert to smart farming (Higgins et al., 2017, Pham and Stack, 2018). Download : Download high-res image (95KB) Download : Download full-size image Fig. 1. Number of publications per year retrieved from SCOPUS with the following searching criteria: (Internet of things OR IoT) AND (agriculture OR farming). Several reviews have been done on IoT in agriculture in the relatively short time period in which publications about the subject have emerged (Ray, 2017, Sto\\u010des et al., 2016, Talavera et al., 2017, Tzounis et al., 2017, Verdouw, 2016). In addition, review papers have been published with a focus on specific subjects related to IoT applied in agriculture, such as Big Data (Kamilaris et al., 2017, Wolfert et al., 2017), modelling (O'Grady & O'Hare, 2017), Wireless Sensor Networks (WSN) (Jawad, Nordin, Gharghan, Jawad, & Ismail, 2017), food supply chain (Ramundo, Taisch, & Terzi, 2016), Internet of Underground Things (Vuran, Salam, Wong, & Irmak, 2018), chemical wireless sensors (Kassal, Steinberg, & Murkovi, 2018), or Farm Management Information Systems (FMIS) (Fountas, S\\u00f8rensen et al., 2015; Kaloxylos et al., 2012). However, to the authors' knowledge, no existing review has focused on arable farming, which has specific characteristics and challenges that differ from those in a controlled environment, i.e. greenhouses, or permanent crops such as fruit orchards. Arable farming poses particular challenges due to: \\u2022 much larger farm sizes, which affect the design of the sensor networks, the data processing, analysis and extrapolation of limited stationary sensor data, and the consequent decision making with regards to actuators, vehicle logistics, etc.; \\u2022 the larger farm sizes also imply that spatial data has a central role in arable farming, affecting the data processing, decision making and precision machinery employed to address in-field variability not at plant level as in most permanent crops, but at subfield level with automatic recognition and actuation (Zude-Sasse, Fountas, Gemtos, & Abu-Khalaf, 2016); \\u2022 greater use of mobile sensors and other devices on vehicles, which have specific challenges. While other cropping systems may also use sensors and devices on operating machinery, arable farming often requires a fleet of vehicles to operate in a co-ordinated fashion. This creates issues particularly regarding network infrastructure (Mart\\u00ednez, Pastor, \\u00c1lvarez, & Iborra, 2016), e.g. connectivity to the cloud of moving things that rely mainly on mobile networks, or vehicle to implement communication, which implies real-time interoperability between machines and devices from different manufacturers (Peets, Mouazen, Blackburn, Kuang, & Wiebensohn, 2012); \\u2022 larger amounts of heterogeneous spatial data generated at different rates and from very disparate sources: stationary sensors, moving vehicles and implements, satellites, data from web services, etc., which need to be intelligently integrated; \\u2022 highly varying and uncertain environmental conditions, as annual crops are more susceptible to weather changes and other external factors than permanent crops, which are more resilient mainly due to their deeper roots (Zude-Sasse et al., 2016), or crops in controlled environments. This obligates the IoT system to handle both spatial and temporal data, increasing the complexity of the data processing as well as the decisions based on the data collected. \\u2022 more diverse types of field tasks per growing season in arable farming, from soil preparation and crop establishment, through highly varying plant nursing tasks, to coordinated harvest, which increase the complexity and also the risks. The IoT in agriculture is a fast-developing field, which can make reviews obsolete quickly. This challenge can be overcome by focussing a critical view on the general principles, main application areas and identify the limitations and challenges. Summarising, the aim of the paper is to provide an up to date novel analytical review of the role of IoT in arable farming, with the following specific objectives: \\u2022 Provide an overview of the current situation of IoT technologies deployed in arable farming. Focussing on the current use of communication technologies and protocols, the generation and analysis of data, and IoT architectures. \\u2022 Outline the different applications and capabilities of IoT in arable farming. \\u2022 Investigate the main challenges encountered by IoT enabling technologies applied to arable farming. \\u2022 Present key potential fields of application where IoT could be employed, as well as future directions of the current trends. The remaining part of this paper is structured as follows: Section 2 describes the methodology used in this review paper. Section 3 provides an overview of the state of the art of IoT technologies used in arable farming; Section 4 presents an outline of the current and potential IoT-based applications in arable farming; Section 5 discusses the challenges and solutions found in its implementation; and lastly, the review closes with Section 6 in which future directions are summarised. 2. Review methodology In order to address the specific objectives identified above, the literature listing from the SCOPUS database of the last 11 years has been reviewed. More precisely, the timeframe investigated was from 1 January 2008 to 31 December 2018, selected as the whole period in which any literature about the subject turned up in the studied database. SCOPUS was selected as the primary literature source as it is a key peer-reviewed research literature database. The specific keywords used in the search criteria where: (Internet of Things OR IoT) AND (agriculture OR farming). To ease the searching process, the keywords needed to be present in at least the title, abstract, highlights or keywords. Additionally, the articles had to be published in English. Articles concerning greenhouse, livestock or permanent crops were excluded from the survey, as were supply chain related articles. However, issues concerning traceability at farm level were included. The survey was performed in a systematic manner following three steps (see Fig. 2): \\u2022 Firstly, a list of 1193 articles meeting the search criteria mentioned above was retrieved from the database. \\u2022 In the second step, by reading the titles, any article that was clearly not related to arable farming was excluded, leaving a list of 293 articles. \\u2022 In the last step, a second screening was made by reading the abstracts, where articles outside the focus of this review were omitted. After this step, 167 articles were studied in detail, from which 69 articles were considered relevant, 27 as partially relevant, while the rest were considered of little relevance. Relevance concerned mainly the connection of the article to the subject studied. The content of a relevant article directly addresses the application of an IoT technology in an arable farming scenario. A partially relevant article studies a certain IoT technology in agriculture in a broader sense. In the distinction made regarding little relevant articles included off-topic, lack of novelty, as well as non-peer-reviewed articles that lacked scientific rigour, e.g. ambiguous information or absence of materials or methods description. Download : Download high-res image (208KB) Download : Download full-size image Fig. 2. Reviewing procedure tree diagram. The final 167 articles studied included: 77 journal papers, 88 conference papers and 4 book chapters, of which 19 were review papers. The final list of articles was complemented with other publications that expanded on some of the IoT related subjects and technologies mentioned in the studied articles, and did not contain the specified keywords. These were found by a targeted search for specific subjects. Lastly, in each article from the final list a special focus was made on the IoT technologies employed, the applications, the challenges encountered and, finally, on potential future perspectives. 3. IoT implementation in arable farming IoT has recently been gaining momentum in the farming industry as it can fulfil the urgent necessity for interoperability across brands, scalability and traceability (Kamilaris et al., 2016). Different technologies are implemented as IoT is still evolving, adapting to a great diversity of uses. To cover the range of technologies, protocols, standards, etc. employed, this review is addressing the layers in the IoT architecture. Three layers normally describe the architecture of the IoT in the literature reviewed (Ferr\\u00e1ndez-Pastor et al., 2018, Khattab et al., 2016, K\\u00f6ksal and Tekinerdogan, 2018, Na and Isaac, 2016, Tzounis et al., 2017, Verdouw, 2016), though some authors divide it into more layers (Ferr\\u00e1ndez-Pastor et al., 2016, Ramundo et al., 2016, Ray, 2017, Talavera et al., 2017, Wang et al., 2014), depending on their definitions. More than three layers can especially be relevant in IoT systems with edge or fog computing, where an edge/fog computing layer can be considered in between the device and network layers (Ferr\\u00e1ndez-Pastor et al., 2016). Even though the naming of the layers also varies depending on the author, there is nonetheless a general trend to divide the layers into device, network and application layers (Fig. 3). Thus, this has been the adapted structure in this review. The device layer consists of the physical objects (things) that are capable of automatic identification, sensing or actuation, and connection to the internet. The network layer communicates the data to a gateway (or proxy server) to the internet (cloud) by the use of communication protocols. And the application layer typically stores and facilitates access for the end-user to the processed/analysed information. Download : Download high-res image (222KB) Download : Download full-size image Fig. 3. IoT architecture represented by device, network and application layer, in which the middleware platform is not always present. The collected data experience diverse stages during their transition from sensors to cloud, interfaces, and occasionally actuators, and these stages have considerable influence on the technologies applied in an IoT context. Six main stages regarding data flow have been identified in the literature reviewed: sensing/perception, communication/transport/transfer, storage, processing, analytics, and actuation and display (Fig. 4). The order of the stages is different depending on the IoT setup employed and the computing techniques used, e.g. fog and edge computing processes the data before communicating it to the cloud, an example of its application in precision farming is given by Ferr\\u00e1ndez-Pastor et al. (2016); while cloud computing processes the data in the cloud, examples of this are given by Hernandez-Rojas, Mazon-Olivo, Novillo-Vicu\\u00f1a, and Belduma-Vacacela (2018) and Na and Isaac (2016). Nonetheless, sensing/perception is normally the first stage, where data are captured by sensors, then the data can follow different paths and does not necessarily go through all the steps listed. In summary, IoT data is identified to be gathered or generated through three main processes: machine generated, which come from sensing devices; process-mediated, i.e. commercial data coming from business processes; and human-sourced, recorded by humans and digitalised later on (Balducci, Impedovo, Informatica, & Moro, 2018). These different sources have an influence on how to process, analyse and use the data in IoT solutions, and this needs to be taken into account in the overall data acquisition planning process. Download : Download high-res image (171KB) Download : Download full-size image Fig. 4. Different agricultural data flows in arable farming. 3.1. Device layer As mentioned above, the device layer consists of the physical objects (things) that are capable of automatic identification, sensing or actuating, and providing connection to the internet. Sensor devices measure and collect one or more parameters automatically and transmit the data wirelessly to the cloud. And, when the devices become actuators, they generally, in turn, receive data from the cloud in order to activate or deactivate some mechanical component, e.g. a valve in an irrigation system. The device layer is also often called perception layer (Tzounis et al., 2017, Zou and Quan, 2017), sensing layer (Na and Isaac, 2016, Wang et al., 2014), or physical layer (Ramundo et al., 2016, Talavera et al., 2017). The devices are constituted of a transceiver, a microcontroller, an interfacing circuit and one or more sensors and/or actuators. The sensor measures a physical parameter, e.g. air temperature that is interpreted and transformed into an equivalent analogue signal, i.e. electric voltage or current, which is then converted by the interfacing circuit, i.e. Analogue-to-Digital Converter (ADC), into a corresponding digital format. Afterwards, the microcontroller, sometimes also in the form of microprocessors or single-board computers (Talavera et al., 2017), collects the data in digital format from one or more sensors through the ADC, and sends them to the transceiver, i.e. a wireless communication module, which communicates the data to a gateway. A comparison of microcontrollers and single-board computers used in IoT in agriculture has been made by Ray (2017). In the case of edge computing, the microcontroller or single-board computer processes the data from one or more sensors before communicating them, with the intention of, for example, reducing the amount of data to be transferred to the cloud and accelerating the data processing (Ferr\\u00e1ndez-Pastor et al., 2016, Sundmaeker et al., 2016). In fog computing the data are processed in the local area network level, i.e. in a fog node or IoT gateway (Ahmed, Abdalla et al., 2018, Ahmed, De et al., 2018, Ferr\\u00e1ndez-Pastor et al., 2018). When employing an actuator, the signal is received by the transceiver, communicated to the microcontroller, where it is then converted to analogue signal by a Digital-to-Analogue Converter (DAC), i.e. the interfacing circuit, or to a digital signal by a Digital-to-Digital Converter, and finally interpreted by the actuator, which acts in accordance to the signal received. In arable farming, when agricultural machinery data are used, i.e. data from sensors and devices mounted on tractors or other agricultural machinery, the data in digital format is normally collected and accessible through the Controller Area Network (CAN) bus in the machine, although in some cases some data are accessible through other ports (Oksanen et al., 2016, Peets et al., 2012). Machine and operator performance information is accessible through the Machine and Implement Control System (MICS) of the machine, which can also be accessed through the CAN bus data. MICS data are used to allow machinery operators and farm managers to monitor and potentially improve the efficiency of their machines, by employing e.g. smart alerts or recommendation systems (Pfeiffer & Blank, 2015). Global Navigation Satellite System (GNSS) data, e.g. Real Time Kinematics GPS (RTK-GPS), are often also available through the CAN bus port, which allows, among others, vehicle monitoring and dynamic optimised route planning Edwards et al., 2017, Villa-Henriksen et al., 2018. Many different sensors and actuators are employed in arable farming. The type of device used depends on the purpose of the system in addition to the technologies implemented in the system. And the number of devices is steadily increasing. The number of IoT device installations in farms is expected to increase globally from 30 million installations in 2015 to 75 million in 2020. Furthermore, data points generated per day and farm are expected to increase from 190000 in 2014 to over half a million by 2020 (Meola, 2016). It was also estimated that by 2018 there would be 10 billion IoT devices employed in agriculture. However, the great amount of data generated is often unused or underutilised (Bennett, 2015), e.g. in countries like Denmark with a relative high ICT adoption in farms, in 2016 only 2\\u20135% of farmers worked actively with the data generated (SEGES, 2016). Even if data usage is still relatively low, it is expected to increase rapidly (Bennett, 2015, Wolfert et al., 2017, World Bank, 2017) An overview about how they are implemented for different purposes is presented in the Applications section. 3.2. Network layer The network layer communicates the data initially to an intermediary platform and eventually to the internet (cloud), and from there to, for example, employed actuators. When the data are transferred to the intermediary platform, it typically uses wireless communication technologies, for instance RFID, WSN with Zigbee, LoRa (Long Range), etc., and more recently Near-Field Communication (NFC) (Kassal et al., 2018, Sundmaeker et al., 2016, Tzounis et al., 2017, Verdouw, 2016). The intermediary platform is normally an internet gateway located in the vicinity of the connected devices, also including sometimes a proxy server, where the data are collected and occasionally processed in order to send the information further to the end user through the internet by the use of e.g. MQTT standards, or HTML or XMPP protocols. The use of Android smart devices or other operating systems is also increasing in popularity among agricultural applications, as they can be employed as a gateway for 3G and 4G networks, and they frequently include other wireless communication technologies, e.g. Bluetooth, Wi-Fi, GPRS and NFC. They also automatically conform to communication standards and protocols, in which way interoperability is increased (Balmos et al., 2016, Ferr\\u00e1ndez-Pastor et al., 2016, Gao and Yao, 2016, Hernandez-Rojas et al., 2018, Villa-Henriksen et al., 2018). In addition, Android and other smart devices can include GNSS and RGB camera sensors, and can relatively easily be programmed for computing data and displaying Graphical User Interface (GUI) applications being able to straightforwardly update the software if necessary. In that manner, Android and similar smart devices are represented in all three IoT layers, i.e. sensing in the device layer, node or gateway in the network layer, and computing data and displaying GUI in the application layer. Furthermore, the automatic software updating possibilities of smart devices allow remote installation of updates with new functionalities, bug fixes, etc. and easily improve the interoperability of the system (Ferr\\u00e1ndez-Pastor et al., 2016). Many different wireless technologies have been applied for diverse purposes in agriculture, depending on economic, accessibility and capability factors. Jawad et al., 2017, Ray, 2017 and Tzounis et al. (2017) have presented good overviews of the specifications of wireless communication technologies implemented in IoT in an agricultural context, which have been here collected in Table 1 and complemented with information from other relevant articles (Alahmadi et al., 2017, Elijah et al., 2018, Kassal et al., 2018, Sinha et al., 2017, Sundmaeker et al., 2016). The great variety of technologies, standards and frequency bands used exposes the relevant interoperability and application challenges found when applying IoT technologies. Potential communication standards for smart farming can be classified into short-range and long-range according to their communication distance, which determines their specific usability in different requirement settings. This is particularly the case in arable farming, where mobile network accessibility can be an issue in many rural areas, and where large farm sizes limit the use of some wireless technologies due to their reduced communication distance and due to the necessity to replace/recharge device batteries on nodes over large areas. These issues are addressed in the challenges section later. Table 1. Wireless communication technologies (adapted from Jawad et al., 2017, Ray, 2017 & Tzounis et al. (2017)). Technology Standard(s) Frequency Data rates Range Power ANT+ ANT + Alliance 2.4 GHz 1 Mb s\\u22121 30\\u2013100 m 1 mW Cognitive Radio IEEE 802.22 WG 54\\u2013862 MHz 24 Mb s\\u22121 100 km 1 W Bluetooth (2.0, 2.1, 3.0) Bluetooth, IEEE 802.15.1 2400\\u20132483.5 MHz 1\\u201324 Mb s\\u22121 10\\u2013100 m 0.1\\u20131 W BLE IoT Inter-connect 2400\\u20132483.5 MHz 1 Mb s\\u22121 10 m 10\\u2013500 mW EDGE 3GPP GSM 850/1900 MHz 384 kb s\\u22121 26 km/10 km 3 W/1 W GPRS 3GPP GSM 850/1900 MHz 171 kb s\\u22121 25 km/10 km 2 W/1 W HSDPA/HSUPA 3GPP 850/1700/1900 MHz 0.73\\u201356 Mb s\\u22121 27 km/10 km 4 W/1 W ISM/SRD860 IEEE 802.11 433 MHz, 863\\u2013870 MHz 200 kb s\\u22121 50 m\\u20132 km Very low LoRaWAN LoRaWAN 868/900 MHz, various 0.3\\u201350 kb s\\u22121 2\\u201315 km Very low LR-WPAN IEEE 802.15.4 (ZigBee) 868/915 MHz, 2.4 GHz 40\\u2013250 kb s\\u22121 10\\u201320 m Low LTE 3GPP 700\\u20132600 MHz 0.1\\u20131 Gb s\\u22121 28 km/10 km 5 W/1 W NB-IoT 3GPP Rel.13 180 kHz DL: 234.7 kb s\\u22121 DI: 204.8 kb s\\u22121 Using LTE/4G base stations Low NFC ISO/IEC 13157 13.56 MHz 424 kb s\\u22121 0.1\\u20130.2 m 1\\u20132 mW RFID Many standards 13.56 MHz 423 kb s\\u22121 1 m 1 mW SigFox SigFox 908.42 MHz 10\\u20131000 b s\\u22121 30\\u201350 km N/A THREAD IEEE 802.15.4 2400\\u20132483.5 MHz 251 kb s\\u22121 11 m 2 mW Weightless-N/W Weightless SIG 700/900 MHz 0.001\\u201310 Mb s\\u22121 5 km 40 mW/4 W WiFi IEEE 802.11 a/c/b/d/g/n 2.4, 3.6, 5, 60 GHz 1 Mb s\\u22121\\u20136.75 Gb s\\u22121 20\\u2013100 m 1 W WiMAX IEEE 802.16 2 GHz\\u201366 GHz 1 Mb s\\u22121\\u20131 Gb s\\u22121 (Fixed) 50\\u2013100 Mb s\\u22121 <50 km N/A ZigBee IEEE 802.15.4 2400\\u20132483.5 MHz 250 kb s\\u22121 10 m (100m) 1 mW Z-Wave Z-Wave 908.42 MHz 100 kb s\\u22121 30 m 1 mW 2G (GSM) GSM, CDMA 865 MHz, 2.4 GHz 50\\u2013100 kb s\\u22121 Mobile network area Medium 3G & 4G UMTS, CDMA2000 865 MHz, 2.4 GHz 0.2\\u2013100 Mb s\\u22121 Mobile network area Medium 5Ga 3GPP, ITU IMT-2020 0.6\\u20136 GHz, 26, 28, 38, 60 GHz 3.5\\u201320 Gb s\\u22121 (peak rates 10\\u2013100 Gb s\\u22121) Mobile network area Medium 6LoWPAN IEEE 802.15.4 908.42 MHz or 2400e2483.5 MHz 250 kb s\\u22121 100 m 1 mW a Not yet publicly available. A WSN is formed by pervasive devices called motes or sensor nodes, which integrate sensors and actuators that communicate wirelessly forming a spatial network (Hernandez-Rojas et al., 2018, Jawad et al., 2017, Tzounis et al., 2017). In a WSN, base stations act as gateways forwarding the data to the cloud. Different communication technologies support different network node architectures, e.g. star, tree or mesh. Depending on the application, different wireless communication technologies are employed in a WSN as each has different node architecture possibilities, data rates, ranges, standards, among others, with the use of ZigBee, LoRa, Bluetooth/BLE, WiFi and SigFox being relatively common in agriculture. In arable farming, BLE has for example been employed for soil and air monitoring and irrigation control (Hernandez-Rojas et al., 2018); ZigBee was used in a WSN for monitoring soil conditions and actuating an irrigation system (Mafuta et al., 2012) and crop monitoring (Zhai, 2017); and LoRa for air and water temperature of rice paddy fields (Tanaka, 2018) and smart irrigation control (Zhao, Lin et al., 2018, Zhao, Lucani et al., 2018). In order to cover larger distances, GPRS is appropriate and has been used for irrigation control (L\\u00f3pez-Riquelme et al., 2017), and for remote maintenance of machinery (Miettinen, Oksanen, Suomi, & Visala, 2006). GPRS, or other technologies, such as LTE, or 3G/4G, are also commonly used at the gateway to transmit data to the cloud. Regarding other less common communication technologies used in WSNs, RFID can be integrated into a WSN too by connecting the RFID tag readers to a radio-frequency transceiver (Costa et al., 2013). Passive and active RFID technologies are used to a great extent in agricultural research and industry (Ruiz-Garcia & Lunadei, 2011), especially for animal production (e.g. Kamilaris et al., 2016), as well as vegetable or fruit product traceability (e.g. Kodali, Jain, & Karagwal, 2017); however, in arable farming only few examples have been found: e.g. RFID tags used for irrigation scheduling (Vellidis, Tucker, Perry, Kvien, & Bednarz, 2008), for agrochemical traceability (Peets, Gasparin, Blackburn, & Godwin, 2009), for vehicle monitoring (Sjolander, Thomasson, Sui, & Ge, 2011), and even on a prototype for soil temperature monitoring (Hamrita & Hoffacker, 2005). Regarding NFC, no concrete examples of NFC used in arable farming have been found in the literature reviewed. Finally, the latest generation of mobile communications, i.e. 5G, has higher data rates, large coverage areas, higher peak throughput, and also improved flexibility, which can open new possibilities and may solve some of the challenges encountered by many IoT solutions (Alahmadi et al., 2017, Marsch et al., 2016). 5G allows new options for monitoring rural areas with no previous infrastructure for Internet connection (Faraci, Raciti, Rizzo, & Schembra, 2018). 5G can also improve vehicle-to-vehicle or vehicle-to-anything communication in e.g. logistics solutions, due to its low latency and new frequency bands (Marsch et al., 2016). A challenge for the 5G networks will be the great increase in devices to support once IoT becomes a standard solution not only in agriculture, but also in any sphere of everyday life. 3.3. Application layer The application layer is crucial in an IoT context as it is this layer that actually adds value to the sensed and communicated data through directly controlling devices, supporting farmers' decision making, etc. In this layer, several important services occur such as data storage, data analytics, data access through an appropriate Application Programming Interface (API), as well as possibly a user interfaced software application. The layer may also include middleware platforms that aid handling the heterogeneous cloud data improving interoperability. Data storage can be cloud based, i.e. on multiple servers, or more local based, where data are stored in different types of databases, depending on the application and design. Even if relational databases, such as Structured Query Language (SQL) databases (Gao and Yao, 2016, Goap et al., 2018, Ray, 2017, Wang et al., 2014), MySQL (Kaloxylos et al., 2014), or PostgreSQL (Mazon-Olivo, Hern\\u00e1ndez-Rojas, Maza-Salinas, & Pan, 2018) are employed in some of the reported applications in the reviewed articles, non-relational databases, such as Not only SQL (NoSQL), or also SPARQL, a semantic query language based database, are gaining attention due to their flexibility and scalability, especially when dealing with Big Data. Their ability to store and manage large amounts of heterogeneous data makes them suitable in many IoT agricultural contexts (Huang and Zhang, 2017, Kamilaris et al., 2017). Examples of NoSQL employed in agriculture are Cassandra (Huang & Zhang, 2017), Dynamo (Xian, 2017), HBase (Ray, 2017, Wang et al., 2014) and MongoDB (Mart\\u00ednez et al., 2016). An example of SPARQL has been given by Jayaraman et al. (2016). Data analytics can be achieved by cloud computing, where computer resources are managed remotely to analyse data, often Big Data, or by distributed computing, e.g. edge and fog computing. Cloud computing has the advantage that it provides high quality services that allow independent execution of multiple applications as if they were isolated, even if they are on the same platform, e.g. in data centres, which is especially relevant when dealing with Big Data (Hernandez-Rojas et al., 2018, Mart\\u00ednez et al., 2016, Tzounis et al., 2017). However, cloud computing techniques mostly rely on general purpose cloud providers that do not comply with specific agricultural service requirements (L\\u00f3pez-Riquelme et al., 2017) and can experience latency issues, which are not acceptable in IoT solutions where monitoring, control and analysis require fast performance (Ferr\\u00e1ndez-Pastor et al., 2018). Examples of application of cloud computing related to arable farming are given by Khattab et al., 2016, Na and Isaac, 2016 and L\\u00f3pez-Riquelme et al. (2017). Khattab et al. (2016) present an IoT architecture with a cloud-based back-end where weather and soil data are processed and analysed for automatic activation of irrigation and spraying actions. Na and Isaac (2016) describe a human-centric IoT architecture with a list of cloud services, such as language translation, data simplification or updated market price information. And L\\u00f3pez-Riquelme et al. (2017) use FIWARE components for a cloud service for smart irrigation tasks, focussing on the benefits of using FIWARE as cloud provider. Regarding Big Data analysis and Big Data in general in an agricultural context, Kamilaris et al. (2017) and Wolfert et al. (2017) respectively have performed exhaustive reviews on the subject. The use of IoT middleware platforms is gaining interest due to its potential for solving different challenges found in the application of IoT, especially interoperability. IoT middleware platforms try to simplify the complex communication through the cloud due to heterogeneity of devices, communications and networks, by using enablers like standardised APIs and protocols (Jayaraman et al., 2016, Mart\\u00ednez et al., 2016, O'Grady and O'Hare, 2017). Examples of these are HYDRA, UBIWARE, UBIROAD, UBIDOTS, SMEPP, SIXTH, Think Speak, SensorCloud, Amazon IoT and IBM IoT, with focus on context aware functionality; SOCRADES, GSN and SIRENA, with more focus on security and privacy; Aneka, WSO2, PubNub, SmartFarmNet and FIWARE, with a wider services-oriented approach; and projects like IoT-A, OpenIoT, or ArrowHead (Gill et al., 2017, Jayaraman et al., 2015, Jayaraman et al., 2016, Kamilaris et al., 2016, Mart\\u00ednez et al., 2016, Ray, 2017, Sundmaeker et al., 2016). Even if all these and more solutions are found in the IoT market, an intelligent middleware solution that addresses most issues observed in smart farming successfully is yet to be implemented (Jayaraman et al., 2016, Mart\\u00ednez et al., 2016, Sundmaeker et al., 2016). However, FIWARE (Ferreira et al., 2017, L\\u00f3pez-Riquelme et al., 2017, Mart\\u00ednez et al., 2016, Rodriguez et al., 2018) and SmartFarmNet (Ferr\\u00e1ndez-Pastor et al., 2018, Jayaraman et al., 2016) have been implemented effectively for precision and smart farming applications. In order to communicate data across platforms and IoT devices, ensuring interoperability, APIs are essential. These should adapt to evolving or new standards in order to ensure a longer life span, which may become a limitation if the APIs are not updated. It is through the APIs that data are made available for the IoT applications (e.g. Goap et al., 2018, Hernandez-Rojas et al., 2018). These services may include tracing, monitoring, event management, forecasting or optimisation for agricultural activities and products. These applications related to arable farming are described in the next section. 4. Current and potential applications Multiple applications can be derived from the implementation of IoT in arable farming. These applications can always be conceptualised into the three IoT layers described previously, and are not to be confused with the application layer. Elaborations of the reviewed articles show that the applications have been differentiated and categorised as follows: monitoring, documentation, forecasting and controlling. Monitoring refers to timely sensing of very diverse parameters and is mostly the initial point of entry for other applications. Documentation covers the storing of sampled data for later use in e.g. farm management or traceability of produce. Forecasting employs different sources of data through precisely designed analytic methods for predicting concrete events. And controlling is the result of active monitoring, where processed data are used to automatically activate and control actuators in a predefined manner. A summarising table collects all the IoT applications in arable farming described in this chapter (Table 2). Most IoT-based systems include at least two of these applications and isolated applications are seldom seen. In addition, special attention has been paid to FMIS and associated decision support to improve operations and production processes involving vehicle positioning analytics, optimisation and logistics, which are key elements in arable farming (Bochtis et al., 2011, Bochtis et al., 2014) and have consequently got a section of their own. Table 2. IoT applications in arable farming. Applications Examples References Monitoring Crop Leaf area index Bauer and Aschenbruck (2018) Plant height and leaf parameters Okayasu et al. (2017) Soil Moisture (Brinkhoff et al., 2017, Kodali and Sahu, 2016) Chemistry Kassal et al. (2018) Irrigation water pH and salinity Popovi\\u0107 et al. (2017) Weather Air (T, atm and RH), rainfall, radiation, and wind speed and direction Yan et al. (2018) Remote sensing Estimating crop biomass and N content N\\u00e4si et al. (2018) Irrigation scheduling and plant disease detection Khanal et al. (2017) Machinery Vehicle position and yield data Oksanen et al. (2016) Machine performance (Miettinen et al., 2006, Pfeiffer and Blank, 2015) Farm facilities Crop storage temperature and moisture levels (Green et al., 2009, Juul et al., 2015) Environment Nutrient leaching Burton et al. (2018) Contaminants Severino et al. (2018) Emissions Manap and Najib (2014) Documentation and traceability Machinery Field mapping Fountas, S\\u00f8rensen et al., 2015 Yield mapping for fertilisation planning Lyle et al. (2014) Soil mapping for site-specific amendment measures (Godwin and Miller, 2003, McBratney et al., 2003) Remote sensing Mapping crop development (Khanal et al., 2017, N\\u00e4si et al., 2018, Viljanen et al., 2018) Mapping soil texture and residue coverage Khanal et al. (2017) Supply chain Agri-food traceability (Bochtis and S\\u00f8rensen, 2014, Pesonen et al., 2014) Forecasting Machine learning models Forecasting max. and min. T at field level Aliev (2018) Estimating levels of P in the soil (Estrada-L\\u00f3pez et al., 2018) Forecasting soil moisture Goap et al. (2018) Plant disease forecasting (Aasha Nandhini et al., 2017, Jain et al., 2018) Predicting irrigation recommendations Goldstein et al. (2018) Frost prediction (Diedrichs et al., 2018, Moon et al., 2018) Forecast of harvest and fertilisation dates Viljanen et al. (2018) Classical models Soil moisture and contaminant dynamics forecasting for irrigation scheduling Severino et al. (2018) Fungal disease forecast in cereals (El Jarroudi et al., 2017, M\\u00e4yr\\u00e4 et al., 2018) Forecasting field trafficability and workability for field operations Edwards et al. (2016) DAISY soil-crop-atmosphere model Abrahamsen and Hansen (2000) RUSLE soil erosion model Renard et al. (1991) Controlling Irrigation Fully autonomous irrigation scheme Goap et al. (2018) Machinery Variable rate fertilisation Peets et al. (2012) Site-specific weed control Christensen et al. (2009) In-row cultivation in precision seeding Midtiby et al. (2018) Adaptive route planning in field operations (Edwards et al., 2017, Seyyedhasani and Dvorak, 2018, Villa-Henriksen et al., 2018) Autonomous vehicles & robots Operations of autonomous vehicles Bechar and Vigneault (2016) In-field obstacle detection Christiansen et al. (2016) 4.1. Monitoring Automatic monitoring is the obvious first step in IoT applied to agriculture. Strategically placed sensors can automatically sense and transmit data to the cloud for further documentation, forecasting or controlling applications. Sensors are used to monitor crop parameters such as leaf area index (e.g. Bauer & Aschenbruck, 2018), plant height and leaf colour, size and shape (e.g. Okayasu et al., 2017); soil parameters such as soil moisture (e.g. Brinkhoff et al., 2017, Kodali and Sahu, 2016) or soil chemistry (e.g. Kassal et al., 2018); irrigation water parameters such as pH and salinity (e.g. Popovi\\u0107 et al., 2017); or weather parameters such as air temperature, air pressure, air relative humidity, rainfall, radiation, wind speed and wind direction (e.g. Yan et al., 2018). In addition, remote sensing can also be employed, i.e. instead of sensors placed in the field they are installed on satellites or Unmanned Aerial Vehicles (UAV). However, these measurements mostly require some form of processing and interpretation as the values sampled are not directly related to the targeted parameters. An example of monitoring through remote sensing is the estimation of crop biomass and nitrogen content by the use of hyper- and multispectral images (N\\u00e4si et al., 2018), or the use of thermal remote sensing, which has been applied for e.g. irrigation scheduling or plant disease detection (Khanal, Fulton, & Shearer, 2017). Furthermore, agricultural machinery can also be remotely monitored, e.g. vehicle position and yield data (Oksanen et al., 2016), or machine performance (Miettinen et al., 2006). This is especially relevant with the increasing appearance of autonomous vehicles and robots in agriculture (Sundmaeker et al., 2016). Finally, at farm level the storage of crops can also be monitored to ensure the correct control of, for example, temperature and moisture, and avoid losses due to damage (Green et al., 2009, Juul et al., 2015). Environmental impact indicators should be integrated into farm monitoring applications, so that leaching (Burton, Dave, Fernandez, Jayachandran, & Bhansali, 2018), contaminants (Severino, D\\u2019Urso, Scarfato, & Toraldo, 2018) or emissions (Manap & Najib, 2014) are addressed too. 4.2. Documentation and traceability Collected operations and process data once stored can be used for documentation. Documentation is usually the natural application of monitored data but it must be noted that it can also include other types of sampled data, such as manually input or documentation of performed control actions (S\\u00f8rensen, Pesonen, Bochtis, Vougioukas, & Suomi, 2011). The data are stored as raw data or as processed data at different levels. Documentation is essential for decision-making, controlling or analytics, and is an indispensable element in FMIS (Kaloxylos et al., 2014). Mapping is also a form of documentation where data are spatially projected onto a map. On-the-go sensors installed on vehicles and implements can be used for automated field mapping (Fountas, S\\u00f8rensen et al., 2015), e.g. yield mapping used for later fertilisation planning (Lyle, Bryan, & Ostendorf, 2014), or soil mapping for site-specific amendment measures (Godwin and Miller, 2003, McBratney et al., 2003). Remote sensing can also be used for mapping crop development (Khanal et al., 2017, N\\u00e4si et al., 2018, Viljanen et al., 2018), or soil texture and residue coverage (Khanal et al., 2017). Remote sensing is becoming a popular tool for monitoring and mapping, but is yet to be proven feasible for all its potential applications. When documentation data sets extend beyond the farm level so that they can be traced throughout the supply chain, it is often referred as traceability and this notion is a key element in agri-food supply chain management as a measure to satisfy, for example, consumer demands (Bochtis and S\\u00f8rensen, 2014, Pesonen et al., 2014). 4.3. Forecasting Forecasting is one of the fundamental functions for decision making that IoT brings to agriculture. Access to \\u201creal-time\\u201d data and historical data is used for forecasting events that require some form of action for managing successfully the crop or field operation. Therefore, both monitoring and documentation are important prerequisites for enabling forecasting. Forecasting is employed as preventive measures that require some action due to a predicted event, e.g. weeding, irrigating or harvesting. Machine learning and scientific modelling are examples of tools employed for forecasting. Different machine learning models have been employed, e.g. Artificial Neural Networks for forecasting maximum and minimum temperatures at field level (Aliev, 2018) or for estimating levels of phosphorus (P) in the soil (Estrada-L\\u00f3pez, Castillo-Atoche, V\\u00e1zquez-castillo, & S\\u00e1nchez-Sinencio, 2018); support vector regression method for forecasting soil moisture (Goap et al., 2018) or plant disease detection (Aasha Nandhini, Hemalatha, Radha, & Indumathi, 2017); gradient boosting for predicting irrigation recommendations (Goldstein, Fink, & Meitin, 2018); Bayesian networks and random forest for frost prediction (Diedrichs, Bromberg, Dujovne, Brun-laguna, & Watteyne, 2018); multiple linear regression and random forest in estimating yield and fertilisation requirements for forecasting harvest and fertilisation dates (Viljanen et al., 2018); or also for frost prediction using four different machine learning algorithms: decision tree, boosted tree, random forest, and regression (Moon, Kim, Zhang, & Woo, 2018). A rather different forecasting approach was employed by Jain, Sarangi, Bhatt, and Pappula (2018), where three different models, i.e. random forest, support vector machine and artificial neural network were used for forecasting diseases and at the same time for adaptive data collection from the network of nodes in order to reduce data traffic and energy consumption of the network. Summarising, IoT is allowing the sampling of large amounts of data, which can be employed as training data by the machine learning algorithms to build predictive mathematical models. Machine learning is opening new possibilities for effectively forecasting events in arable farming, which might change the very nature of decision making in agriculture. Scientific modelling has also been employed for forecasting in an IoT context, e.g. soil moisture dynamics and contaminant migration forecasting using soil sensor data and precipitation forecasts for irrigation scheduling (Severino et al., 2018); fungal disease forecast in winter wheat (El Jarroudi et al., 2017) and barley (M\\u00e4yr\\u00e4, Ruusunen, Jalli, Jauhiainen, & Leivisk\\u00e4, 2018); or forecasting field trafficability and workability for field operations (Edwards, White, Munkholm, S\\u00f8rensen, & Lamand\\u00e9, 2016). These modelling tools have an important role in agriculture as they are conscientiously developed and validated by the scientific community, and can forecast events for which machine learning models are very limited. There is also considerable potential for integrating existing and acknowledged modelling tools such as the soil-crop-atmosphere system model DAISY (Abrahamsen & Hansen, 2000) or the soil erosion model RUSLE (Renard, Foster, Weesies, & Porter, 1991) into an IoT solution. Many of these solutions can make agriculture in general, and arable farming in particular, more resource efficient, e.g. through smart irrigation, as well as environmentally friendly, e.g. by smart pest and disease management. 4.4. Controlling In IoT, controlling is the result of active monitoring in an automated system, where the monitored variables are automatically adjusted to, for example, predefined thresholds. Forecasting can also play an important role in controlling. This is, for example, the case in smart irrigation systems, where irrigation is activated before drought damage in the crop is recognised, thus reducing yield losses. Goap et al. (2018) employed real-time sensing of soil moisture and soil temperature in combination with weather forecasts to control a fully autonomous irrigation scheme. Sensors on-the-go installed in tractors and implements can also be used to control e.g. variable rate fertilisation (Peets et al., 2012), site-specific weed control technologies (Christensen et al., 2009), or in-row cultivation controlled by plant patterns in precision seeding (Midtiby, Steen, & Green, 2018). Controlling is crucial in smart farming as it allows the automation of systems, especially considering the operations of autonomous vehicles and robots in the fields (Bechar & Vigneault, 2016), where site-specific actions and sensing-based safety systems will play an important role, e.g. for in-field obstacle detection for autonomous vehicles (Christiansen, Nielsen, Steen, J\\u00f8rgensen, & Karstoft, 2016). 4.5. FMIS FMIS can be defined as systems that store and process farm-related collected data and provide decision supporting tools for farm management (Paraforos et al., 2016). FMIS assist farmers in the execution and documentation of farm activities, their evaluation and optimisation, as well as in strategic, tactical and operational planning of the farm operations (Kaloxylos et al., 2014). FMIS are consequently systems that can encapsulate all the applications previously described, and are vital elements in smart farm management. However, the adoption of FMIS targeted to the new IoT technologies is slow. A study published in 2015 showed that most FMIS architectures used at that time had been designed in the 1980s by researchers. This may explain why most FMIS currently have a structure and an architecture that is not suitable for distributed and service oriented decision support required for supporting precision agriculture and smart farming solutions, e.g. 75% of FMIS are still PC-based, and functionalities regarding traceability, quality assurance and agronomic best practice estimate are still missing or in their initial development stages in most commercial FMIS (Fountas, S\\u00f8rensen et al., 2015). FMIS are key in smart farming and they should support automatic data acquisition, monitoring, documenting, planning and decision making (K\\u00f6ksal & Tekinerdogan, 2018). The latest research on IoT-based FMIS is expected to become part of the commercial FMIS available in the near future and will cover different needs across the supply chain and needs of IoT-based agriculture as a whole, as well as complying with standards ensuring interoperability between systems. In addition, decision support systems (DSS) are essential in dealing with Big Data and assisting the farm manager in management and decision making in tasks such as farm financial analysis, business processes or supply chain functions (Fountas, Carli et al., 2015, Kaloxylos et al., 2012). In order to design an up-to-date FMIS, it is beneficial to make preliminary use of dedicated system analysis methodologies, such as soft system methodologies (SSM), for identifying required changes and constraints and proposing solutions, followed by a later hard system modelling for designing the required specifications and components of the system (S\\u00f8rensen et al., 2010, Fountas, S\\u00f8rensen et al, 2015). It is also necessary to base FMIS on the cloud as it allows interconnection with diverse additional services (Kaloxylos et al., 2014). This development points out the inevitable need for standardisation of APIs in order to achieve interoperability among applications and services as part of the FMIS. New technologies such as distributed management systems can also enhance the capabilities of FMIS to a great extent (Fountas, S\\u00f8rensen et al., 2015). Furthermore, the introduction of agricultural moving robots in the near future, as well as the wireless and automatic control and monitoring of agricultural machinery, also needs to be considered in the design and development of FMIS (Fountas, S\\u00f8rensen et al, 2015, Paraforos et al., 2016). The future FMIS will also be capable of emulating farmers different work habits, as the system will automate certain tasks previously performed by farmers, which will require additional training (S\\u00f8rensen et al., 2011). Consequently, it is important to provide supportive adoption and transition strategies for conventional farming to convert into smart farming (K\\u00f6ksal & Tekinerdogan, 2018). Examples of current FMIS employed in arable farming are offered by different technology providers: machine manufacturers, institutions or targeted private companies. Some manufacturers provide their own farm management tools, such as Agricultural Management Solutions (AMS) from John Deere, or Precision Land Management (PLM) from New Holland. Across brands some FMIS have a more local approach, e.g. the Dutch Akkerweb developed by Wageningen University and Research, while other commercial solutions have a global approach, e.g. 365FarmNet, Agworld or FarmWorks. 4.6. Vehicle navigation, optimisation and logistics Navigation systems are widely used in arable farming with the successful implementation of auto-steering systems in tractors and harvesters. However, IoT-based solutions are still in their early stages. IoT-based field operation monitoring (Oksanen et al., 2016) or monitoring of motor and machine performance (Pfeiffer & Blank, 2015) have been effectively implemented on harvesting operations. Commercial examples of agricultural telematics are Trimble's Connected Farm, AGCO's AgCommand, John Deer JDLink, New Holland's PLM Connect or CLAAS\\u2019 telematics; however, they are all closed systems, which limits greatly the possibilities of the IoT technologies, especially interoperability (Oksanen, Piirainen, & Seilonen, 2015). Regarding optimised route planning, pre-planning harvest operations based on field data using simulation models can improve the harvest capacity of the vehicle or fleet saving working hours as well as fuel consumption (Bakhtiari et al., 2011, Bochtis and S\\u00f8rensen, 2009, Busato et al., 2007, Jensen et al., 2012, Zhou et al., 2014). However, field complexity and vehicle fleet size can become major hurdles for the algorithms employed (Seyyedhasani et al., 2019, Skou-Nielsen et al., 2017). The accessibility of field and harvest data can be eased by IoT technologies that allow automated data collection and sharing via common communication protocols and standards, in interoperable data formats, with compatible data model hierarchies; however, this is not always the case (Tzounis et al., 2017). IoT also allows cloud or fog computing to be employed to solve the high computational requirements of these route planning models (Seyyedhasani et al., 2019), even though the computing can also be achieved at the edge (Villa-Henriksen et al., 2018). Data communication costs, latency problems and unstable mobile connectivity may pose important challenges for route planning applications that rely only on cloud computing, making mobile edge computing more adequate and robust for these systems. Nevertheless, true IoT-based dynamic route planning is still in its infancy but gaining increasing attention, especially with the arrival of agricultural robots (Bechar and Vigneault, 2016, Kayacan et al., 2015). Concerning its application, until recently, harvest logistics has employed field sampled data, i.e. boundaries, obstacles, gates, etc., to optimise the route of the vehicles involved in the operation statically (e.g. Bakhtiari et al., 2011, Jensen et al., 2012), where the complete routes of all vehicles are planned a priori. Nevertheless, these plans often do not comply with real-world challenges as they do not adapt to variating inputs, e.g. vehicle speed changes or in-field yield variations, or to unforeseen situations, e.g. machine breakdowns, eventual out of field delays, non-trafficable wet spots, undefined obstacles, etc. There is consequently the need to integrate route optimisation and operation logistics in IoT systems, where the optimisation can adapt dynamically to varying input and unforeseen events. It is only in the last few years that harvest logistics really started adapting dynamically to parameters such as vehicles' behaviour or in-field yield variations (Edwards et al., 2017, Seyyedhasani and Dvorak, 2018, Villa-Henriksen et al., 2018). Today, new possibilities for optimising infield operations arrive with the large amount of data available via internet, e.g. remote sensing data or other collected spatial data. These could be adaptive planning based on trafficability maps for reducing soil compaction or avoiding vehicles getting stuck in wet spots; or selective harvesting based on predicted grain quality maps, which is expected to increase the value of the crop harvested. 5. Challenges and solutions When implementing IoT in arable farming, as well as in other contexts, diverse challenges limit or affect the performance of the systems employed. The challenges identified in the literature reviewed (Fig. 5) can indicate which areas need to be taken into account when designing an IoT-based system or point out areas that require further research. However, the results presented in the figure are indicative and do not necessarily describe the importance of the challenges included, especially because of the multiple applications and implementation designs that are conceivable in arable farming. Any of the challenges can become crucial in different setups, and are therefore described. In addition, all challenges can be related to or have consequences for other challenges. Download : Download high-res image (464KB) Download : Download full-size image Fig. 5. Percentage of challenges mentioned by the literature reviewed, divided by time periods and grouped in IoT layers. Interoperability, in general, is a major hurdle in the application of IoT. There are different dimensions related to it: technical, syntactical, semantic and organisational (Serrano et al., 2015, Veer and Wiles, 2008). Technical interoperability refers mostly to the communication protocols which affect the hardware and software components implemented. Syntactical interoperability is usually related to data formats, their syntax and encoding. Semantic interoperability concerns the interpretation of data contents, i.e. the meaning of the information exchanged. And organisational interoperability involves intercommunication of meaningful information across organisations regardless of information systems and infrastructures in a world-wide scale. As interoperability is such a generic term, in this section, technical interoperability has been addressed as part of the communication protocol challenge, syntactical and semantic interoperability have been included under the data heterogeneity challenge, and organisational interoperability have been described under the scalability challenge. 5.1. General challenges 5.1.1. Revenue and affordability Often the investment for establishing an IoT-based solution is high and as such challenging for small-scale farmers, while larger farms can more easily acquire IoT-based technologies when investing in new equipment (Brewster et al., 2017). The uncertainty regarding required costs, e.g. fuel or water allocations, and selling prices of the product give little margin for many farmers for investing in new technologies (Higgins et al., 2017). Trust plays an important role when investing in IoT systems, and relieving the perceived risks by demonstrating the revenues from their adoption is essential (Ferr\\u00e1ndez-Pastor et al., 2016, Jayashankar et al., 2018). For example, in Europe 70% of all fertilising and spraying machinery is equipped with at least one precision agriculture technology, but only 25% of farmers actually use precision agriculture components on their farms (Say, Keskin, Sehri, & Sekerli, 2017). Technology providers need to increase the perceived value by demonstrating the financial return from IoT in order to diminish the perceived risk of adoption many farmers have. Technology providers need also to provide robust tools that are aligned with farmer needs and practices in order to gain acceptance and trust of IoT technologies. These technologies need to reduce the workload, assist in decision making and improve the efficiency of the targeted practice. Additionally, technology providers need to develop interoperable and flexible solutions that can easily be integrated and comply with accepted standards. Governments can also incentivise IoT adoption by policies and regulations, especially regarding documentation and traceability as ICT eases paperwork and bureaucracy. A reduction in the percentage of mentions regarding this challenge (see Fig. 5) could indicate that IoT is being more adopted in arable farming. In addition, IoT is likely to reshape the arable farming business. The implementation of monitoring and control of farming operations are generating substantial amounts of valuable data that are essential for the business of technology providers. The way farmers will dive into the data economy, i.e. connecting their data to work in vertical and horizontal networks beyond the farm, will have an effect on their business models, as well as on the business models of technology providers. The point of view of the farmer's business regarding IoT has not been fully addressed in the literature reviewed and will require further investigation. 5.1.2. Data heterogeneity The diverse data sources and sensor manufacturers imply use of different unit systems, data structures and nomenclatures in different data formats, which result in reduced syntactical and semantic interoperability among IoT environments. Sensor data can be encoded in binary, or represented in formats such as json, xml, text (e.g. csv), shapefile, or even proprietary formats. The heterogeneity of data types and formats can also affect the performance of a protocol employed for communicating the information. Furthermore, this challenge becomes critical in situations such as system integration or sharing data with other systems (e.g. FMIS), which could imply developing data conversion tools or even redesign of the IoT setup. The use of standardised formats can help with this challenge. Some attempts have been made at producing standards or standardised formats that cover the great heterogeneity of agricultural data, e.g. ISO 11783 (ISOBUS) developed by the Agricultural Industry Electronics Foundation (AEF) for tractors and agricultural machinery, which is very relevant in arable farming (Fountas, S\\u00f8rensen et al, 2015, Miettinen et al., 2006, Oksanen et al., 2015, Peets et al., 2012) or AgroXML developed by the Association for Technologies and Structures in Agriculture (KTBL) mainly for FMIS (Kaloxylos et al., 2014, K\\u00f6ksal and Tekinerdogan, 2018, O'Grady and O'Hare, 2017, Peets et al., 2012). These are now being integrated by the non-profit organisation AgGateway through the ADAPT framework and SPADE project for seamlessly communicating agricultural machinery data to FMIS, trying to enhance the existing standards and as a consequence improve interoperability (Brewster et al., 2017). A drawback of comprehensive data models, which try to describe all attributes of agricultural data, is that they become too cumbersome to handle in many applications. Finally, the use of middleware platforms applicable in smart farming, e.g. FIWARE or SmartFarmNet, can also reduce the problems caused by data heterogeneity (Ferr\\u00e1ndez-Pastor et al., 2018, Ferreira et al., 2017, O'Grady and O'Hare, 2017, Serrano et al., 2015). 5.1.3. Scalability and flexibility Organisational interoperability is a key element concerning scalability and flexibility (Serrano et al., 2015, Tzounis et al., 2017, Verdouw, 2016). Many of the systems described in the literature reviewed are centralised, closed, difficult to integrate in other existing platforms or difficult to implement on larger scales, different farming systems or geographical areas. They are also challenging to integrate beyond the farm level and across the supply chain in order to provide agri-food safety and traceability. The use of standardised dynamic protocols, such as SOAP protocol (cloud-based infrastructures with extensible ontologies that cover the broad and diverse agricultural production systems and environments), fast and reliable APIs (e.g. RESTful) and middleware platforms applicable for smart agriculture, such as FIWARE with its generic enablers, are tools that are employed to achieve organisational interoperability and make the system developed more scalable and flexible (Ferreira et al., 2017, L\\u00f3pez-Riquelme et al., 2017, O'Grady and O'Hare, 2017, Serrano et al., 2015). Service-Oriented Architectures (SOA) also bring possibilities to effectively integrate ecosystems through open and standardised interfaces, increasing organisational interoperability (Kaloxylos et al., 2014, K\\u00f6ksal and Tekinerdogan, 2018, Kruize et al., 2016, Pesonen et al., 2014, S\\u00f8rensen and Bochtis, 2010). Scalability and flexibility may also refer to WSNs in the literature, to their capacity to support an increasing number of devices/nodes, with the network architecture, the gateway and protocols used being the main constrains (Elijah et al., 2018). This challenge has been considered under the network size challenge. 5.1.4. Robustness and fault tolerance Many different factors can affect the overall robustness and fault tolerance of a system. Robust wireless connectivity is an important limitation in many setups (Oksanen et al., 2016, Vuran et al., 2018). In the design of an IoT-based solution dealing with faults, errors and unforeseen events need to be taken into account in order to ensure the reliability of the system. Many of these issues are related to the other challenges presented here and can be handled at the device level, but also need to be thought of in the overall IoT system design (Ferreira et al., 2017, Ray, 2017). 5.1.5. Complexity The agricultural system is complex and can be challenging to work with. It is complex not only because of the multifaceted nature of the physical, chemical and/or biological processes in the soil-crop-air system, but also because of the technical complexity of hardware and software interacting with it. Depending on the novelty of the IoT technology implemented and the background of the developer and user, the systems can become more or less complex. For example, software and hardware incompatibilities can challenge its implementation and integration (Ferr\\u00e1ndez-Pastor et al., 2016), as well as many other challenges, e.g. the great field task diversity in arable farming, that can add complexity to the system. Technical knowledge can become a major hurdle for the implementation of IoT in farms, and it is therefore important that user-friendliness and plug-and-play basis have a high priority for the technology providers (Sundmaeker et al., 2016, Zou and Quan, 2017). Complexity should be an issue for the technology provider and not for the customer. In addition, the co-created development and implementation of IoT systems in agriculture by a multi-actor approach is needed to overcome the complexity at different levels of integrating IoT in agriculture. Good examples of this are the European Union supported research and development efforts through multi-actor large-scale pilot projects, such as IoF2020 (Sundmaeker et al., 2016, Verdouw et al., 2017), AIOTI (P\\u00e9rez-Freire & Brillouet, 2015), SmartAgriFood (Kaloxylos et al., 2012), SMART AKIS (Djelveh & Bisevac, 2016), or more recently SmartAgriHubs (Chatzikostas et al., 2019). 5.1.6. Lack of products In the early stages of precision agriculture and IoT in agriculture, products that integrated agronomy and ICT engineering were lacking, which hindered their adoption (Ferr\\u00e1ndez-Pastor et al., 2016, Kitchen and Roger, 2007). The large scales and diversity of environments in arable farming can challenge the products used even more than in controlled environments, as they are to be modelled to describe larger areas, send information through larger distances and be exposed to harsher environments. Even if Figure 5 shows lack of references in the last couple of years, it is still relevant for some applications, e.g. for in-situ real-time soil nutrient sensing is still a real challenge, especially regarding calibration (B\\u00fcnemann et al., 2018, Mar\\u00edn-Gonz\\u00e1lez et al., 2013). 5.2. Device layer challenges 5.2.1. Power consumption The use of wireless devices has major advantages over wired systems, as they are more economical to establish and can cover much wider areas. However, their power consumption, with limited battery life, is a major drawback of many wireless systems, and needs to be accounted for. This issue is so important that it is the main identified challenge in the literature reviewed (Fig. 5), especially for WSNs (Jawad et al., 2017, Tan and Panda, 2010). The large distances to cover in arable farming make wireless devices indispensable, and solutions to reduce their power consumption and/or extend their battery life are required. These solutions can include energy harvesting, low power consumption sensors and communication technologies or power efficient management. Energy harvesting techniques can include solar cells, micro wind turbines or other interesting solutions which have been well described by Tuna and Gungor (2016) and Jawad et al. (2017). The power consumption of the communication technologies and sensors employed are also to be considered in the design of the IoT solution as there are big differences between devices (Balmos et al., 2016, Hernandez-Rojas et al., 2018, Jawad et al., 2017). Choosing low power sensors and communication devices needs to be taken into account when designing the IoT system (Estrada-L\\u00f3pez et al., 2018). Low power wireless technologies, such as BLE, have low power consumption but also low communication range, while Wi-Fi has somewhat higher communication range, but much higher power consumption (Table 1), however data rates and other parameters are important factors to consider too. ZigBee and LoRa have been identified as appropriate candidates for many farming applications (Jawad et al., 2017). Power efficient management techniques of WSNs include sleep/active schemes, e.g. duty-cycling algorithms (Ahmed, Abdalla et al., 2018, Ahmed, De et al., 2018, Alahmadi et al., 2017, Balmos et al., 2016, Dhall and Agrawal, 2018, Temprilho et al., 2018); data mitigation schemes, e.g. data aggregation (Abdel-basset, Shawky, & Eldrandaly, 2018) or data compression (Moon et al., 2018); energy-efficient routing schemes, e.g. mobile sinks by the use of UAVs (Bacco, Berton, Ferro et al., 2018, Bacco, Berton, Gotta et al., 2018, Uddin et al., 2018); and other combined solutions, e.g. LEACH, a cluster architecture with Time Division Multiple Access (TDMA) based MAC protocol and data aggregation scheme (Kamarudin, Ahmad, & Ndzi, 2016), or dynamic power management by combining sleep/active states with dynamic data rates schemes (Estrada-L\\u00f3pez et al., 2018). Jawad et al. (2017) have provided a good overview and description of WSN power efficient management techniques. Lastly, techniques such as edge computing may have higher power requirements on the device, making cloud computing more desirable if power consumption is a constraint in the projected IoT solution. On the other hand, mounting sensors and devices on agricultural vehicles and implements allows connection to the power supply of the vehicle and as a consequence eliminate power consumption as a limiting factor. The type of sensors that are mounted on vehicles and their implements is quite limited, being currently mainly camera-based (e.g. Midtiby et al., 2018, Steen et al., 2012). Nevertheless, there is for example potential in employing sensors on the coulters of seed-drills for mapping soil properties (Nielsen et al., 2017), or other on-the-go sensors for mapping soil or crop variations (Peets et al., 2012). 5.2.2. Harsh device environment The natural environment in which sensors and other devices are placed can greatly challenge their functionality and longevity. Harsh weather conditions, e.g. large temperature variations, intense rainfall or prolonged high humidity can cause water condensation inside devices and consequently provoke corrosion and short circuits (Bauer & Aschenbruck, 2018). Sensors and other devices situated close to the ground experience exposure to dust, mud, or even corrosive chemicals, e.g. agro-chemicals, which can seriously damage the performance of the device or cause its total failure (Aliev, 2018, Bauer and Aschenbruck, 2018). Underground chemical sensors are also exposed to soil chemical and biological processes that deteriorate the sensors and can mislead the measurements, requiring unfeasible maintenance and re-calibrations (Burton et al., 2018, Kassal et al., 2018). Choosing adequate casing that does not interfere with the functionality of the device and also tolerates the environment they are located in is essential in the design of the IoT system. Sensors are also developed for different conditions, and need to match the system's minimum requirements. RFID tags have been reported to perform flawlessly under extreme conditions and environments (Costa et al., 2013, Ruiz-Garcia and Lunadei, 2011); however, RFID technology is quite limited in its applications in arable farming, and suitable sensors and communication devices are therefore primarily dependent on the application and design of the IoT system. 5.3. Network layer challenges 5.3.1. Latency, throughput and rate The large amounts of data generated in IoT applications do not only cause problems regarding data storage or handling, but also latency problems that reduce the throughput of the network employed. In arable farming, latency problems can be of great importance in some IoT solutions, e.g. in WSNs where high latency implies higher power consumption of a node (L\\u00f3pez-Riquelme et al., 2017), or in dynamic optimised route planning in vehicle logistics, which requires rapid responses to deviations in the route plan (Villa-Henriksen et al., 2018). For reducing latency problems, fog and edge computing can be employed, as these computing techniques decrease latency and network congestion (Elijah et al., 2018, Ferr\\u00e1ndez-Pastor et al., 2018), e.g. data compression at the edge reduces the large volumes of data communicated through the network (Moon et al., 2018). In addition, the use of lightweight protocols can also reduce latency problems, e.g. LP4S for sensors (Hern\\u00e1ndez-rojas, Fern\\u00e1ndez-Caram\\u00e9s, Fraga-Lamas, & Escudero, 2018), or MQTT messaging protocol, which has a faster throughput than HTTP and works well for bandwidth limited networks (Estrada-L\\u00f3pez et al., 2018). The communication rate is important to have in mind when planning the wireless communication technology to implement, e.g. 5G can handle high-rates, while SigFox or IEEE 802.15.4-based protocols are for low-rates (Bacco, Berton, Ferro et al., 2018, Bacco, Berton, Gotta et al., 2018, Jawad et al., 2017). The throughput of the network affects the communication rate, and the communication rate also influences the power consumption, which equally has to be carefully considered. Fast response to events is achieved by data processing techniques such as data merging (Tanaka, 2018), data compression (Zhao, Lin et al., 2018, Zhao, Lucani et al., 2018), or dynamic and complex event processing rules for conditioning input data and immediately acting accordingly (Mazon-Olivo et al., 2018). These processes can be on the cloud or at the edge, i.e. devices. Finally, test-bed analysis prior to implementation of the network can simulate communication rates and possible latency and throughput issues (Stewart, Stewart, & Kennedy, 2017). 5.3.2. Wireless link quality A low wireless link quality affects greatly the QoS of an IoT system as it ends in unreliable communication between nodes (Klaina, Alejos, Aghzout, & Falcone, 2018). This can be caused by multipath propagation (Ruiz-Garcia & Lunadei, 2011), background noise (Mazon-Olivo et al., 2018), routing problems, e.g. packet collision or limited band width (Jawad et al., 2017), or even by harsh environmental conditions, which affect the transceivers and the quality of the data transmitted (Elijah et al., 2018). Adequate design and testing of the network are crucial for avoiding or reducing this challenge. However, techniques such as channel access methods, e.g. TDMA, can improve the link quality by reducing packet collisions (Temprilho et al., 2018). Regarding testing, the calculation of signal strengths in real-time on the base station helps estimating the wireless link quality of a WSN when establishing the system (Klaina et al., 2018). Packet loss characterisation can also be used to assess the wireless link quality of a connection (Bacco, Berton, Ferro et al., 2018, Bacco, Berton, Gotta et al., 2018). Additionally, blind entity identification can also help estimating the wireless link quality of a network (Mukherjee, Misra, Raghuwanshi, & Mitra, 2018). 5.3.3. Communication range The different wireless communication technologies have very diverse ranges, which need to be accounted for when designing the IoT solution, together with other factors such as data rate, power consumption, communication protocols or costs (Table 1). In arable farming, due to the larger farm sizes and because of the employment of mobile sensors and devices on vehicles, this challenge becomes even more critical. Furthermore, relying on the approximate communication range of a wireless technology can be misleading, e.g. WiFi is often described to have 100 m range, but a test analysing the packet delivery ratio with respect to distance to gateway shows packet losses at \\u2265 60 m (Giordano, Seitanidis, Ojo, Adami, & Vignoli, 2018), while in another test using WiField devices, 2.6 km range was claimed to be reached still having reliable internet connection (Brinkhoff et al., 2017). Testing the communication range is therefore important for some settings. In addition to the choice of wireless technology, network topology in WSNs, such as mesh topologies can also increase the communication range by using nodes to communicate with the central node (Ahmed, Abdalla et al., 2018, Ahmed, De et al., 2018). Reduced range due to obstacles or topography is addressed in the propagation losses challenge later. 5.3.4. Communication protocols Differences in communication protocols can cause technical interoperability issues, which can lead to connectivity and compatibility issues among the hardware and software employed (Sto\\u010des et al., 2016). Network protocols are separated into diverse layers forming a protocol stack, where tasks are divided into smaller steps (Suhonen, Kohvakka, Kaseva, H\\u00e4m\\u00e4l\\u00e4inen, & H\\u00e4nnik\\u00e4inen, 2012). In the infrastructure layer, some wireless standards that define communication protocols are commonly used by different wireless technologies, e.g. IEEE 802.15.4, which is used by ZigBee or 6LowPAN among others, or 3GPP, which is used by GPRS, LTE or 5G among others (see Table 1). In the application layer, standards such as HTTP (Ahmed, Abdalla et al., 2018, Ahmed, De et al., 2018, Kaloxylos et al., 2014), MQTT (Ferr\\u00e1ndez-Pastor et al., 2016, Mazon-Olivo et al., 2018) or XMPP (K\\u00f6ksal & Tekinerdogan, 2018) are commonly used in IoT applications in arable farming. Adequate protocols are especially relevant and challenging in vehicle-to-vehicle communication, and crucial in arable farming. Different standards in different layers require careful planning of the whole IoT solution, as they are not always compatible and can also have an effect on the data formats used, or sensors and gateways employed (Hernandez-Rojas et al., 2018). Middleware platforms can ease the integration of diverse protocols and standards by offering enough abstraction levels so that this diversity is effectively managed (O'Grady and O'Hare, 2017, Tuna et al., 2017). Edge computing can also ease technical interoperability issues as a local computing layer is created to process data and create control rules before sending the data to the cloud (Ferr\\u00e1ndez-Pastor et al., 2016). 5.3.5. Network management Managing a WSN can imply battery change, software updates, calibration of sensors, replacement of devices and similar maintenance activities that can be very time-consuming. Smart mobile devices, e.g. smart phones, can make remote software updating possible, and can sometimes even be used for updating some other IoT devices (Ferr\\u00e1ndez-Pastor et al., 2016). Using energy efficient devices and communication techniques can also be employed to extend the battery life of devices (Jawad et al., 2017). Some sensors may require recalibrations with a certain periodicity, which has to be accounted for in the projected IoT solution (Kassal et al., 2018). Nonetheless, the management of the network is always to be considered when implementing IoT solutions in arable farming, where distances and number of devices/nodes can be vast. 5.3.6. Network size WSN configuration schemes have a maximum number of sensor nodes per gateway that the network can handle, i.e. the network size. According to the analysis of the reviewed literature, network size is being identified more often in the last two years (see Fig. 5), which seems to indicate new possibilities for exploiting the capabilities of WSNs. Network size depends on the wireless communication technology employed and can affect other parameters, such as data latency or scalability of the network (Balmos et al., 2016). Network topologies can also influence the network size and vary from simple star network (e.g. Hernandez-Rojas et al., 2018) to more advanced multi-hop mesh networks (Ahmed, Abdalla et al., 2018, Ahmed, De et al., 2018, Langendoen et al., 2006) that can increase the network size by using network nodes as relays to reach a central node and gateway. Optimisation algorithms have been used to find the best spatial distribution of WSN nodes, and therefore to assist in the optimisation of its network size (Abdel-basset et al., 2018). 5.3.7. Propagation losses Even though propagation losses can become a big problem for WSNs in application areas like fruit orchards and tree plantations, in arable farming hedges, trees, big rocks or sheds, as well as pronounced topography, like hills and valleys, can also block, diffract or scatter the signal reducing the communication range and causing data packet losses. Additionally, weather conditions can also degrade the wireless connectivity propagation of signals (Jawad et al., 2017, Kamarudin et al., 2016, Stewart et al., 2017). To avoid or reduce these problems, adequate planning of the location of the sensor nodes, the antenna height, the communication protocols and the network topology is necessary. Regarding network topologies, mesh networks compared to star networks can reduce propagation losses as well as increase communication range (Kamarudin et al., 2016, Ruiz-Garcia and Lunadei, 2011). Moreover, propagation modelling can help planning, reduce communication tests and ensure Quality of Service (QoS) for heterogeneous wireless networks (Jawad et al., 2017, Stewart et al., 2017, Kamarudin et al., 2016, Klaina et al., 2018, Ruiz-Garcia and Lunadei, 2011). 5.4. Application layer challenges 5.4.1. Data analysis Data analysis can in some cases become an important challenge, especially when dealing with Big Data, which is data in such amounts, heterogeneity and complexity that they need new data management techniques for analysis (Wolfert et al., 2017). Agricultural Big Data are worthless unless analysed; however, analysis can be very challenging because of the volume, diversity, and quality (e.g. errors and duplications). This is especially challenging in arable farming, where larger amounts of heterogeneous data are generated at diverse rates and from very different sources. The literature reviewed show an increased identification of this challenge in the last two years compared with the previous 6 years (see Fig. 5). This evolution might be caused by increased access and use of agricultural Big Data in recent times (Kamilaris et al., 2017, Pham and Stack, 2018). Techniques for lowering data dimensionality can ease the analysis by applying feature reduction models, which reduce data size by eliminating unnecessary data dimensions (Sabarina & Priya, 2015). Cloud computing provides the flexibility and scalability necessary for Big Data analysis, where numerous users operate simultaneously with the large and complex datasets (Gill et al., 2017). Likewise, cloud platforms are perfect for storing such large amounts of data, where NoSQL databases can store and manage these large unstructured datasets (Kamilaris et al., 2017). The analysis of Big Data can potentially be used, for example, for policy-making, reducing environmental negative impact, improve food-safety, as well as improved farm management and production, benefiting the different stakeholders involved (Kamilaris et al., 2017, Wolfert et al., 2017). Another facet to data analysis is the growing use of machine learning techniques, which are being used for exploring Big Data and identifying important factors and their interrelationship that affect agricultural production systems like, for example, identifying diverse patterns (e.g. crop development stages, weeds or diseases) as part of machine vision systems (Bacco, Berton, Ferro et al., 2018, Bacco, Berton, Gotta et al., 2018, Reshma and Pillai, 2018). In these cases, the model is built upon a sample of data, often called training data, whose size and quality directly affects the final model. Choosing the adequate approach for building the model with the available data is also essential for the success of the IoT solution. 5.4.2. Data security and privacy Even though data security and privacy do not constitute a high challenge in the literature reviewed, they are certainly major concerns for the farmers, i.e. the suppliers of data and also end-users of the technology developed, who have little trust in service providers' use of data (Jayashankar et al., 2018, Zhang et al., 2017). Also, data ownership needs to be taken into consideration as raw data and processed data in IoT systems have different ownership and are accessible by different actors, affecting the necessary requirements for data security and privacy (Kaloxylos et al., 2014). Research and development focus has been on sensing, processing, controlling and computing, while less effort has been devoted to solving security threats, risks and privacy (Tuna et al., 2017). Other issues like cost effectiveness in, for example, cloud services are also affecting the security of the data, which eventually affects the whole privacy and security of the IoT solution, as low-cost services have lower security (Dhinari, Newe, Lewis, & Nizamani, 2017). Technology providers should prioritise data security and privacy in their business models. The availability of privacy and security technologies that are dynamic enough to support the vast numbers and variety of stakeholders, as well as the complexity of the network, is still a major challenge that needs to be overcome (Verdouw, 2016). Many solutions are being employed to reduce data security and privacy issues in each of the IoT layers of the system, e.g. encryption algorithms, intrusion detection mechanisms, authentication, secure routing protocols, anonymisation, etc. (Tuna et al., 2017, Tzounis et al., 2017). Middleware platforms are employed to add a security layer between network and applications, which can include confidentiality, anonymity and security to the system (Rodriguez et al., 2018, Serrano et al., 2015, Tuna et al., 2017, Tzounis et al., 2017). Additionally, newer technologies such as blockchain are aiming to solve many of the challenges related to privacy and security as well as transparency of the IoT. In agriculture, it is mainly being applied in the food supply chain (Bermeo-Almeida et al., 2018). Blockchain make sense for IoT platforms where large amounts of confidential data are handled. 5.4.3. Data quality and availability Some of the challenges previously described have a direct influence on data quality, e.g. propagation losses, wireless link quality, robustness and fault tolerance. Anomaly detection and similar methods have been employed to identify faulty data before analysis (Cadavid et al., 2018, Lyle et al., 2014). The poor quality of data or its limited availability can limit many applications that involve Big Data analytics, modelling and machine learning, which can affect or even compromise the success of some IoT solutions (Balducci et al., 2018, O'Grady and O'Hare, 2017, Wolfert et al., 2017). In these setups, and specifically in arable farming, many datasets are integrated from different sources and sensors, and the quality or scarcity of some data can become a major hurdle to overcome. Ensuring quality and availability of the data before starting such a project is required. Even if it is not always possible to gather all the data necessary to develop models, perform correct analytics or train machine learning algorithms, scientific assumptions (Severino et al., 2018), data augmentation (Diedrichs et al., 2018) or simulated data (Wolanin et al., 2019) are used to help or solve the encountered challenge. 5.4.4. Context-awareness (metadata) Context-awareness is an important and distinctive feature of Smart Farming as compared to Precision Farming, because it automatically includes descriptive data from e.g. fields, sensors, machines, i.e. metadata. Metadata can include information about the date and time, node identification number, data of calibration, height and position information, or even descriptive data about an experiment objective, field, machinery, crop genotype or soil information at the sensor placement (Jayaraman et al., 2015). Metadata about sensor nodes in the system are crucial for providing contextual information so that correct data analysis can be performed (Jayaraman et al., 2016, Ray, 2017). Context-awareness helps computing techniques to decide what data is to be analysed, and consequently easing the computations, and the lack of this data complicate data analysis substantially. This is especially relevant in arable farming, where the system has to handle both spatial and temporal data and make decisions based on the data collected. The use of standards, formats and middleware that support metadata is therefore important to have in mind during the planning of an IoT solution (Peets et al., 2009, Ray, 2017). Context-awareness facilitates new business models and strategies for data analytics and DSS software providers. 6. Conclusions and future perspectives A literature review of current and foreseeable IoT technologies and systems in arable farming was carried out. This has included an overview of the state of the art of IoT technologies, an outline of the current and potential applications, and a thorough description of the challenges and solutions. From this survey, the role smart mobile phones play is highlighted, especially Android devices, which are employed in different ways for a wide diversity of applications, due to their availability, connectivity, interoperability, programmable ease and computational power. The introduction of 5G networks in the near future will enhance the capabilities of smart mobile devices due to their enhanced performance. The intelligent management of WSN as well as the capabilities of improved communication technologies can also solve some of the challenges IoT-based solutions are experiencing. The role of middleware platforms and generic enablers are expected to gain acceptance and importance, as they can solve system integration issues and interoperability challenges. In general, regarding challenges, interoperability is a main challenge throughout the whole IoT architecture, where development and/or acceptance of standards and protocols is required to ease the issues encountered by many IoT implementations. Furthermore, challenges such as revenue and affordability of IoT systems, the power consumption of wireless devices, latency and throughput problems during data transfer, as well as the complexity of data analysis, and data privacy and security have been identified in the reviewed literature as of high importance, and academic research should direct their resources toward solving or reducing these issues. Technology developers need to ensure that the solutions create a real benefit for farmers and are available and applicable for both large and small producers. How IoT generated farm data will affect the business models of farmers requires further investigation as it is not fully addressed in the literature reviewed. The combination of intelligent power efficient systems with power harvesting technologies should guarantee longer battery-life of wireless devices. Computing data at the edge, i.e. on the devices, as well as lightweight protocols can reduce network latency and capacity/throughput problems. The emergence of Big Data is posing significant challenges for data analysis, as the complexity and heterogeneity of the huge data sets require the application of new analysis techniques beyond those traditionally used. Techniques such as lowering data dimensionality, cloud platforms and cloud computing, including machine learning algorithms, can help in this area and new innovative solutions are expected to be developed. Finally, technology producers have to guarantee privacy and security of the data handled throughout all the layers by employing different secure methods without compromising the user-friendliness of the solutions employed. Middleware platforms can help improving the privacy and security of IoT solutions, and techniques such as blockchain can assist with privacy and security problems of IoT platforms when dealing with Big Data. In the near future, interoperable and service-oriented FMIS that are integrated in the supply chain with intelligent analytic tools will take over some of the management and decision-making tasks of farmers and advisors, which will require training for farmers to adapt to this type of FMIS. Key decision support functions include farm financial analysis, business processes, or supply chain functions, which will gain importance with Big Data analytics. In addition, DSS for vehicle logistics will grow in importance as a way to optimise field operations using route planning and sensor-based site-specific applications. Finally, the introduction of autonomous vehicles and robotics in arable farming in the near future is expected to completely change arable farming operations and production praxes requiring fully adopted IoT capabilities. Acknowledgements This work was supported by the European Union's Horizon 2020 research and innovation programme under grant agreement no. 731884, Internet of Food and Farm (IoF2020). References Aasha Nandhini et al., 2017 S. Aasha Nandhini, R. Hemalatha, S. Radha, K. Indumathi Web enabled plant disease detection system for agricultural applications using WMSN Wireless Personal Communications, 1\\u201316 (2017), 10.1007/s11277-017-5092-4 Google Scholar Abdel-basset et al., 2018 M. Abdel-basset, L.A. Shawky, K. Eldrandaly Grid quorum-based spatial coverage for IoT smart agriculture monitoring using enhanced multi-verse optimizer Neural Computing & Applications, 4 (2018), 10.1007/s00521-018-3807-4 Google Scholar Abrahamsen and Hansen, 2000 P. Abrahamsen, S. Hansen Daisy : An open soil-crop-atmosphere system model Environmental Modelling & Software, 15 (2000), pp. 313-330, 10.1016/S1364-8152(00)00003-7 View PDFView articleView in ScopusGoogle Scholar Ahmed, Abdalla et al., 2018 E.M.E. Ahmed, K.H.B. Abdalla, I.K. Eltahir Farm automation based on IoT 2018 International conference on computer, control, electrical, and Electronics engineering (ICCCEEE), IEEE (2018), pp. 1-4 Google Scholar Ahmed, De et al., 2018 N. Ahmed, D. De, S. Member, I. Hussain Internet of Things (IoT) for smart precision agriculture and farming in rural areas IEEE Internet of Things Journal, 5 (6) (2018), pp. 4890-4899, 10.1109/JIOT.2018.2879579 View in ScopusGoogle Scholar Alahmadi et al., 2017 A. Alahmadi, T. Alwajeeh, V. Mohanan, R. Budiarto Wireless sensor network with always best connection for internet of farming V. Mohanan, R. Budiarto, I. Aldmour (Eds.), Powering the Internet of Things with 5G networks, IGI Global, Hershey, PA, USA (2017), pp. 176-201, 10.4018/978-1-5225-2799-2.ch007 View in ScopusGoogle Scholar Aliev, 2018 K. Aliev Internet of plants application for smart agriculture IJACSA - International Journal of Advanced Computer Science and Applications, 9 (4) (2018), pp. 421-429, 10.14569/IJACSA.2018.090458 View in ScopusGoogle Scholar Ashton, 2009 K. Ashton That \\u201cinternet of things\\u201d Thing RFID Journal (2009, June) Retrieved from http://www.rfidjournal.com/articles/view?4986 Google Scholar Bacco, Berton, Ferro et al., 2018 M. Bacco, A. Berton, E. Ferro, C. Gennaro, A. Gotta, S. Matteoli, et al. Smart farming : opportunities, challenges and technology enablers 2018 IoT vertical and topical summit on agriculture - tuscany (IOT tuscany), IEEE (2018), pp. 1-6, 10.1109/IOT-TUSCANY.2018.8373043 View in ScopusGoogle Scholar Bacco, Berton, Gotta et al., 2018 M. Bacco, A. Berton, A. Gotta, L. Caviglione IEEE 802.15.4 air-ground UAV communications in smart farming scenarios IEEE Communications Letters, 22 (9) (2018), pp. 1910-1913, 10.1109/LCOMM.2018.2855211 View in ScopusGoogle Scholar Bakhtiari et al., 2011 A. Bakhtiari, H. Navid, J. Mehri, D.D. Bochtis Optimal route planning of agricultural field operations using ant colony optimization Agricultural Engineering International: CIGR Journal, 13 (4) (2011), pp. 1-16 Retrieved from http://www.cigrjournal.org/index.php/Ejounral/article/view/1939 Google Scholar Balducci et al., 2018 F. Balducci, D. Impedovo, D. Informatica, A. Moro Machine learning applications on agricultural datasets for smart farm enhancement Machines, 6 (38) (2018), pp. 1-22, 10.3390/machines6030038 Google Scholar Balmos et al., 2016 A.D. Balmos, A.W. Layton, A. Ault, J.V. Krogmeier, D.R. Buckmaster Investigation of Bluetooth communications for low-power embedded sensor networks in agriculture Transactions of the ASABE, 59 (5) (2016), pp. 1021-1029, 10.13031/trans.59.11173 View in ScopusGoogle Scholar Bauer and Aschenbruck, 2018 J. Bauer, N. Aschenbruck Design and implementation of an agricultural monitoring system for smart farming In 2018 IoT Vertical and topical Summit on agriculture (pp. 1\\u20136), IEEE, Tuscany, Italy (2018), 10.1109/IOT-TUSCANY.2018.8373022 Google Scholar Bechar and Vigneault, 2016 A. Bechar, C. Vigneault Agricultural robots for field operations: Concepts and components Biosystems Engineering, 149 (2016), pp. 94-111, 10.1016/j.biosystemseng.2016.06.014 View PDFView articleView in ScopusGoogle Scholar Bennett, 2015 J.M. Bennett Agricultural big Data : Utilisation to discover the Unknown and instigate practice change Farm Policy Journal, 12 (1) (2015), pp. 43-50 Retrieved from http://www.farminstitute.org.au/publications-1/farm-policy-journals/2015-autumn-from-little-data-big-data-grow/agricultural-big-data-utilisation-to-discover-the-unknown-and-instigate-practice-change CrossRefView in ScopusGoogle Scholar Bermeo-Almeida et al., 2018 O. Bermeo-Almeida, M. Cardenas-Rodriguez, T. Samaniego-Cobo, E. Ferruzola-G\\u00f3mez, R. Cabezas-Cabezas, W. Baz\\u00e1n-Vera Blockchain in Agriculture : A systematic literature review 4th International conference, CITI 2018, proceedings, Springer, Guayaquil, Ecuador (2018), pp. 44-56, 10.1007/978-3-030-00940-3 View in ScopusGoogle Scholar Bochtis et al., 2011 D. Bochtis, O. Green, C.G. S\\u00f8rensen Spatio-temporal constrained planning software for field machinery Journal of Agricultural Machinery Science, 7 (4) (2011), pp. 399-403 Retrieved from https://dergipark.org.tr/download/article-file/118933 Google Scholar Bochtis and S\\u00f8rensen, 2009 D.D. Bochtis, C.G. S\\u00f8rensen The vehicle routing problem in field logistics part I Biosystems Engineering, 104 (4) (2009), pp. 447-457, 10.1016/j.biosystemseng.2009.09.003 View PDFView articleView in ScopusGoogle Scholar Bochtis and S\\u00f8rensen, 2014 D. Bochtis, C.G. S\\u00f8rensen Special issue: Operations management - operations management in bio-production systems Operations Management in Bio-Production Systems, 120 (2014), pp. 1-116 Retrieved from https://www.sciencedirect.com/journal/biosystems-engineering/vol/120/suppl/C View in ScopusGoogle Scholar Bochtis et al., 2014 D.D. Bochtis, C.G.C. S\\u00f8rensen, P. Busato Advances in agricultural machinery management : A review Biosystems Engineering, 126 (2014), pp. 69-81, 10.1016/j.biosystemseng.2014.07.012 View PDFView articleView in ScopusGoogle Scholar Brewster et al., 2017 C. Brewster, I. Roussaki, N. Kalatzis, K. Doolin, K. Ellis IoT in agriculture: Designing a europe-wide large-scale pilot IEEE Communications Magazine, 55 (9) (2017), pp. 26-33, 10.1109/MCOM.2017.1600528 View in ScopusGoogle Scholar Brinkhoff et al., 2017 J. Brinkhoff, J. Hornbuckle, W. Quayle, C.B. Lurbe, T. Dowling WiField , an IEEE 802 . 11-based agricultural sensor data gathering and logging platform Eleventh International conference on sensing technology (ICST) (2017) Google Scholar B\\u00fcnemann et al., 2018 E.K. B\\u00fcnemann, G. Bongiorno, Z. Bai, R.E. Creamer, G. De Deyn, R. De Goede, et al. Soil quality \\u2013 a critical review Soil Biology and Biochemistry, 120 (February) (2018), pp. 105-125, 10.1016/j.soilbio.2018.01.030 View PDFView articleView in ScopusGoogle Scholar Burton et al., 2018 L. Burton, N. Dave, R.E. Fernandez, K. Jayachandran, S. Bhansali Smart gardening IoT soil sheets for real-Time nutrient analysis Journal of the Electrochemical Society, 165 (8) (2018), pp. 3157-3162, 10.1149/2.0201808jes Google Scholar Busato et al., 2007 P. Busato, R. Berruto, C. Saunders Optimal field-bin locations and harvest patterns to improve the combine field Capacity : Study with a dynamic simulation model CIOSTA 07 001. Vol. IX. Agricultural engineering International: The CIGR ejournal (2007) Retrieved from https://ecommons.cornell.edu/handle/1813/10619 Google Scholar Cadavid et al., 2018 H. Cadavid, W. Garz\\u00f3n, A. P\\u00e9rez, G. L\\u00f3pez, C. Mendivelso, C. Ram\\u00edrez Towards a smart farming Platform : From IoT-based crop sensing Colombian conference on computing CCC 2018, communications and information science CCIS, Vol. 885 (2018), pp. 237-251, 10.1007/978-3-319-98998-3 View in ScopusGoogle Scholar CEMA, 2017 CEMA Digital farming: What does it really mean? (2017) Retrieved March 22, 2018 http://cema-agri.org/sites/default/files/CEMA_Digital Farming - Agriculture 4.0_ 13 02 2017.pdf Google Scholar Chatzikostas et al., 2019 G. Chatzikostas, D. Matic, D. Van Damme, P. Rakers, J. Vangeyte, A. De Visscher, et al. Smart agri hubs D3.1 innovation experiment guidelines (2019) Retrieved from https://smartagrihubs.eu/Deliverables/pdfs/D3.1_IE Guidelines_final.pdf Google Scholar Christensen et al., 2009 S. Christensen, H.T. S\\u00f8gaard, P. Kudsk, M. N\\u00f8rremark, I. Lund, E.S. Nadimi, et al. Site-specific weed control technologies Weed Research, 49 (2009), pp. 233-241, 10.1111/j.1365-3180.2009.00696.x View in ScopusGoogle Scholar Christiansen et al., 2016 P. Christiansen, L.N. Nielsen, K.A. Steen, R.N. J\\u00f8rgensen, H. Karstoft DeepAnomaly : Combining background subtraction and deep learning for detecting obstacles and anomalies in an agricultural field Sensors, 16 (1904) (2016), pp. 1-21, 10.3390/s16111904 Google Scholar Costa et al., 2013 C. Costa, F. Antonucci, F. Pallottino, J. Aguzzi, D. Sarri\\u00e1, P. Menesatti A review on agri-food supply chain Traceability by means of RFID Technology Food and Bioprocess Technology, 6 (2) (2013), pp. 353-366, 10.1007/s11947-012-0958-7 View in ScopusGoogle Scholar Dhall and Agrawal, 2018 R. Dhall, H. Agrawal An improved energy efficient duty cycling algorithm for IoT based precision agriculture Procedia Computer Science, 141 (2018), pp. 135-142, 10.1016/j.procs.2018.10.159 View PDFView articleView in ScopusGoogle Scholar Dhinari et al., 2017 L.L. Dhinari, T. Newe, E. Lewis, S. Nizamani Cloud computing and Internet of Things fusion: Cost issues Eleventh International conference on sensing technology (ICST) (2017), pp. 2-7 Google Scholar Diedrichs et al., 2018 A.L. Diedrichs, F. Bromberg, D. Dujovne, K. Brun-laguna, T. Watteyne Prediction of frost events using machine learning and IoT sensing devices IEEE Internet of Things Journal, 5 (6) (2018), pp. 4589-4597, 10.1109/JIOT.2018.2867333 View in ScopusGoogle Scholar Djelveh and Bisevac, 2016 S. Djelveh, V. Bisevac D3.7. Smart-AKIS policy gaps and briefs (2016) Retrieved from https://www.smart-akis.com/wp-content/uploads/2018/08/SmartAKIS_D3.7_Final.pdf Google Scholar Edwards et al., 2017 G.T.C. Edwards, J. Hinge, N. Skou-Nielsen, A. Villa-Henriksen, C.A.G. S\\u00f8rensen, O. Green Route planning evaluation of a prototype optimised infield route planner for neutral material flow agricultural operations Biosystems Engineering, 153 (2017), pp. 149-157, 10.1016/j.biosystemseng.2016.10.007 View PDFView articleView in ScopusGoogle Scholar Edwards et al., 2016 G. Edwards, D.R. White, L.J. Munkholm, C.G. S\\u00f8rensen, M. Lamand\\u00e9 Modelling the readiness of soil for different methods of tillage Soil and Tillage Research, 155 (2016), pp. 339-350, 10.1016/j.still.2015.08.013 View PDFView articleView in ScopusGoogle Scholar El Jarroudi et al., 2017 M. El Jarroudi, L. Kouadio, M. El Jarroudi, J. Junk, C. Bock, A.A. Diouf, et al. Improving fungal disease forecasts in winter wheat: A critical role of intra-day variations of meteorological conditions in the development of septoria leaf blotch Field Crops Research, 213 (August) (2017), pp. 12-20, 10.1016/j.fcr.2017.07.012 View PDFView articleView in ScopusGoogle Scholar Elijah et al., 2018 O. Elijah, S. Member, T.A. Rahman An overview of Internet of Things (IoT) and data analytics in Agriculture : Benefits and challenges IEEE Internet of Things Journal, 5 (5) (2018), pp. 3758-3773, 10.1109/JIOT.2018.2844296 View in ScopusGoogle Scholar Estrada-L\\u00f3pez et al., 2018 J.J. Estrada-L\\u00f3pez, A.A. Castillo-Atoche, J. V\\u00e1zquez-castillo, E. S\\u00e1nchez-Sinencio Smart soil parameters estimation system using an autonomous wireless sensor network with dynamic power management strategy Sensors Journal, 18 (21) (2018), pp. 8913-8923, 10.1109/JSEN.2018.2867432 View in ScopusGoogle Scholar Faraci et al., 2018 G. Faraci, A. Raciti, S. Rizzo, G. Schembra A 5G platform for unmanned aerial monitoring in rural areas: Design and performance issues IEEE international conference on network softwarization (NetSoft 2018) - technical sessions, Vol. 1, IEEE (2018), pp. 237-241, 10.1109/NETSOFT.2018.8459960 Google Scholar Ferr\\u00e1ndez-Pastor et al., 2018 F.J. Ferr\\u00e1ndez-Pastor, J.M. Garc\\u00eda-Chamizo, M. Nieto-Hidalgo, J. Mora-Mart\\u00ednez Precision agriculture design method using a distributed computing architecture on Internet of Things context Sensors, 18 (1731) (2018), pp. 1-21, 10.3390/s18061731 Google Scholar Ferr\\u00e1ndez-Pastor et al., 2016 F. Ferr\\u00e1ndez-Pastor, J. Garc\\u00eda-Chamizo, M. Nieto-Hidalgo, J. Mora-Pascual, J. Mora-Mart\\u00ednez Developing ubiquitous sensor network platform using Internet of Things: Application in precision agriculture Sensors, 16 (8) (2016), p. 1141, 10.3390/s16071141 View in ScopusGoogle Scholar Ferreira et al., 2017 D. Ferreira, P. Corista, J. Gi\\u00e3o, S. Ghimire, J. Sarraipa, R. Jardim-gon\\u00e7alves Towards smart agriculture using FIWARE enablers 2017 International conference on engineering, technology and Innovation (ICE/ITMC), IEEE, Funchal, Portugal (2017), pp. 1544-1551, 10.1109/ICE.2017.8280066 View in ScopusGoogle Scholar Foley et al., 2011 J.A. Foley, N. Ramankutty, K.A. Brauman, E.S. Cassidy, J.S. Gerber, M. Johnston, et al. Solutions for a cultivated planet Nature, 478 (7369) (2011), pp. 337-342, 10.1038/nature10452 Retrieved from View in ScopusGoogle Scholar Fountas, Carli et al., 2015 S. Fountas, G. Carli, C.G. S\\u00f8rensen, Z. Tsiropoulos, C. Cavalaris, A. Vatsanidou, et al. Farm management information systems: Current situation and future perspectives Computers and Electronics in Agriculture, 115 (2015), pp. 40-50, 10.1016/j.compag.2015.05.011 View PDFView articleView in ScopusGoogle Scholar Fountas, S\\u00f8rensen et al, 2015 S. Fountas, C.G. S\\u00f8rensen, Z. Tsiropoulos, C. Cavalaris, V. Liakos, T. Gemtos Farm machinery management information system Computers and Electronics in Agriculture, 110 (2015), pp. 131-138, 10.1016/j.compag.2014.11.011 View PDFView articleView in ScopusGoogle Scholar Gao and Yao, 2016 C. Gao, K. Yao The design and implementation of portable Agricultural microclimate data acquisition system based on android platform Proceedings - 2015 8th international symposium on computational intelligence and design, ISCID 2015, Vol. 1 (2016), pp. 210-213, 10.1109/ISCID.2015.275 Google Scholar Gill et al., 2017 S.S. Gill, I. Chana, R. Buyya IoT based agriculture as a cloud and big data service Journal of Organizational and End User Computing, 29 (4) (2017), pp. 1-23, 10.4018/JOEUC.2017100101 View in ScopusGoogle Scholar Giordano et al., 2018 S. Giordano, I. Seitanidis, M. Ojo, D. Adami, F. Vignoli IoT solutions for crop protection against wild animal attacks 2018 IEEE International conference on environmental engineering (EE), IEEE (2018), pp. 1-5, 10.1109/EE1.2018.8385275 View in ScopusGoogle Scholar Goap et al., 2018 A. Goap, D. Sharma, A.K. Shukla, C.R. Krishna An IoT based smart irrigation management system using Machine learning and open source technologies Computers and Electronics in Agriculture, 155 (May) (2018), pp. 41-49, 10.1016/j.compag.2018.09.040 View PDFView articleView in ScopusGoogle Scholar Godfray et al., 2010 H.C.J. Godfray, J.R. Beddington, I.R. Crute, L. Haddad, D. Lawrence, J.F. Muir, et al. Food Security : The challenge of feeding 9 billion people Science, 327 (5967) (2010), pp. 812-818, 10.1126/science.1185383 View in ScopusGoogle Scholar Godwin and Miller, 2003 R.J. Godwin, P.C.H. Miller A review of the technologies for mapping within-field variability Biosystems Engineering, 84 (4) (2003), pp. 393-407 View PDFView articleView in ScopusGoogle Scholar Goldstein et al., 2018 A. Goldstein, L. Fink, A. Meitin Applying machine learning on sensor data for irrigation recommendations : Revealing the agronomist's tacit knowledge Precision Agriculture, 19 (3) (2018), pp. 421-444, 10.1007/s11119-017-9527-4 View in ScopusGoogle Scholar Green et al., 2009 O. Green, E.S. Nadimi, V. Blanes-Vidal, R.N. J\\u00f8rgensen, I.M.L. Drejer Storm, C.G. S\\u00f8rensen Monitoring and modeling temperature variations inside silage stacks using novel wireless sensor networks Computers and Electronics in Agriculture, 69 (2009), pp. 149-157, 10.1016/j.compag.2009.07.021 View PDFView articleView in ScopusGoogle Scholar Hamrita and Hoffacker, 2005 T.K. Hamrita, E.C. Hoffacker Development of a \\u201csmart\\u201d wireless soil monitoring sensor prototype using RFID technology Applied Engineering in Agriculture, 21 (1) (2005), pp. 139-143, 10.13031/2013.17904 View in ScopusGoogle Scholar Hern\\u00e1ndez-rojas et al., 2018 D.L. Hern\\u00e1ndez-rojas, T.M. Fern\\u00e1ndez-Caram\\u00e9s, P. Fraga-Lamas, C.J. Escudero Design and practical evaluation of a family of lightweight protocols for heterogeneous sensing through BLE beacons in IoT telemetry applications Sensors, 18 (1) (2018), pp. 1-33, 10.3390/s18010057 Google Scholar Hernandez-Rojas et al., 2018 D. Hernandez-Rojas, B. Mazon-Olivo, J. Novillo-Vicu\\u00f1a, G. Belduma-Vacacela IoT android gateway for monitoring and control a WSN M. Botto-Tobar, N. Esparza-Cruz, J. Le\\u00f3n-Acurio, N. Crespo-Torres, M. Beltr\\u00e1n-Mora (Eds.), CITT 2017: Technology trends, Communications in computer and information science, Vol. 798, Springer, Cham (2018), pp. 18-32, 10.1007/978-3-319-72727-1_2 View in ScopusGoogle Scholar Higgins et al., 2017 V. Higgins, M. Bryant, A. Howell, J. Battersby Ordering adoption: Materiality, knowledge and farmer engagement with precision agriculture technologies Journal of Rural Studies, 55 (2017), pp. 193-202, 10.1016/j.jrurstud.2017.08.011 View PDFView articleView in ScopusGoogle Scholar Huang and Zhang, 2017 J. Huang, L. Zhang The big data processing platform for intelligent agriculture AIP Conference Proceedings, 1864 (2017), 10.1063/1.4992850 Google Scholar Jain et al., 2018 P. Jain, S. Sarangi, P. Bhatt, S. Pappula Development of an energy-efficient adaptive IoT gateway model for precision agriculture 2018 global Internet of Things Summit (GIoTS), IEEE (2018), pp. 1-6, 10.1109/GIOTS.2018.8534553 Google Scholar Jawad et al., 2017 H. Jawad, R. Nordin, S. Gharghan, A. Jawad, M. Ismail Energy-efficient wireless sensor networks for precision agriculture: A review Sensors, 17 (8) (2017), p. 1781, 10.3390/s17081781 View in ScopusGoogle Scholar Jayaraman et al., 2015 P.P. Jayaraman, D. Palmer, A. Zaslavsky, A. Salehi Addressing information processing needs of digital agriculture with OpenIoT platform I. Podnar \\u017darko, K. Pripu\\u017ei\\u0107, M. Serrano (Eds.), Interoperability and open-source solutions for the Internet of Things. Lecture notes in computer science, Vol. 9001, Springer, Cham (2015), pp. 137-152, 10.1007/978-3-319-16546-2_11 View in ScopusGoogle Scholar Jayaraman et al., 2016 P.P. Jayaraman, A. Yavari, D. Georgakopoulos, A. Morshed, A. Zaslavsky Internet of Things platform for smart farming: Experiences and lessons learnt Sensors (Switzerland), 16 (11) (2016), pp. 1-17, 10.3390/s16111884 View in ScopusGoogle Scholar Jayashankar et al., 2018 P. Jayashankar, S. Nilakanta, W.J. Johnston, P. Gill, R. Burres, W.J. Johnston IoT adoption in agriculture : The role of trust , perceived value and risk Journal of Business & Industrial Marketing, 33 (6) (2018), pp. 804-821, 10.1108/JBIM-01-2018-0023 View in ScopusGoogle Scholar Jensen et al., 2012 M.A.F. Jensen, D. Bochtis, C.G. Sorensen, M.R. Blas, K.L. Lykkegaard In-field and inter-field path planning for agricultural transport units Computers & Industrial Engineering, 63 (4) (2012), pp. 1054-1061, 10.1016/j.cie.2012.07.004 View PDFView articleView in ScopusGoogle Scholar Juul et al., 2015 J.P. Juul, O. Green, R.H. Jacobsen Deployment of wireless sensor networks in crop storages Wireless Personal Communications, 81 (2015), pp. 1437-1454, 10.1007/s11277-015-2482-3 View in ScopusGoogle Scholar Kaloxylos et al., 2012 A. Kaloxylos, R. Eigenmann, F. Teye, Z. Politopoulou, S. Wolfert, C. Shrank, et al. Farm management systems and the Future Internet era Computers and Electronics in Agriculture, 89 (2012), pp. 130-144, 10.1016/j.compag.2012.09.002 View PDFView articleView in ScopusGoogle Scholar Kaloxylos et al., 2014 A. Kaloxylos, A. Groumas, V. Sarris, L. Katsikas, P. Magdalinos, E. Antoniou, et al. A cloud-based farm management system: Architecture and implementation Computers and Electronics in Agriculture, 100 (2014), pp. 168-179, 10.1016/j.compag.2013.11.014 Retrieved from View PDFView articleView in ScopusGoogle Scholar Kamarudin et al., 2016 L.M. Kamarudin, R.B. Ahmad, D.L. Ndzi Simulation and analysis of LEACH for wireless sensor networks in agriculture ammar zakaria and kamarulzaman Kamarudin mohamed Elshaikh Elobaid Said Ahmed, 21 (1) (2016), pp. 16-26 View in ScopusGoogle Scholar Kamilaris et al., 2016 A. Kamilaris, F. Gao, F.X. Prenafeta-Boldu, M.I. Ali Agri-IoT: A semantic framework for internet of Things-enabled smart farming applications 2016 IEEE 3rd world Forum on Internet of Things, WF-IoT 2016, 442\\u2013447 (2016), 10.1109/WF-IoT.2016.7845467 Google Scholar Kamilaris et al., 2017 A. Kamilaris, A. Kartakoullis, F.X. Prenafeta-Bold\\u00fa A review on the practice of big data analysis in agriculture Computers and Electronics in Agriculture, 143 (January) (2017), pp. 23-37, 10.1016/j.compag.2017.09.037 View PDFView articleView in ScopusGoogle Scholar Kassal et al., 2018 P. Kassal, M.D. Steinberg, I. Murkovi Chemical wireless chemical sensors and biosensors : A review Sensors and Actuators B, 266 (2018), pp. 228-245, 10.1016/j.snb.2018.03.074 View PDFView articleView in ScopusGoogle Scholar Kayacan et al., 2015 E. Kayacan, E. Kayacan, H. Ramon, W. Saeys Towards agrobots : Identification of the yaw dynamics and trajectory tracking of an autonomous tractor Computers and Electronics in Agriculture, 115 (2015), pp. 78-87, 10.1016/j.compag.2015.05.012 View PDFView articleView in ScopusGoogle Scholar Khanal et al., 2017 S. Khanal, J. Fulton, S. Shearer An overview of current and potential applications of thermal remote sensing in precision agriculture Computers and Electronics in Agriculture, 139 (2017), pp. 22-32, 10.1016/j.compag.2017.05.001 View PDFView articleView in ScopusGoogle Scholar Khattab et al., 2016 A. Khattab, A. Abdelgawad, A. Khattab Design and implementation of a cloud-based IoT scheme for precision agriculture 28th International Conference on Microelectronics, Vols. 10\\u201314 (2016), 10.1109/ICM.2016.7847850 Google Scholar Kitchen and Roger, 2007 N.R. Kitchen, R.D. Roger Emerging technologies for real-time and integrated agriculture decisions Computers and Electronics in Agriculture, 61 (2007), pp. 1-3, 10.1016/j.compag.2007.06.007 Google Scholar Klaina et al., 2018 H. Klaina, A.V. Alejos, O. Aghzout, F. Falcone Narrowband characterization of near-ground radio Sensors, 18 (2428) (2018), pp. 1-15, 10.3390/s18082428 Google Scholar Kodali et al., 2017 R.K. Kodali, V. Jain, S. Karagwal IoT based smart greenhouse IEEE region 10 humanitarian technology conference 2016, R10-HTC 2016 - proceedings (2017), 10.1109/R10-HTC.2016.7906846 Google Scholar Kodali and Sahu, 2016 R.K. Kodali, A. Sahu An IoT based soil moisture monitoring on Losant platform Proceedings of the 2016 2nd International conference on contemporary computing and informatics, IC3I 2016 (2016), pp. 764-768, 10.1109/IC3I.2016.7918063 View in ScopusGoogle Scholar K\\u00f6ksal and Tekinerdogan, 2018 \\u00d6. K\\u00f6ksal, B. Tekinerdogan Architecture design approach for IoT - based farm management information systems Precision Agriculture, 1\\u201333 (2018), 10.1007/s11119-018-09624-8 Google Scholar Kruize et al., 2016 J.W. Kruize, J. Wolfert, H. Scholten, C.N. Verdouw, A. Kassahun, A.J.M. Beulens Original papers A reference architecture for farm software ecosystems Computers and Electronics in Agriculture, 125 (2016), pp. 12-28, 10.1016/j.compag.2016.04.011 View PDFView articleView in ScopusGoogle Scholar Langendoen et al., 2006 K. Langendoen, A. Baggio, O. Visser Murphy loves potatoes: Experiences from a pilot sensor network deployment in precision agriculture Proceedings 20th IEEE International parallel & distributed processing symposium, IEEE, Rhodes Island, Greece (2006), pp. 1-8, 10.1109/IPDPS.2006.1639412 Google Scholar L\\u00f3pez-Riquelme et al., 2017 J.A. L\\u00f3pez-Riquelme, N. Pav\\u00f3n-Pulido, H. Navarro-Hell\\u00edn, F. Soto-Valles, R. Torres-S\\u00e1nchez A software architecture based on FIWARE cloud for Precision Agriculture Agricultural Water Management, 183 (2017), pp. 123-135, 10.1016/j.agwat.2016.10.020 View PDFView articleView in ScopusGoogle Scholar Lyle et al., 2014 G. Lyle, B.A. Bryan, B. Ostendorf Post-processing methods to eliminate erroneous grain yield measurements: Review and directions for future development Precision Agriculture, 15 (4) (2014), pp. 377-402, 10.1007/s11119-013-9336-3 View in ScopusGoogle Scholar Mafuta et al., 2012 M. Mafuta, M. Zennaro, A. Bagula, G. Ault, H. Gombachika, T. Chadza Successful deployment of a wireless sensor network for precision agriculture in Malawi 3rd International conference on networked embedded systems for every application (NESEA), IEEE (2012), pp. 1-7 CrossRefGoogle Scholar Manap and Najib, 2014 H. Manap, M.S. Najib A DOAS system for monitoring of ammonia emission in the agricultural sector Sensors and Actuators B: Chemical, 205 (2014), pp. 411-415, 10.1016/j.snb.2014.08.080 View PDFView articleView in ScopusGoogle Scholar Mar\\u00edn-Gonz\\u00e1lez et al., 2013 O. Mar\\u00edn-Gonz\\u00e1lez, B. Kuang, M.Z. Quraishi, M.A. Mu\\u00f1\\u00f3z-Garc\\u00eda, A.M. Mouazen On-line measurement of soil properties without direct spectral response in near infrared spectral range Soil and Tillage Research, 132 (2013), pp. 21-29, 10.1016/j.still.2013.04.004 View PDFView articleView in ScopusGoogle Scholar Marsch et al., 2016 P. Marsch, I.D. Silva, \\u00d6. Bulakci, M. Tesanovic, S. Eddine, E. Ayoubi 5G radio access network architecture \\u2013 design guidelines and key considerations IEEE Communications Magazine, 54 (11) (2016), pp. 24-32, 10.1109/MCOM.2016.1600147CM View in ScopusGoogle Scholar Mart\\u00ednez et al., 2016 R. Mart\\u00ednez, J.\\u00c1. Pastor, B. \\u00c1lvarez, A. Iborra A testbed to evaluate the fiware-based iot platform in the domain of precision agriculture Sensors (Switzerland), 16 (11) (2016), 10.3390/s16111979 Google Scholar M\\u00e4yr\\u00e4 et al., 2018 O. M\\u00e4yr\\u00e4, M. Ruusunen, M. Jalli, L. Jauhiainen, K. Leivisk\\u00e4 Plant disease outbreak \\u2013 prediction by advanced data analysis SNE Short Note, 28 (3) (2018), pp. 113-115, 10.11128/sne.28.sn.10431 Google Scholar Mazon-Olivo et al., 2018 B. Mazon-Olivo, D. Hern\\u00e1ndez-Rojas, J. Maza-Salinas, A. Pan Rules engine and complex event processor in the context of Internet of Things for precision agriculture Computers and Electronics in Agriculture, 154 (February) (2018), pp. 347-360, 10.1016/j.compag.2018.09.013 View PDFView articleView in ScopusGoogle Scholar McBratney et al., 2003 A. McBratney, M. Mendon\\u00e7a Santos, B. Minasny On digital soil mapping Geoderma, 117 (1\\u20132) (2003), pp. 3-52 Retrieved from http://linkinghub.elsevier.com/retrieve/pii/S0016706103002234 View PDFView articleView in ScopusGoogle Scholar Meola, 2016 A. Meola Why IoT, big data & smart farming are the future of agriculture. Business Insider - Dec 20, 2016 (2016) Retrieved from https://www.businessinsider.com/internet-of-things-smart-agriculture-2016-10?r=US&IR=T Google Scholar Midtiby et al., 2018 H.S. Midtiby, K.A. Steen, O. Green In row cultivation controlled by plant patterns Computers and Electronics in Agriculture, 153 (July) (2018), pp. 62-68, 10.1016/j.compag.2018.07.037 View PDFView articleView in ScopusGoogle Scholar Miettinen et al., 2006 M. Miettinen, T. Oksanen, P. Suomi, A. Visala Fault diagnosis in agricultural machines ASABE International conference on automation technology for off-road equipment, ASABE, Bonn, Germany (2006), pp. 1-10 Retrieved from https://www.computoolable.com/AgF4.pdf Google Scholar Moon et al., 2018 A. Moon, J. Kim, J. Zhang, S. Woo Evaluating fi delity of lossy compression on spatiotemporal data from an IoT enabled smart farm Computers and Electronics in Agriculture, 154 (March) (2018), pp. 304-313, 10.1016/j.compag.2018.08.045 View PDFView articleView in ScopusGoogle Scholar Mukherjee et al., 2018 A. Mukherjee, S. Misra, N.S. Raghuwanshi, S. Mitra Blind entity identification for agricultural IoT deployments Internet of Things Journal, 1\\u20138 (2018), 10.1109/JIOT.2018.2879454 Google Scholar Na and Isaac, 2016 A. Na, W. Isaac Developing a human-centric agricultural model in the IoT environment 2016 International Conference on Internet of Things and applications, IOTA 2016 (2016), pp. 292-297, 10.1109/IOTA.2016.7562740 View in ScopusGoogle Scholar N\\u00e4si et al., 2018 R. N\\u00e4si, N. Viljanen, J. Kaivosoja, K. Alhonoja, T. Hakala, L. Markelin, et al. Estimating biomass and nitrogen amount of barley and grass using UAV and aircraft based spectral and photogrammetric features Remote Sensing, 10 (7) (2018), p. 1082, 10.3390/rs10071082 1\\u201332 View in ScopusGoogle Scholar Nielsen et al., 2017 S.K. Nielsen, L.J. Munkholm, M. Lamand\\u00e9, M. N\\u00f8rremark, N. Skou-Nielsen, G.T.C. Edwards, et al. Seed drill instrumentation for spatial coulter depth measurements Computers and Electronics in Agriculture, 141 (2017), pp. 207-214 Google Scholar Okayasu et al., 2017 T. Okayasu, A.P. Hugroho, A. Sakai, D. Arita, T. Yoshinaga, R. Taniguchi, et al. Affordable field environmental monitoring and plant growth measurement system for smart agriculture Eleventh International conference on sensing technology (ICST) (2017), pp. 7-10 Google Scholar Oksanen et al., 2016 T. Oksanen, R. Linkolehto, I. Seilonen Adapting an industrial automation protocol to remote monitoring of mobile agricultural machinery: A combine harvester with IoT IFAC-PapersOnLine 49\\u201316, Elsevier (2016), pp. 127-131 View PDFView articleView in ScopusGoogle Scholar Oksanen et al., 2015 T. Oksanen, P. Piirainen, I. Seilonen Remote access of ISO 11783 process data by using OPC Unified Architecture technology Computers and Electronics in Agriculture, 117 (2015), pp. 141-148, 10.1016/j.compag.2015.08.002 View PDFView articleView in ScopusGoogle Scholar O'Grady and O'Hare, 2017 M.J. O'Grady, G.M.P. O'Hare Modelling the smart farm Information Processing in Agriculture, 4 (3) (2017), pp. 179-187, 10.1016/j.inpa.2017.05.001 View PDFView articleView in ScopusGoogle Scholar Paraforos et al., 2016 D.S. Paraforos, V. Vassiliadis, D. Kortenbruck, K. Stamkopoulos, V. Ziogas, A.A. Sapounas, et al. A farm management information system using future internet Technologies IFAC-PapersOnLine, 49 (16) (2016), pp. 324-329, 10.1016/j.ifacol.2016.10.060 View PDFView articleView in ScopusGoogle Scholar Peets et al., 2009 S. Peets, C.P. Gasparin, D.W.K. Blackburn, R.J. Godwin RFID tags for identifying and verifying agrochemicals in food traceability systems Precision Agriculture, 10 (5) (2009), pp. 382-394, 10.1007/s11119-009-9106-4 View in ScopusGoogle Scholar Peets et al., 2012 S. Peets, A.M. Mouazen, K. Blackburn, B. Kuang, J. Wiebensohn Methods and procedures for automatic collection and management of data acquired from on-the-go sensors with application to on-the-go soil sensors Computers and Electronics in Agriculture, 81 (2012), pp. 104-112, 10.1016/j.compag.2011.11.011 View PDFView articleView in ScopusGoogle Scholar P\\u00e9rez-Freire and Brillouet, 2015 L. P\\u00e9rez-Freire, L. Brillouet Smart farming and food safety Internet of Things applications - challenges for large scale implementations. AIOTI WG06 (2015) Retrieved from https://aioti.eu/wp-content/uploads/2017/03/AIOTIWG06Report2015-Farming-and-Food-Safety.pdf Google Scholar Pesonen et al., 2014 L.A. Pesonen, F.K. Teye, A.K. Ronkainen, M.O. Koistinen, J.J. Kaivosoja, P.F. Suomi, et al. Cropinfra - an Internet-based service infrastructure to support crop production in future farms Biosystems Engineering, 120 (2014), pp. 92-101, 10.1016/j.biosystemseng.2013.09.005 View PDFView articleView in ScopusGoogle Scholar Pfeiffer and Blank, 2015 D. Pfeiffer, S. Blank Real-time operator performance analysis in agricultural equipment. Understanding unused potential and ways to improve from day to day 73rd International conference on agricultural engineering, LANDTECHNIK AgEng 2015 proceedings - innovations in agricultural engineering for efficient farming. Hannover, Germany (2015) Retrieved from https://www.researchgate.net/profile/Sebastian_Blank2/publication/283643214_Real-time_Operator_Performance_Analysis_in_Agricultural_Equipment/links/564c7d8e08aeab8ed5e9dcf4/Real-time-Operator-Performance-Analysis-in-Agricultural-Equipment.pdf Google Scholar Pham and Stack, 2018 X. Pham, M. Stack How data analytics is transforming agriculture Business Horizons, 61 (1) (2018), pp. 125-133, 10.1016/j.bushor.2017.09.011 View PDFView articleView in ScopusGoogle Scholar Popovi\\u0107 et al., 2017 T. Popovi\\u0107, N. Latinovi\\u0107, A. Pe\\u0161i\\u0107, \\u017d. Ze\\u010devi\\u0107, B. Krstaji\\u0107, S. Djukanovi\\u0107 Architecting an IoT-enabled platform for precision agriculture and ecological monitoring: A case study Computers and Electronics in Agriculture, 140 (2017), pp. 255-265, 10.1016/j.compag.2017.06.008 View PDFView articleView in ScopusGoogle Scholar Ramundo et al., 2016 L. Ramundo, M. Taisch, S. Terzi State of the art of technology in the food sector value chain towards the IoT 2016 IEEE 2nd International forum on research and technologies for society and Industry leveraging a better tomorrow (RTSI), 1\\u20136 (2016), 10.1109/RTSI.2016.7740612 Google Scholar Ray, 2017 P.P. Ray Internet of Things for smart agriculture: Technologies, practices and future direction Journal of Ambient Intelligence and Smart Environments, 9 (4) (2017), pp. 395-420, 10.3233/AIS-170440 View in ScopusGoogle Scholar Renard et al., 1991 K.G. Renard, G.R. Foster, G.A. Weesies, J.P. Porter Rusle: Revised universal soil loss equation Journal of Soil & Water Conservation, 46 (1) (1991), pp. 30-33 View in ScopusGoogle Scholar Reshma and Pillai, 2018 S.R.J. Reshma, A.S. Pillai Proceedings of the eighth International conference on soft computing and pattern recognition (SoCPaR 2016), 614(SoCPaR 2016) (2018), 10.1007/978-3-319-60618-7 Google Scholar Rodriguez et al., 2018 M.A. Rodriguez, L. Cuenca, A. Ortiz FIWARE open source standard platform in smart farming - a review L.M. Camarinha-Matos, H. Afsarmanesh, Y. Rezgui (Eds.), Collaborative networks of cognitive systems 19th IFIP WG 5.5 working conference on Virtual enterprises, PRO-VE 2018, Vol. 534, Springer International Publishing, Cardiff, UK (2018), pp. 581-589, 10.1007/978-3-319-99127-6 View in ScopusGoogle Scholar Ruiz-Garcia and Lunadei, 2011 L. Ruiz-Garcia, L. Lunadei The role of RFID in agriculture: Applications, limitations and challenges Computers and Electronics in Agriculture, 79 (1) (2011), pp. 42-50, 10.1016/j.compag.2011.08.010 View PDFView articleView in ScopusGoogle Scholar Sabarina and Priya, 2015 K. Sabarina, N. Priya Lowering data dimensionality in big data for the benefit of precision agriculture Procedia Computer Science, 48 (C) (2015), pp. 548-554, 10.1016/j.procs.2015.04.134 View PDFView articleView in ScopusGoogle Scholar Say et al., 2017 S.M. Say, M. Keskin, M. Sehri, Y.E. Sekerli Adoption of precision agriculture Technologies in developed and developing countries adoption of precision agriculture technologies A. Isman, S. D\\u00fcndar (Eds.), International science and technology conference (ISTEC) (2017), pp. 41-49 Berlin, Germany. Retrieved from https://www.researchgate.net/publication/320908156_Adoption_of_Precision_Agriculture_Technologies_in_Developed_and_Developing_Countries Google Scholar SEGES, 2016 SEGES Pr\\u00e6cisionsjordbrug i Danmark. Barriererapport: Identificering af udfordringer og forhold, der h\\u00e6mmer udvikling, produktion og anvendelse af pr\\u00e6cisionsjordbrugsteknikker i planteavlen (2016) Retrieved from file:///C:/Users/AgroIntelli AVH/Downloads/Barri\\u00e4rrapportpraecisionsjordbrug-i-danmark.pdf Google Scholar Serrano et al., 2015 M. Serrano, P. Barnaghi, F. Carrez, P. Cousin, O. Vermesan, P. Friess Internet of Things IoT semantic interoperability: Research challenges, best practices, recommendations and next steps (2015) Retrieved from http://www.eglobalmark.com/wp-content/uploads/2016/06/2015-03-IoT-Semantic-Interoperability-Research-Challenges-Best-Practices-Recommendations-and-Next-Steps.pdf Google Scholar Severino et al., 2018 G. Severino, G. D'Urso, M. Scarfato, G. Toraldo The IoT as a tool to combine the scheduling of the irrigation with the geostatistics of the soils Future Generation Computer Systems, 82 (2018), pp. 268-273, 10.1016/j.future.2017.12.058 View PDFView articleView in ScopusGoogle Scholar Seyyedhasani and Dvorak, 2018 H. Seyyedhasani, J.S. Dvorak Dynamic rerouting of a fleet of vehicles in agricultural operations through a dynamic multiple depot vehicle routing problem representation Biosystems Engineering, 171 (2018), pp. 63-77, 10.1016/j.biosystemseng.2018.04.003 View PDFView articleView in ScopusGoogle Scholar Seyyedhasani et al., 2019 H. Seyyedhasani, J.S. Dvorak, E. Roemmele Routing algorithm selection for field coverage planning based on field shape and fleet size Computers and Electronics in Agriculture, 156 (December 2018) (2019), pp. 523-529, 10.1016/j.compag.2018.12.002 View PDFView articleView in ScopusGoogle Scholar Sinha et al., 2017 R.S. Sinha, Y. Wei, S.H. Hwang A survey on LPWA technology: LoRa and NB-IoT ICT Express, 3 (1) (2017), pp. 14-21, 10.1016/j.icte.2017.03.004 View PDFView articleView in ScopusGoogle Scholar Sjolander et al., 2011 A.J. Sjolander, J.A. Thomasson, R. Sui, Y. Ge Wireless tracking of cotton modules. Part 2: Automatic machine identification and system testing Computers and Electronics in Agriculture, 75 (1) (2011), pp. 34-43, 10.1016/j.compag.2010.09.015 View PDFView articleView in ScopusGoogle Scholar Skou-Nielsen et al., 2017 N. Skou-Nielsen, A. Villa-Henriksen, O. Green, G.T.C. Edwards Creating a statistically representative set of Danish agricultural field shapes to robustly test route planning algorithms Precision agriculture (ECPA) 2017, 8:2 (2017), pp. 615-619, 10.1017/S2040470017000188 Edinburgh View PDFView articleGoogle Scholar S\\u00f8rensen and Bochtis, 2010 C.G. S\\u00f8rensen, D.D. Bochtis Conceptual model of fleet management in agriculture Biosystems Engineering, 105 (1) (2010), pp. 41-50 View PDFView articleView in ScopusGoogle Scholar S\\u00f8rensen et al., 2010 C.G. S\\u00f8rensen, S. Fountas, E. Nash, L. Pesonen, D. Bochtis, S.M. Pedersen, et al. Conceptual model of a future farm management information system Computers and Electronics in Agriculture, 72 (1) (2010), pp. 37-47, 10.1016/j.compag.2010.02.003 View PDFView articleView in ScopusGoogle Scholar S\\u00f8rensen et al., 2011 C.G. S\\u00f8rensen, L. Pesonen, D.D. Bochtis, S.G. Vougioukas, P. Suomi Functional requirements for a future farm management information system Computers and Electronics in Agriculture, 76 (2011), pp. 266-276, 10.1016/j.compag.2011.02.005 View PDFView articleView in ScopusGoogle Scholar Steen et al., 2012 K.A. Steen, A. Villa-Henriksen, O.R. Therkildsen, O. Green Automatic detection of animals in mowing operations using Thermal cameras Sensors, 12 (6) (2012), pp. 7587-7597, 10.3390/s120607587 View in ScopusGoogle Scholar Stewart et al., 2017 J. Stewart, R. Stewart, S. Kennedy Internet of Things - propagation modelling for precision agriculture applications Wireless telecommunications symposium (2017), 10.1109/WTS.2017.7943528 Google Scholar Sto\\u010des et al., 2016 M. Sto\\u010des, J. Van\\u011bk, J. Masner, J. Pavl\\u00edk Internet of Things (IoT) in agriculture -selected aspects AGRIS On-Line Papers in Economics and Informatics, 1 (1) (2016), pp. 83-88, 10.7160/aol.2016.080108 View in ScopusGoogle Scholar Suhonen et al., 2012 J. Suhonen, M. Kohvakka, V. Kaseva, T.D. H\\u00e4m\\u00e4l\\u00e4inen, M. H\\u00e4nnik\\u00e4inen Communication protocols Low-power wireless sensor networks protocols, services and applications (1st ed.), Springer-Verlag, New York (2012), pp. 27-41, 10.1007/978-1-4614-2173-3 Google Scholar Sundmaeker et al., 2016 H. Sundmaeker, C. Verdouw, S. Wolfert, L. P\\u00e9rez Freire Internet of food and farm 2020 O. Vermesan, P. Friess (Eds.), Digitising the industry Internet of Things connecting the physical, digital and virtual worlds, Vol. 49, River Publishers, Gistrup, Denmark (2016), pp. 1689-1699, 10.1017/CBO9781107415324.004 Google Scholar Talavera et al., 2017 J.M. Talavera, L.E. Tob\\u00f3n, J.A. G\\u00f3mez, M.A. Culman, J.M. Aranda, D.T. Parra, et al. Review of IoT applications in agro-industrial and environmental fields Computers and Electronics in Agriculture, 142 (118) (2017), pp. 283-297, 10.1016/j.compag.2017.09.015 View PDFView articleView in ScopusGoogle Scholar Tanaka, 2018 K. Tanaka Low delay data gathering method for rice cultivation management system IoT specialized outdoor communication procedure 2018 International conference on Information and computer technologies (ICICT), IEEE (2018), pp. 139-143, 10.1109/INFOCT.2018.8356857 View in ScopusGoogle Scholar Tan and Panda, 2010 Y.K. Tan, S.K. Panda Review of energy harvesting Technologies for sustainable wireless sensor network Y.K. Tan, W. Seah (Eds.), Sustainable wireless sensor networks, InTech, Rijeka, Croatia (2010), pp. 15-43, 10.5772/663 View in ScopusGoogle Scholar Temprilho et al., 2018 A. Temprilho, L. N\\u00f3brega, P. Pedreiras, P. Gon\\u00e7alves, S. Silva M2M communication stack for intelligent farming Global Internet of Things summit (GIoTS) (2018), 10.1109/GIOTS.2018.8534560 Google Scholar Tilman et al., 2011 D. Tilman, C. Balzer, J. Hill, B.L. Befort Global food demand and the sustainable intensification of agriculture Proceedings of the national academy of sciences of the United States of America, Vol. 108 (2011), pp. 20260-20264, 10.1073/pnas.1116437108 View in ScopusGoogle Scholar Tuna and Gungor, 2016 G. Tuna, V.C. Gungor Energy harvesting and battery technologies for powering wireless sensor networks Industrial Wireless Sensor Networks, Elsevier Ltd (2016), 10.1016/B978-1-78242-230-3.00002-7 Google Scholar Tuna et al., 2017 G. Tuna, D.G. Kogias, V.C. Gungor, C. Gezer, E. Ta\\u015fk\\u0131n, E. Ayday A survey on information security threats and solutions for Machine to Machine (M2M) communications Journal of Parallel and Distributed Computing, 109 (2017), pp. 142-154, 10.1016/j.jpdc.2017.05.021 View PDFView articleView in ScopusGoogle Scholar Tzounis et al., 2017 A. Tzounis, N. Katsoulas, T. Bartzanas, C. Kittas Internet of Things in agriculture, recent advances and future challenges Biosystems Engineering, 164 (2017), pp. 31-48, 10.1016/j.biosystemseng.2017.09.007 View PDFView articleView in ScopusGoogle Scholar Uddin et al., 2018 M.A. Uddin, A. Mansour, D. Le Jeune, M. Ayaz, el-H.M. Aggoune UAV-assisted dynamic clustering of wireless sensor networks for crop health monitoring Sensors, 18 (2) (2018), p. 555, 10.3390/s18020555 View in ScopusGoogle Scholar Veer and Wiles, 2008 H. van der Veer, A. Wiles Achieving Technical interoperability - the ETSI approach ETSI white paper (2008) Retrieved from https://www.etsi.org/images/files/ETSIWhitePapers/IOP whitepaper Edition 3 final.pdf Google Scholar Vellidis et al., 2008 G. Vellidis, M. Tucker, C. Perry, C. Kvien, C. Bednarz A real-time wireless smart sensor array for scheduling irrigation Computers and Electronics in Agriculture, 61 (1) (2008), pp. 44-50, 10.1016/j.compag.2007.05.009 View PDFView articleView in ScopusGoogle Scholar Verdouw, 2016 C. Verdouw Internet of Things in agriculture CAB reviews: Perspectives in agriculture, veterinary science, Nutrition and Natural Resources, 11 (35) (2016), 10.1079/PAVSNNR201611035 Google Scholar Verdouw et al., 2017 C. Verdouw, S. Wolfert, G. Beers, H. Sundmaeker, G. Chatzikostas IOF2020 : Fostering business and software ecosystems for large-scale uptake of IoT in food and farming The International tri-conference for precision agriculture in 2017 (2017), 10.5281/zenodo.1002903 Google Scholar Viljanen et al., 2018 N. Viljanen, E. Honkavaara, R. N\\u00e4si, T. Hakala, O. Niemel\\u00e4inen, Kai A novel machine learning method for estimating biomass of grass swards using a photogrammetric canopy height model , images and vegetation indices captured by a drone Agriculture, 8 (5) (2018), p. 70, 10.3390/agriculture8050070 1\\u201328 View in ScopusGoogle Scholar Villa-Henriksen et al., 2018 A. Villa-Henriksen, N. Skou-Nielsen, C.A.G. S\\u00f8rensen, O. Green, G.T.C. Edwards, et al. Internet-based harvest fleet logistic optimisation P.W.G. Groot Koerkamp (Ed.), Proceedings of the European Agricultural Conference, 8-12 July, Wageningen, the Netherlands, Wageningen University and Research, Wageningen (2018), pp. 56-61, 10.18174/471679 Accessed 14 Jan 2020 Google Scholar Vuran et al., 2018 M.C. Vuran, A. Salam, R. Wong, S. Irmak Internet of underground things in precision agriculture : Architecture and technology aspects Ad Hoc Networks, 81 (2018), pp. 160-173, 10.1016/j.adhoc.2018.07.017 View PDFView articleView in ScopusGoogle Scholar Wang et al., 2014 H.Z. Wang, G.W. Lin, J.Q. Wang, W.L. Gao, Y.F. Chen, Q.L. Duan Management of big data in the internet of Things in agriculture based on cloud computing Applied Mechanics and Materials, 548\\u2013549 (2014), pp. 1438-1444, 10.4028/www.scientific.net/AMM.548-549.1438 View in ScopusGoogle Scholar Wolanin et al., 2019 A. Wolanin, G. Camps-valls, L. G\\u00f3mez-chova, G. Mateo-garc\\u00eda, C. Van Der Tol, Y. Zhang, et al. Remote Sensing of Environment Estimating crop primary productivity with Sentinel-2 and Landsat 8 using machine learning methods trained with radiative transfer simulations Remote Sensing of Environment, 225 (March) (2019), pp. 441-457, 10.1016/j.rse.2019.03.002 View PDFView articleView in ScopusGoogle Scholar Wolfert et al., 2017 S. Wolfert, L. Ge, C. Verdouw, M.J. Bogaardt Big data in smart farming \\u2013 a review Agricultural Systems, 153 (2017), pp. 69-80, 10.1016/j.agsy.2017.01.023 View PDFView articleView in ScopusGoogle Scholar World Bank, 2017 World Bank ICT in agriculture: Connecting smallholders to knowledge, networks, and institutions (updated ed) The World Bank Group, Washington DC (2017), 10.1596/978-1-4648-1002-2 Google Scholar Xian, 2017 K. Xian Internet of Things online monitoring system based on cloud computing International Journal of Online and Biomedical Engineering, 13 (9) (2017), pp. 123-131, 10.3991/ijoe.v13i09.7591 View in ScopusGoogle Scholar Yan et al., 2018 M. Yan, P. Liu, R. Zhao, L. Liu, W. Chen, X. Yu, et al. Field microclimate monitoring system based on wireless sensor network Journal of Intelligent and Fuzzy Systems, 35 (2) (2018), pp. 1325-1337, 10.3233/JIFS-169676 View in ScopusGoogle Scholar Zhai, 2017 A.F. Zhai Optimization of agricultural production control based on data processing Technology of agricultural Internet of Things Italian Journal of Pure and Applied Mathematics, 38 (2017), pp. 243-252 View in ScopusGoogle Scholar Zhang et al., 2017 A. Zhang, I. Baker, E. Jakku, R. Llewellyn Accelerating precision agriculture to decision agriculture : The needs and drivers for the present and future of digital agriculture in Australia A cross-industry producer survey for the Rural R&D for Profit \\u2018Precision to Decision\\u2019 (P2D) project, EP175936 (2017) Google Scholar Zhao, Lin et al., 2018 W. Zhao, S. Lin, J. Han, R. Xu, L. Hou Design and implementation of smart irrigation system based on LoRa 2017 IEEE globecom workshops (GC wkshps), IEEE, Singapore, Singapore (2018), pp. 1-6, 10.1109/GLOCOMW.2017.8269115 Google Scholar Zhao, Lucani et al., 2018 X. Zhao, D.E. Lucani, X. Shen, H. Wang Reliable IoT Storage : Minimizing bandwidth use in storage without newcomer nodes IEEE Communications Letters, 22 (7) (2018), pp. 1462-1465, 10.1109/LCOMM.2018.2831669 View in ScopusGoogle Scholar Zhou et al., 2014 K. Zhou, A. Leck Jensen, C.G. S\\u00f8rensen, P. Busato, D.D. Bothtis Agricultural operations planning in fields with multiple obstacle areas Computers and Electronics in Agriculture, 109 (2014), pp. 12-22, 10.1016/j.compag.2014.08.013 View PDFView articleView in ScopusGoogle Scholar Zou and Quan, 2017 Y. Zou, L. Quan A new service-oriented grid-based method for AIoT application and implementation Modern Physics Letters B, 31 (19\\u201321) (2017), p. 1740064, 10.1142/S0217984917400644 View in ScopusGoogle Scholar Zude-Sasse et al., 2016 M. Zude-Sasse, S. Fountas, T.A. Gemtos, N. Abu-Khalaf Applications of precision agriculture in horticultural crops European Journal of Horticultural Science, 81 (2) (2016), pp. 78-90, 10.17660/eJHS.2016/81.2.2 View in ScopusGoogle Scholar Cited by (0) \\u00a9 2020 The Authors. Published by Elsevier Ltd on behalf of IAgrE. Recommended articles Route planning evaluation of a prototype optimised infield route planner for neutral material flow agricultural operations Biosystems Engineering, Volume 153, 2017, pp. 149-157 Gareth T.C. Edwards, \\u2026, Ole Green View PDF Architecting user-centric internet of things for smart agriculture Sustainable Computing: Informatics and Systems, Volume 23, 2019, pp. 88-102 Akash Sinha, \\u2026, Prabhat Kumar View PDF Effect of velocity ratio on performance characteristics of an active-passive combination tillage implement Biosystems Engineering, Volume 191, 2020, pp. 1-12 Ganesh Upadhyay, Hifjur Raheman View PDF Show 3 more articles Article Metrics Citations Policy Citations: 5 Citation Indexes: 205 Captures Readers: 835 Mentions News Mentions: 22 Social Media Shares, Likes & Comments: 3 View details About ScienceDirect Remote access Shopping cart Advertise Contact and support Terms and conditions Privacy policy Cookies are used by this site. Cookie settings | Your Privacy Choices All content on this site: Copyright \\u00a9 2024 Elsevier B.V., its licensors, and contributors. All rights are reserved, including those for text and data mining, AI training, and similar technologies. For all open access content, the Creative Commons licensing terms apply.\\\"\",\n    \"analysis\": \"\",\n    \"verbatim_quote1\": \"\",\n    \"verbatim_quote2\": \"\",\n    \"verbatim_quote3\": \"\",\n    \"relevance_score1\": 0,\n    \"relevance_score2\": 0,\n    \"limitations\": \"\",\n    \"inline_citation\": \"\",\n    \"journal\": \"Biosystems Engineering\",\n    \"pdf_link\": null,\n    \"publication_year\": 2020,\n    \"title\": \"Internet of Things in arable farming: Implementation, applications, challenges and potential\"\n  }\n]"